K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    2020.11.01.01
      Fixed issues with FEATURE_WEB_SERVER and FEATURE_INTERNET_LINK when compiled with main features and settings files.

    2021.01.24.01
      Added the \:comp extended command to change keying compensation in the CLI
      keying_compensation is now stored in eeprom
      NOTE: increasing keying compensation above 35 mS at ~24 WPM causes wonkiness.  Probably need to add code to limit this value based on current WPM

    2021.01.25.01
      Keying compensation now displayed in \S status CLI command
      Added Q command to FEATURE_COMMAND_MODE: Adjust keying compensation (left paddle = increase, right paddle = decrease)
      FEATURE_COMMAND_LINE_INTERFACE \:comp command now displays warning if keying compensation setting is probably too high

    2021.03.10.01
      Merged Pull Request 108 https://github.com/k3ng/k3ng_cw_keyer/pull/108 from VK2EFL
        Adds to the \S CLI listing a display of the current tx's lead and tail times, plus the hang time (in wordspace units) plus the memory repeat time.
      Merged Pull Request 109 https://github.com/k3ng/k3ng_cw_keyer/pull/109 from VK2EFL
        Adds the option of a memory repeat time between repeated playing of memory 1 when in beacon mode.
        Adds the option of having the PTT tail time added to the PTT at the end of each playing of memory 1 when in beacon mode.

    2021.03.20.01
      Updated version number for merging of Pull Request 110 https://github.com/k3ng/k3ng_cw_keyer/pull/110 from FrugalGuy (Ron, KO4RON)
        Adds FEATURE_LCD_BACKLIGHT_AUTO_DIM

    2021.03.23
      Added pins pin_sending_mode_automatic and pin_sending_mode_manual which go HIGH for automatica and manual sending modes

    2022.02.01 //SP5IOU
      Added support for ESP32_DEV board (Beta) Compile using ESP32 SDK ver 2.0.1 on newer ver 2.0.2 Sidetone doesn't work - bug in SDK
      Need to update arduino with library Tone32 available at https://github.com/lbernstone/Tone32 
      Added Wifi connectivity for ESP32_DEV board and integrated it with FEATURE_WEB_SERVER
      Files modified - k3ng_keyer.ino, keyer_hardware.h, keyer_debug.h 
      Files added: keyer_features_and_options_ESP32_dev.h, keyer_settings_esp32_dev.h, keyer_pin_settings_esp32_dev.h, keyer_esp32_dev.h
      Added CLI extended command wifi <ssid> <password> .
     

    -> Ported these select changes from original K3NG repo that came after this 2022 vintage ESP32 port
    2023.09.28.1624
      Put OPTION_WINKEY_SEND_BREAKIN_STATUS_BYTE back into all hardware profiles and enabling by default.  Not having it activated makes N1MM CQ Repeat paddle sending deactivation not work.

    2023.09.29.2043
      FEATURE_WINKEY_EMULATION: corrected pot_full_scale_reading  

    2023.10.06.1053
      FEATURE_INTERNET_LINK: Fix lock up related to initialization order (Thanks, SM3GSJ Roger)
    
    2023.10.09.2308
      FEATURE_WINKEY_EMULATION: Now expect three parameters from deprecated Paddle A2D command
      
    2024.02.17.1400
      Fixed issues found by swalberg ( https://github.com/k3ng/k3ng_cw_keyer/commit/e79277672f4c04dfeeef5bfb9c82e384b59f32c4#r134909644 ).  Thanks!

    2024.02.17.1600
      OPTION_WORDSWORTH_POLISH - Polish CW training text from Piotr, SP2BPD.  Thanks!
      Straight key capability for CW training Piotr, SP2BPD.  Thanks!

    2024.03.15.1354
      FEATURE_WINKEY_EMULATION: Changed potentiometer behavior to work correctly with N1MM+ pot settings

    2024.03.20.2239
      tx_inhibit: unkey PTT when tx_inhibit goes active

    -> These are new changes for ESP32 port after 2022.02.01
    2025.10.03 //K7MDL 
      Modified slightly SP5IOU ESP32 changes to run on current (2025) ESP32-WROOM-32 dev board.  
      Added BT_Keyboard Class, slightly modified from https://github.com/turgu1/bt-keyboard and converted to an Arduino library
      Tested on Rii i8+ mini BT keyboard (BLE) and Logitech BT Classic K380 keyboard
      Build creates precompiled images.

    2025.12.23 //K7MDL
      Added TFT displays of various sizes including optional rows of Touch buttons with GT911 touch controller
      Changed ESP32 to use GPIO interrupts for paddles and key for more accurate high speed chars
      Added support for MCP23017 port expander using interrupt and single read of all 16 ports for speed
      Button 2 cycles through all 10 CW memories with each tap and displays teh txt in each memory.
      All other buttons only have test text, no roles are assigned yet.

  Documentation: https://github.com/k3ng/k3ng_cw_keyer/wiki

  Support: https://groups.io/g/radioartisan  ( Please do not email K3NG directly for support.  Thanks )

  YouTube Channel: https://www.youtube.com/channel/UC5o8UM1-heT5kJbwnJRkUYg


  This code is currently maintained for and compiled with Arduino 1.8.x.  Your mileage may vary with other versions.


  ATTENTION: LIBRARY FILES MUST BE PUT IN LIBRARIES DIRECTORIES AND NOT THE INO SKETCH DIRECTORY !!!!

  FOR EXAMPLE:

    K3NG_PS2Keyboard.h, K3NG_PS2Keyboard.cpp ----->  \Arduino\Sketchbook\libraries\K3NG_PS2Keyboard\
    Goertz.h, Goertz.cpp ------------------------>   \Arduino\Sketchbook\libraries\Goertz\

  
  "Make good code and share it with friends."


If you offer a hardware kit using this software, show your appreciation by sending the author a complimentary kit or a bottle of bourbon ;-)

*/

//#define CODE_VERSION "K7MDL-2026.1.26.1"   // moved to feature and options.h file to make it easier to find
//#define eeprom_magic_number 56            // moved also
#include <Arduino.h>
#include <stdio.h>
#include "keyer_hardware.h"

#if defined(ARDUINO_SAM_DUE)  
  #include <SPI.h>
  #include <Wire.h>
  #define tone toneDUE
  #define noTone noToneDUE
#elif defined(ARDUINO_MAPLE_MINI)|| defined(ARDUINO_GENERIC_STM32F103C) || defined(__STM32F1__)
  #include <SPI.h>
  #include <Wire.h>
  #include <EEPROM.h> 
  #include "keyer_stm32duino.h" 
#elif defined(_BOARD_PIC32_PINGUINO_)
  #include <EEPROM.h>
#elif defined(ARDUINO_SAMD_VARIANT_COMPLIANCE)
  #include <FlashAsEEPROM.h> 
#elif defined(HARDWARE_ESP32_DEV)
  #include "EEPROM.h"
  #include "Preferences.h"
  //#include <Tone32.h> // SP5IOU 2021/08/02 library Tone32h assure ESP32 compatibility with avr tone / no tone built in commands. 
                      // Download from here https://github.com/lbernstone/Tone32 - do not use, now included in Arduino library
  #include "keyer_esp32_dev.h"
  #include <esp_task_wdt.h>
  static const char* TAG = "Main";
  //#define ARDUINO_ARCH_ESP32
#elif defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)
  #include "EEPROM.h"
  #include <PWMAudio.h>
  #include "keyer.h"
  PWMAudio pwm;
#else
  #include <avr/pgmspace.h>
  #include <avr/wdt.h>
  #include <EEPROM.h>  
#endif

#if defined(HARDWARE_OPENCWKEYER_MK2)
  #include "keyer_features_and_options_opencwkeyer_mk2.h"
#elif defined(HARDWARE_NANOKEYER_REV_B)
  #include "keyer_features_and_options_nanokeyer_rev_b.h"
#elif defined(HARDWARE_NANOKEYER_REV_D)
  #include "keyer_features_and_options_nanokeyer_rev_d.h"
#elif defined(HARDWARE_OPEN_INTERFACE)
  #include "keyer_features_and_options_open_interface.h"
#elif defined(HARDWARE_TINYKEYER)
  #include "keyer_features_and_options_tinykeyer.h"
#elif defined(HARDWARE_FK_10)
  #include "keyer_features_and_options_fk_10.h"  
#elif defined(HARDWARE_FK_11)
  #include "keyer_features_and_options_fk_11.h"
#elif defined(HARDWARE_MAPLE_MINI)//sp5iou 20180328
  #include "keyer_features_and_options_maple_mini.h"
#elif defined(HARDWARE_GENERIC_STM32F103C)//sp5iou 20180329
  #include "keyer_features_and_options_generic_STM32F103C.h"
#elif defined(HARDWARE_MORTTY)
  #include "keyer_features_and_options_mortty.h"
#elif defined(HARDWARE_MORTTY_REGULAR)
  #include "keyer_features_and_options_mortty_regular.h"  
#elif defined(HARDWARE_MORTTY_REGULAR_WITH_POTENTIOMETER)
  #include "keyer_features_and_options_mortty_regular_with_potentiometer.h"   
#elif defined(HARDWARE_MORTTY_SO2R)
  #include "keyer_features_and_options_mortty_so2r.h"   
#elif defined(HARDWARE_MORTTY_SO2R_WITH_POTENTIOMETER)
  #include "keyer_features_and_options_mortty_so2r_with_potentiometer.h"    
#elif defined(HARDWARE_K5BCQ)
  #include "keyer_features_and_options_k5bcq.h"
#elif defined(HARDWARE_MEGAKEYER)
  #include "keyer_features_and_options_megakeyer.h"
#elif defined(HARDWARE_TEST_EVERYTHING)
  #include "keyer_features_and_options_test_everything.h"
#elif defined(HARDWARE_YAACWK)
  #include "keyer_features_and_options_yaacwk.h"
#elif defined(HARDWARE_ESP32_DEV)//sp5iou 20220123
  #include "keyer_features_and_options_esp32_dev.h"
  #define EEPROM_size 2048
#elif defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)
  #include "keyer_features_and_options_pico.h"
  #define EEPROM_size 2048
#elif defined(HARDWARE_TEST)
  #include "keyer_features_and_options_test.h"
#elif defined(HARDWARE_IZ3GME)
  #include "keyer_features_and_options_iz3gme.h"
#elif defined(HARDWARE_YCCC_SO2R_MINI)
  #include "keyer_features_and_options_yccc_so2r_mini.h"  
#else
  #include "keyer_features_and_options.h"
#endif

#if !defined(HARDWARE_ESP32_DEV) && !defined(ARDUINO_RASPBERRY_PI_PICO_W) && !defined(ARDUINO_RASPBERRY_PI_PICO)
  #include "keyer.h"
#endif

#ifdef FEATURE_EEPROM_E24C1024
  #include <E24C1024.h>
  #define EEPROM EEPROM1024
#endif 

#include "keyer_dependencies.h"
#include "keyer_debug.h"

#if defined(HARDWARE_OPENCWKEYER_MK2)
  #include "keyer_pin_settings_opencwkeyer_mk2.h"
  #include "keyer_settings_opencwkeyer_mk2.h"
#elif defined(HARDWARE_NANOKEYER_REV_B)
  #include "keyer_pin_settings_nanokeyer_rev_b.h"
  #include "keyer_settings_nanokeyer_rev_b.h"
#elif defined(HARDWARE_NANOKEYER_REV_D)
  #include "keyer_pin_settings_nanokeyer_rev_d.h"
  #include "keyer_settings_nanokeyer_rev_d.h"
#elif defined(HARDWARE_OPEN_INTERFACE)
  #include "keyer_pin_settings_open_interface.h"
  #include "keyer_settings_open_interface.h"
#elif defined(HARDWARE_TINYKEYER)
  #include "keyer_pin_settings_tinykeyer.h"
  #include "keyer_settings_tinykeyer.h"
#elif defined(HARDWARE_FK_10)
  #include "keyer_pin_settings_fk_10.h"
  #include "keyer_settings_fk_10.h"
#elif defined(HARDWARE_FK_11)
  #include "keyer_pin_settings_fk_11.h"
  #include "keyer_settings_fk_11.h"
#elif defined(HARDWARE_MAPLE_MINI)
  #include "keyer_pin_settings_maple_mini.h"
  #include "keyer_settings_maple_mini.h"
#elif defined(HARDWARE_ESP32_DEV)//sp5iou 20220123
  #include "keyer_pin_settings_esp32_dev.h"
  #include "keyer_settings_esp32_dev.h"
  #ifdef ARDUINO_ARCH_ESP32
    #include "esp32-hal-log.h"
  #endif
#elif defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)
  #include "keyer_pin_settings_pico.h"
  #include "keyer_settings_pico.h"
#elif defined(HARDWARE_GENERIC_STM32F103C)
  #include "keyer_pin_settings_generic_STM32F103C.h"
  #include "keyer_settings_generic_STM32F103C.h"
#elif defined(HARDWARE_MORTTY)
  #include "keyer_pin_settings_mortty.h"
  #include "keyer_settings_mortty.h"  
#elif defined(HARDWARE_MORTTY_REGULAR)
  #include "keyer_pin_settings_mortty_regular.h"
  #include "keyer_settings_mortty_regular.h"   
#elif defined(HARDWARE_MORTTY_REGULAR_WITH_POTENTIOMETER)
  #include "keyer_pin_settings_mortty_regular_with_potentiometer.h"
  #include "keyer_settings_mortty_regular_with_potentiometer.h"   
#elif defined(HARDWARE_MORTTY_SO2R)
  #include "keyer_pin_settings_mortty_so2r.h"
  #include "keyer_settings_mortty_so2r.h"   
#elif defined(HARDWARE_MORTTY_SO2R_WITH_POTENTIOMETER)
  #include "keyer_pin_settings_mortty_so2r_with_potentiometer.h"
  #include "keyer_settings_mortty_so2r_with_potentiometer.h"    
#elif defined(HARDWARE_K5BCQ)
  #include "keyer_pin_settings_k5bcq.h"
  #include "keyer_settings_k5bcq.h"
#elif defined(HARDWARE_MEGAKEYER)
  #include "keyer_pin_settings_megakeyer.h"
  #include "keyer_settings_megakeyer.h"
#elif defined(HARDWARE_TEST_EVERYTHING)
  #include "keyer_pin_settings_test_everything.h"
  #include "keyer_settings_test_everything.h"
#elif defined(HARDWARE_YAACWK)
  #include "keyer_pin_settings_yaacwk.h"
  #include "keyer_settings_yaacwk.h"
#elif defined(HARDWARE_TEST)
  #include "keyer_pin_settings_test.h"
  #include "keyer_settings_test.h"
#elif defined(HARDWARE_IZ3GME)
  #include "keyer_pin_settings_iz3gme.h"
  #include "keyer_settings_iz3gme.h"
#elif defined(HARDWARE_YCCC_SO2R_MINI)
  #include "keyer_pin_settings_yccc_so2r_mini.h"
  #include "keyer_settings_yccc_so2r_mini.h"  
#else
  #include "keyer_pin_settings.h"
  #include "keyer_settings.h"
#endif

#ifdef ARDUINO_ARCH_ESP32 
  #include "esp32-hal-log.h" 
#endif

