K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
#if !defined(HARDWARE_GENERIC_STM32F103C) && !defined(FEATURE_MCP23017_EXPANDER) // bypass when using mcp23017_write_io in place of digital write
  #if (paddle_left == 0) || (paddle_right == 0)
  #error "You cannot define paddle_left or paddle_right as 0 to disable"
  #endif
#endif

#if defined(FEATURE_BUTTONS)
  #include "src/buttonarray/buttonarray.h"
#endif

#if defined(FEATURE_SIDETONE_NEWTONE) && !defined(OPTION_SIDETONE_DIGITAL_OUTPUT_NO_SQUARE_WAVE)
  #include <NewTone.h>
  #define tone   NewTone
  #define noTone noNewTone
#endif //FEATURE_SIDETONE_NEWTONE

#if defined(FEATURE_SLEEP) && !defined(HARDWARE_GENERIC_STM32F103C) && !defined(HARDWARE_MAPLE_MINI) && !defined(HARDWARE_ESP32_DEV)
  #include <avr/sleep.h>  // It should be different library for STM32 and ESP32 sp5iou
#endif 

#if defined(FEATURE_PS2_KEYBOARD)
  #include <K3NG_PS2Keyboard.h>
#endif

#if defined(FEATURE_BT_KEYBOARD)
  #if defined(HARDWARE_ESP32_DEV)  
    #include "bt_keyboard.hpp"  // from esp-32 project component folder
    #include "esp_err.h"
    #include "nvs_flash.h"
    BTKeyboard bt_keyboard;
    uint8_t CTRL_MASK;
    uint8_t SHIFT_MASK;
    uint8_t ALT_MASK;
    uint8_t META_MASK;
  #endif
  #if defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)
    #include <BluetoothHIDMaster.h>
    // We need the inverse map, borrow from the Keyboard library
    #include <HID_Keyboard.h>

    extern const uint8_t KeyboardLayout_en_US[128];
    BluetoothHIDMaster bt_keyboard;
    //HIDKeyStream keystream;
    const char *DATAHEADER = "Last BLE Address"; // exactly 16 chars + \0
    
    typedef struct {
      char hdr[16];     // The header marker so we know this is our data
      uint8_t addr[6];  // MAC of the peer we last connected to
      uint8_t addrType; // Type of address (normal or randomized) of the last peer
    } EEPROMDATA;
    
    //const uint8_t KEY_CAPS_LOCK = 0x39;
    enum class KeyModifier : uint8_t {
      L_CTRL  = 0x01,
      L_SHIFT = 0x02,
      L_ALT   = 0x04,
      L_META  = 0x08,
      R_CTRL  = 0x10,
      R_SHIFT = 0x20,
      R_ALT   = 0x40,
      R_META  = 0x80
    };

    const uint8_t CTRL_MASK  = ((uint8_t)KeyModifier::L_CTRL) | ((uint8_t)KeyModifier::R_CTRL);
    const uint8_t SHIFT_MASK = ((uint8_t)KeyModifier::L_SHIFT) | ((uint8_t)KeyModifier::R_SHIFT);
    const uint8_t ALT_MASK   = ((uint8_t)KeyModifier::L_ALT) | ((uint8_t)KeyModifier::R_ALT);
    const uint8_t META_MASK  = ((uint8_t)KeyModifier::L_META) | ((uint8_t)KeyModifier::R_META);

    const uint8_t MAX_KEY_DATA_SIZE = 20;
    typedef struct {
      uint8_t     size;
      uint8_t     keys[MAX_KEY_DATA_SIZE];
      uint8_t     state;
      KeyModifier modifier;
    } KeyInfo;  

    KeyInfo inf;
    //bool new_bt_key = false;
    #ifdef USE_BLE
      bool use_BLE = true;
    #else
      bool use_BLE = false;
    #endif
    #define is_connected connected   // handle both esp and pico forms
  #endif
#endif

#if defined(FEATURE_LCD_4BIT) || defined(FEATURE_LCD1602_N07DH) || defined (FEATURE_LCD_8BIT) // works on 3.2V supply and logic, but do not work on every pins (SP5IOU)
  #include <LiquidCrystal.h>
  #include <Wire.h>
#endif

#if defined(FEATURE_LCD_ADAFRUIT_I2C) || defined(FEATURE_LCD_ADAFRUIT_BACKPACK) || defined(FEATURE_LCD_YDv1) || defined(FEATURE_LCD_SAINSMART_I2C) || defined(FEATURE_LCD_FABO_PCF8574) || defined(FEATURE_LCD_MATHERTEL_PCF8574)
  #include <Wire.h>
#endif

#if defined(FEATURE_LCD_YDv1)
  #include "LiquidCrystal_I2C.h"
#endif

#if defined(FEATURE_LCD_ADAFRUIT_I2C)
  #include <Adafruit_MCP23017.h>
  #include <Adafruit_RGBLCDShield.h>
#endif

#if defined(FEATURE_LCD_ADAFRUIT_BACKPACK)
  #include "Adafruit_LiquidCrystal.h"
#endif

#if defined(FEATURE_LCD_SAINSMART_I2C)
  #include <LiquidCrystal_I2C.h>
#endif

#if defined(FEATURE_LCD_FABO_PCF8574)
  #include <FaBoLCD_PCF8574.h>
#endif  

#if defined(FEATURE_LCD_MATHERTEL_PCF8574)
  #include "LiquidCrystal_PCF8574.h"
#endif

#if defined(FEATURE_LCD_I2C_FDEBRABANDER)
  #include "LiquidCrystal_I2C.h"
#endif

#if defined(FEATURE_LCD_LIQUIDCRYSTAL_I2C)
  #include <Wire.h>
  #include "LiquidCrystal_I2C.h"
#endif

#if defined(FEATURE_TFT_DISPLAY)
 
  #define CONFIG_I2C_ENABLE_SLAVE_DRIVER_VERSION
  //#define TFT_VIEWPORT
  #ifdef M5STACK_CORE2a
    //#include <M5ModuleDisplay.h>
    #include "SPI.h"
    #include <TFT_eSPI.h> // Graphics and font library for ILI9341 driver chip
    TFT_eSPI lcd = TFT_eSPI();  // Invoke library
    //#include <m5stack_core_2.h>
    //#include  <m5gfx.h>
    //#include <M5Unified.h>
    //#define lcd M5.Lcd

    //#define setTextColor(a,b,c) setTextColor(a,b)
    //#define fillSmoothRoundRect(x,y,w,h,r,fg,bg) fillSmoothRoundRect(x,y,w,h,r,fg)
    //#define drawSmoothRoundRect(x,y,r,ir,w,h,fg,bg) drawRoundRect(x,y,w,h,r,fg) 
    #define setFreeFont(a) setFont(a)
    #define FM9 &fonts::FreeMono9pt7b
    #define FMB12 &fonts::FreeMonoBold12pt7b 
    #define FS9 &fonts::FreeSans9pt7b
    #define TFT_HEIGHT 240
  #else
    #include "SPI.h"
    #include <TFT_eSPI.h> // Graphics and font library for ILI9341 driver chip
    #include "Free_Fonts.h" // Include the header file attached to this sketch
    TFT_eSPI lcd = TFT_eSPI();  // Invoke library

/*   See FreeFonts library for complete list
    #define FM9 &FreeMono9pt7b // mono
    #define FMB9 &FreeMonoBold9pt7b // mono
    #define FM12 &FreeMono12pt7b // mono
    #define FMB12 &FreeMonoBold12pt7b // mono
    
    #define FM18 &FreeMono18pt7b // mono
    #define FMB18 &FreeMonoBold18pt7b // mono
    
    #define FS9 &FreeSans9pt7b // proportional
    #define FSB9 &FreeSansBold9pt7b // proportional
    #define FS12 &FreeSans12pt7b // mono
    #define FSB12 &FreeSansBold12pt7b // mono
    #define FS18 &FreeSans18pt7b // mono
    #define FSB18 &FreeSansBold18pt7b // mono
*/

  #endif
  //#include "Free_Fonts.h" // Include the header file attached to this sketch  
  #define GFXFF 1                 // enable FreeFont set of custom fonts from AdaFruit
  #define MY_DATUM TL_DATUM       // can change to MC_DATAUM for centered text in a drawstring()
  #define SCROLL_BOX_DATUM BL_DATUM
  #define SCROLL_BOX_CENTER_DATUM BC_DATUM //BC_DATUM

  #ifdef TFT_320_480   // 320x480 display

