K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    #define TFT_FONT_SMALL FS9      // FreeFont mono 9pt, not bold.
    #define TFT_FONT_MEDIUM FMB18  // FM18, FMB18 	// FreeFont Mono Bold 12pt
    #define SCROLL_BOX_FONT TFT_FONT_MEDIUM
    #define BUTTON_FONT FS12
    #define COLUMN_WIDTH (lcd.textWidth("W")+2)    // width of mono-spaced scroll box font in pixels, W is a wide letter
    #define FONT_HEIGHT (lcd.fontHeight()+2)   // using 2px padding for line separation
    #define SCREEN_WIDTH (TFT_HEIGHT-1)   // We are rotated horizontal so width and height are reversed.
    #define SCREEN_HEIGHT (TFT_WIDTH-1)
    #define SCROLL_BOX_LEFT_SIDE 2
    #define SCREEN_BOX_HEIGHT 180    // This is set to the working area defined in the currently red border area.  
    #define SCROLL_BOX_TOP 39   // 1 row below the status bar border line
    #define SCROLL_BOX_WIDTH (TFT_HEIGHT-(2*SCROLL_BOX_LEFT_SIDE)) // pixel width of scroll box area
    #define SCROLL_BOX_HEIGHT (SCREEN_BOX_HEIGHT-SCROLL_BOX_TOP-3)  // pixel height of scroll box area inside borders
    #define SCROLL_TEXT_TOP_LINE (SCROLL_BOX_TOP+FONT_HEIGHT-10)   // start of first row of text (y)
    #define SCROLL_TEXT_LEFT_SIDE (SCROLL_BOX_LEFT_SIDE+(COLUMN_WIDTH/2)-2)   // start of text columns (x)
    #define LINE_SPACER 14  // between scroll text lines

    // Status Bar
    #define STATUS_BAR_FONT 4   // 2  or FM9 or FS9
    #define ICON_COLUMN_WIDTH COLUMN_WIDTH-4    // width of mono-spaced status bar font in pixels
    #define ICON_SPACING (ICON_COLUMN_WIDTH-1)
    #define TIME_ANCHOR (4)
    #define TX_NUM_ANCHOR (116)
    #define GRID_ANCHOR (158)
    #define WPM_ANCHOR (292)
    #define ICON_ANCHOR (373)
    #define STATUS_BAR_Y_CURSOR (8)
  
  #else   // 240x320 and 170x320

    #define TFT_FONT_SMALL FS9      // FreeFont mono 9pt, not bold.
    #define TFT_FONT_MEDIUM FS12 //FMB12  	// FreeFont Mono Bold 12pt
    #define SCROLL_BOX_FONT TFT_FONT_MEDIUM
    #define BUTTON_FONT FS12
    #define COLUMN_WIDTH (lcd.textWidth("W")+2)    // width of mono-spaced scroll box font in pixels, W is a wide letter
    #define FONT_HEIGHT ((lcd.fontHeight()+2))    // using 2px padding for line separation
    #define SCREEN_WIDTH (TFT_HEIGHT-1)   // We are rotated horizontal so width and height are reversed.
    #define SCREEN_HEIGHT (TFT_WIDTH-1)
    #define SCROLL_BOX_LEFT_SIDE 5
    #define SCREEN_BOX_HEIGHT 170    // This is set to the working area defined in the currently red border area.  
    // 170 for the 170x320 and 240x320 displays
    // On screens that are larger than 170px, the extra area is intended to be used for buttons or status windows.
    // you can set this to full height and increase the LCD_ROWS setting but 5 rows seems plenty to avoid much clutter. 
    #define SCROLL_BOX_TOP 29   // 1 row below the status bar border line
    #define SCROLL_BOX_WIDTH (TFT_HEIGHT-(2*SCROLL_BOX_LEFT_SIDE)) // pixel width of scroll box area
    #define SCROLL_BOX_HEIGHT (SCREEN_BOX_HEIGHT-SCROLL_BOX_TOP-3)  // pixel height of scroll box area inside borders
    #define SCROLL_TEXT_TOP_LINE (SCROLL_BOX_TOP+FONT_HEIGHT-12)   // start of first row of text (y)
    #define SCROLL_TEXT_LEFT_SIDE (SCROLL_BOX_LEFT_SIDE+12)   // start of text columns (x)
    #define LINE_SPACER 12  // between scroll text lines
    
    // Status Bar
    #define STATUS_BAR_FONT 2   // 2  or FM9 or FS9
    #define ICON_COLUMN_WIDTH 12    // width of mono-spaced status bar font in pixels
    #define SCROLL_BOX_FONT FMB12   // 4
    #define ICON_SPACING (ICON_COLUMN_WIDTH+2)
    #define TIME_ANCHOR (2)
    #define TX_NUM_ANCHOR (76)
    #define GRID_ANCHOR (108)
    #define WPM_ANCHOR (202)
    #define ICON_ANCHOR (250)
    #define STATUS_BAR_Y_CURSOR (6)

  #endif
  
  #define TFT_GREY 0x5AEB // New color
 
  #if defined(TOUCH_BUTTON_16)
    #define BUTTON_FONT TFT_FONT_SMALL
    #define BUTTON_HEIGHT 57
    #define BUTTON_WIDTH  57
    #define BUTTON_ROW  (SCROLL_BOX_TOP+SCROLL_BOX_HEIGHT+12)
    #define BUTTON_ROW2 (BUTTON_ROW+66)  // used when 2 rows are displayed at a time
  #else
    #if defined(TFT_320_480)
      #define BUTTON_FONT FS12
      #define BUTTON_HEIGHT 86
      #define BUTTON_WIDTH  86
      #define BUTTON_ROW  (SCROLL_BOX_TOP+SCROLL_BOX_HEIGHT+30)
      #define BUTTON_ROW2 (BUTTON_ROW+66)  // only used when 2 rows are displayed at a time
    #else
      #define BUTTON_FONT FS9
      #define BUTTON_HEIGHT 60
      #define BUTTON_WIDTH  60
      #define BUTTON_ROW  (SCROLL_BOX_TOP+SCROLL_BOX_HEIGHT+8)
      #define BUTTON_ROW2 (BUTTON_ROW+66)  // only used when 2 rows are displayed at a time
    #endif
  #endif

  
  #define SCROLL_BOX_ROW1 (SCROLL_TEXT_TOP_LINE+LINE_SPACER)
  #define SCROLL_BOX_ROW2 (SCROLL_TEXT_TOP_LINE+FONT_HEIGHT+LINE_SPACER)
  #define SCROLL_BOX_ROW3 (SCROLL_TEXT_TOP_LINE+(2*FONT_HEIGHT)+LINE_SPACER)
  #define SCROLL_BOX_ROW4 (SCROLL_TEXT_TOP_LINE+(3*FONT_HEIGHT)+LINE_SPACER)
  #define SCROLL_BOX_ROW5 (SCROLL_TEXT_TOP_LINE+(4*FONT_HEIGHT)+LINE_SPACER)
  #define SCROLL_BOX_CENTER (SCROLL_BOX_WIDTH/2)
  #define SCROLL_BOX_BOTTOM (SCROLL_BOX_TOP+SCROLL_BOX_HEIGHT)
 
  #define TFT_VIEWPORT_EXISTS (lcd.checkViewport(SCROLL_BOX_LEFT_SIDE+3, SCROLL_BOX_TOP+4, 1, 1))
  #define TFT_SET_VIEWPORT (lcd.setViewport(SCROLL_BOX_LEFT_SIDE+2, SCROLL_BOX_TOP+2, SCROLL_BOX_WIDTH-4, SCROLL_BOX_HEIGHT-4, false))
  #define TFT_SET_WINDOW (lcd.setWindow(SCROLL_BOX_LEFT_SIDE+1, SCROLL_BOX_TOP+1, SCROLL_BOX_WIDTH-2, SCROLL_BOX_HEIGHT-2))
#endif

#if defined(USE_KEY_PIN_INTERRUPTS) || defined(FEATURE_MCP23017_EXPANDER)
  volatile bool paddle_left_state  = true;   // 1 is pulled high, 0 is contact closed
  volatile bool paddle_right_state = true;
  volatile bool straight_key_state = true;
#endif

#ifdef FEATURE_MCP23017_EXPANDER 
  //#include <driver/gpio.h>   
  #include "MCP23017.h"
  #ifdef USE_WIRE1 
    MCP23017 mcp23017 = MCP23017(MCP23X17_ADDR, Wire1);
  #else
    MCP23017 mcp23017 = MCP23017(MCP23X17_ADDR, Wire);
  #endif
#endif

#if defined(HARDWARE_ESP32_DEV) || defined(USE_KEY_PIN_INTERRUPTS) || defined(FEATURE_MCP23017_EXPANDER)
  #include <freertos/event_groups.h>
  //#include "freertos/semphr.h"
  #include <freertos/task.h>
  static EventGroupHandle_t Key_Events = NULL;
#endif

#if defined(FEATURE_LCD_HD44780)
  #include <Wire.h>
  #include <hd44780.h>
  #include <hd44780ioClass/hd44780_I2Cexp.h>
  #define WIRECLOCK 400000L
#endif

#if defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE)
 // #include <BasicTerm.h>
#endif

#if defined(FEATURE_CW_DECODER) && defined(OPTION_CW_DECODER_GOERTZEL_AUDIO_DETECTOR)
  #include <goertzel.h>
#endif
#if defined(FEATURE_WIFI) && defined(HARDWARE_ESP32_DEV) //SP5IOU 20220127
#include <WiFi.h>
#include <WifiClient.h>
#include <WiFiServer.h>
#define EthernetClient WiFiClient
#define EthernetServer WiFiServer
#define EthernetUDP WiFiUDP
#endif

#if defined(FEATURE_ETHERNET)
#if !defined(ARDUINO_MAPLE_MINI) && !defined(ARDUINO_GENERIC_STM32F103C) && !defined(HARDWARE_ESP32_DEV)//sp5iou 20180329 20220127
  #include <Ethernet.h>  // if this is not included, compilation fails even though all ethernet code is #ifdef'ed out
  #if defined(FEATURE_INTERNET_LINK)
    #include <EthernetUdp.h>
  #endif //FEATURE_INTERNET_LINK
#endif //!defined(ARDUINO_MAPLE_MINI) && !defined(ARDUINO_GENERIC_STM32F103C) //sp5iou 20180329  
#endif //FEATURE_ETHERNET


#if defined(FEATURE_USB_KEYBOARD) || defined(FEATURE_USB_MOUSE)  // note_usb_uncomment_lines
  // #include <hidboot.h>  // Arduino 1.6.x (and maybe 1.5.x) has issues with these three lines, moreover we noted that Arduino 1.8.6 it's not afected by an issue during USB Shield SPI init see https://github.com/felis/USB_Host_Shield_2.0/issues/390
  // #include <usbhub.h>   // Uncomment the three lines if you are using FEATURE_USB_KEYBOARD or FEATURE_USB_MOUSE
  // #include <Usb.h>      // Note: the most updated USB Library can be downloaded at https://github.com/felis/USB_Host_Shield_2.0
#endif

#if defined(FEATURE_CW_COMPUTER_KEYBOARD) 
  #include <Keyboard.h>  // Have a problem with Keyboard.h not found?  See https://github.com/k3ng/k3ng_cw_keyer/issues/35
                           // For some unknown reason this line uncommented in Arduino 1.8.1 <sometimes?> causes compilation error (sigh) 
#endif //defined(FEATURE_CW_COMPUTER_KEYBOARD)

#if defined(FEATURE_4x4_KEYPAD)|| defined (FEATURE_3x4_KEYPAD)
  #include <Keypad.h>
#endif

#if defined(FEATURE_SD_CARD_SUPPORT)
  #include <SPI.h>
  #include <SD.h>
#endif //FEATURE_SD_CARD_SUPPORT

#if defined(ARDUINO_SAMD_VARIANT_COMPLIANCE)
  extern uint32_t __get_MSP(void);
  #define SP __get_MSP()
#endif  

