K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
#define memory_area_start (sizeof(configuration)+5)

// Variables and stuff
const uint8_t grid_len_max = 9;
struct config_t {  // 120 bytes total
  
  uint8_t paddle_mode;                                                   
  uint8_t keyer_mode;            
  uint8_t sidetone_mode;
  uint8_t pot_activated;
  uint8_t length_wordspace;
  uint8_t autospace_active;
  uint8_t current_ptt_line;
  uint8_t current_tx;
  uint8_t weighting;
  uint8_t dit_buffer_off;
  uint8_t dah_buffer_off;
  uint8_t cmos_super_keyer_iambic_b_timing_percent;
  uint8_t cmos_super_keyer_iambic_b_timing_on;
  uint8_t link_receive_enabled;
  uint8_t paddle_interruption_quiet_time_element_lengths;
  uint8_t wordsworth_wordspace;
  uint8_t wordsworth_repetition;
  uint8_t cli_mode;
  uint8_t ptt_buffer_hold_active;
  uint8_t ptt_disabled;
  uint8_t beacon_mode_on_boot_up;
  uint8_t keying_compensation;
    // 22 bytes

  unsigned int wpm;
  unsigned int hz_sidetone;
  unsigned int dah_to_dit_ratio;
  unsigned int wpm_farnsworth;
  unsigned int memory_repeat_time;
  unsigned int wpm_command_mode;
  unsigned int link_receive_udp_port; 
  unsigned int wpm_ps2_usb_keyboard;
  unsigned int wpm_cli;
  unsigned int wpm_winkey;
  unsigned int cw_echo_timing_factor;
  unsigned int autospace_timing_factor;
    // 24 bytes 

  uint8_t ip[4];
  uint8_t gateway[4];  
  uint8_t subnet[4]; 
  uint8_t dns_server[4];
    // 16 bytes

  uint8_t link_send_ip[4][FEATURE_INTERNET_LINK_MAX_LINKS];   // FEATURE_INTERNET_LINK_MAX_LINKS = 2
  uint8_t link_send_enabled[FEATURE_INTERNET_LINK_MAX_LINKS];
  unsigned int link_send_udp_port[FEATURE_INTERNET_LINK_MAX_LINKS];
    // 14 bytes

  unsigned int ptt_lead_time[6];
  unsigned int ptt_tail_time[6];
  unsigned int ptt_active_to_sequencer_active_time[5];
  unsigned int ptt_inactive_to_sequencer_inactive_time[5];
    // 44 bytes

  int sidetone_volume;
    // 2 bytes

  uint8_t grid_digits;  // length of gridsquare to display
  char GPS_GridSq[grid_len_max];  // store the active grid square - can come frm GPS or nto avaiable, config file
  char Mem_GridSq[grid_len_max];  // store the user entered grid square
  uint8_t GridSq_source;  // specify which source to use/  0 = Config File, 1 = GPS, 2 = Memory in GRID_WORKING_MEMORY #
  bool ignore_gps;  // set to true if we shoudl not use GPS info
  float declination; // store the declination stored in memory 12 from config, or from a user entered overriding value in memory 12
  uint32_t gps_baud; // store the last known GPS serial baud rate
  char hdr[16];     // The header marker so we know this is our data (for BT/BLE on Pico)
  uint8_t addr[6];  // BT/BLE MAC of the peer we last connected to
  uint8_t addrType; // BLE Type of address (normal or randomized) of the last peer (ignored for BT Classic)

  bool backlight_timeout_disable; // Disable backlight timeout feature if enabled (1)
  
  #if defined(FEATURE_WIFI) && defined(HARDWARE_ESP32_DEV) //SP5IOU 20220129
    char wifissid[20]=WIFI_SSID;//Initialize configuration.wifissid with default set in keyer_settings...h file
    char wifipassword[20]=WIFI_PASSWORD;//Initialize configuration.wifipassword with default set in keyer_settings...h file
    //40 bytes
  #endif
} configuration;

// Forward declarations to make esp-idf happy

void add_to_send_buffer(byte incoming_serial_byte);
int paddle_pin_read(int pin_to_read);
void display_serial_number_character(char snumchar);
int memory_start(byte memory_number); 
int memory_end(byte memory_number);
void tx_and_sidetone_key (int state);
void send_char(byte cw_char, byte omit_letterspace);
void boop();
void beep();
void check_serial();
void remove_from_send_buffer();
void winkey_port_write(byte byte_to_send,byte override_filter);
void cli_timing_command(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments,byte command_called);
void serial_change_wordspace(PRIMARY_SERIAL_CLS * port_to_use);
int serial_get_number_input(byte places,int lower_limit, int upper_limit,PRIMARY_SERIAL_CLS * port_to_use,int raise_error_message);
void cli_extended_commands(PRIMARY_SERIAL_CLS * port_to_use);
void serial_switch_tx(PRIMARY_SERIAL_CLS * port_to_use);
void serial_tune_command (PRIMARY_SERIAL_CLS * port_to_use);
void write_settings_to_eeprom(int initialize_eeprom) ;
void check_dit_paddle();
void check_dah_paddle();
void clear_send_buffer();
void loop_element_lengths(float lengths, float additional_time_ms, int speed_wpm_in);
void speed_set(int wpm_set);
int convert_cw_number_to_ascii (long number_in);
void cli_timing_print(PRIMARY_SERIAL_CLS * port_to_use);
void cli_paddle_echo_factor(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments);
void serial_play_memory(byte memory_number);
void switch_to_tx_silent(byte tx) ;
void serial_set_dit_to_dah_ratio(PRIMARY_SERIAL_CLS * port_to_use);
void serial_program_memory(PRIMARY_SERIAL_CLS * port_to_use);
void serial_status(PRIMARY_SERIAL_CLS * port_to_use) ;
void cli_autospace_timing_factor(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments);
void serial_receive_practice_menu(PRIMARY_SERIAL_CLS * port_to_use,byte practice_mode);
void serial_wordsworth_menu(PRIMARY_SERIAL_CLS * port_to_use);
void receive_transmit_echo_practice(PRIMARY_SERIAL_CLS * port_to_use, byte practice_mode_called) ;
void serial_set_weighting(PRIMARY_SERIAL_CLS * port_to_use);
void process_serial_command(PRIMARY_SERIAL_CLS * port_to_use);
void serial_set_sidetone_freq(PRIMARY_SERIAL_CLS * port_to_use);
void serial_status_memories(PRIMARY_SERIAL_CLS * port_to_use);
void initialize_eeprom_memories();
void serial_set_serial_number(PRIMARY_SERIAL_CLS * port_to_use);
void repeat_play_memory(PRIMARY_SERIAL_CLS * port_to_use);
void serial_set_memory_repeat(PRIMARY_SERIAL_CLS * port_to_use);
void initialize_eeprom();
void cli_eeprom_dump(PRIMARY_SERIAL_CLS * port_to_use);
void serial_random_menu(PRIMARY_SERIAL_CLS * port_to_use);
void random_practice(PRIMARY_SERIAL_CLS * port_to_use,byte random_mode,byte group_size) ;
void wordsworth_practice(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type);
void serial_cw_practice(PRIMARY_SERIAL_CLS * port_to_use);
void serial_practice_interactive(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type_called);
void serial_practice_non_interactive(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type_called);
void cli_keying_compensation(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments);
void serial_wpm_set(PRIMARY_SERIAL_CLS * port_to_use) ;
void serial_set_farnsworth(PRIMARY_SERIAL_CLS * port_to_use);
void send_serial_number(byte cut_numbers,int increment_serial_number,byte buffered_sending);
void serial_receive_transmit_echo_menu(PRIMARY_SERIAL_CLS * port_to_use);
byte play_memory(byte memory_number);
void display_scroll_print_char(char charin);
void popup(bool show);
void sinewave_interrupt_compute();
void initialize_sinewave_generator();
void initialize_tonsin();
void myDelay(uint32_t _ms);
void setup_esp();
int print_memory(byte memory_number, char *mem_string);
void check_gps(bool force_update, bool ignore_gps);
void check_compass(void);
void process_compass(bool force_update, bool ignore_dec);
void command_display_memory(byte memory_number);
void store_Grid(char * grid);
int validate_grid(const char * input_grid, char grid[]);
int read_memory(byte memory_number, char memory_char[LCD_COLUMNS]);
void process_gps(char * memory_str, bool force_update, uint8_t source);
void memorycheck();
void tft_backlight(int state);  // toggles the backlight GPIO pin on and off from keyboard or long touch

#ifdef FEATURE_TOUCH_DISPLAY
//---------------------------------------------------------------------
// Buttons and Popup Window for Touch Displays
//---------------------------------------------------------------------
// list all possible buttons to get a unique ID.  The order does not matter
enum button_ID{
  BUTTON_F1 = 0,
  BUTTON_PAUSE,
  BUTTON_TX_ENABLE,
  BUTTON_WPM_UP,
  BUTTON_WPM_DN,
  BUTTON_F2,
  BUTTON_MEM_1,
  BUTTON_MEM_2,
  BUTTON_MEM_3,
  BUTTON_MEM_4,
  BUTTON_F3,
  BUTTON_MEM_5,
  BUTTON_MEM_6,
  BUTTON_MEM_7,
  BUTTON_MEM_8,
  BUTTON_F4,
  BUTTON_MEM_LIST,
  BUTTON_SIDETONE_EN, //  Toggle Sidetone On/Off
  BUTTON_TUNE,
  BUTTON_TX_SELECT,
  BUTTON_POPUP_2,
  BUTTON_POPUP_3,
  CW_BOX,
  BUTTON_last_button
};

  uint16_t t_x = 0, t_y = 0;    // Variables to store touch coordinates
  volatile bool button_active = false;
  uint8_t button_row = 0;  // default to row 1
  uint16_t BtnX_active = 0;  // tracks if a key_ID is active across touches
 

  // Create all posible keys assignments here.  Config variables will then define how many of them 
  //  will be be in a row and how many rows.
  // Keys are mapped to buttons.  Each row of buttons are reused for each row.
  // In the case of 2 rows displayed at the same time, they are instead a single row with half
  //  of the buttons placed on lower Y row.  Thre may not be a need for the Fx key in this case.
  //  If so, can hide it somehow TBD.

  #ifdef TOUCH_BUTTON_16
    const uint8_t buttonCount = 16 + 1;  // sizeof(btn) / sizeof(btn[0]);  
    const int NUM_BUTTON_ROWS = 1; // number of rows of buttons
    const int NUM_KEYS = buttonCount;  // +1 is CW Scroll Box touch zone.  Fx key counts as a regular key
  #else
    #if defined(FEATURE_TOUCH_DISPLAY) && (((BUTTON_ROWS + 0) == 0)  || ((BUTTON_ROWS + 0) > 4))  // check val;ue exists and is not empty, must be 1-4.
      #error "BUTTON_ROWS must be defined with a value = 1-4, or, TOUCH_BUTTON_16 must be defined in keyer_features_and_options.h"
    #endif
    const int MAX_ROWS = 4;
    const int BUTTONS_PER_ROW = 5;
    const uint8_t buttonCount = BUTTONS_PER_ROW + 1;  // sizeof(btn) / sizeof(btn[0]); // 5 keys per row, plus scrowsl box = 6 buttons on screen.  Their roles change with row change
    const int NUM_BUTTON_ROWS = BUTTON_ROWS;  // at run time number of rows will be limited to this number.
    const int NUM_KEYS = MAX_ROWS * BUTTONS_PER_ROW + 1;  // +1 is CW Scroll Box touch zone.  Fx key counts as a regular key
  #endif
  // The +1 is the CW Scroll Box touch zone. More may added for Yes/No confirmation buttons. 
  // This includs the Fx kay though it might be hidden or unused in some cases

