K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #ifdef BUTTON_ASSIGNMENTS
  // This section collects a list of 16 buttons assigned into an array by the user in theor priority order in key_settings.h file.
  //enum Button_assign_label{BN_PAUSE,BN_TXEN,BN_WPMUP,BN_WPMDN,BN_M1,BN_M2,BN_M3,BN_M4,BN_M5,BN_M6,BN_M7,BN_M8,BN_MEM,BN_TUNE,BN_TXSELECT,BN_TONE};
  //enum Button_assign_label{B_PAUSE,B_TXEN,B_WPMUP,B_WPMDN,B_M1,B_M2,B_M3,B_M4,B_M5,B_M6,B_M7,B_M8,B_MEM,B_TUNE,B_TXSELECT,B_TONE};
  const int button_array_size = 16;
  int button_array[button_array_size] = BUTTON_ASSIGNMENT_ORDER;
/*
  // These defines provide the user with button labels in the keyer_settings.h file array macro positioned in their preferred order
  #define B_PAUSE     BN_PAUSE
  #define B_TXEN      BN_TXEN
  #define B_WPMUP     Button_assign_label(BN_WPMUP)
  #define B_WPMDN     Button_assign_label(BN_WPMDN)
  #define B_M1        Button_assign_label(BN_M1)
  #define B_M2        Button_assign_label(BN_M2)
  #define B_M3        Button_assign_label(BN_M3)
  #define B_M4        Button_assign_label(BN_M4)
  #define B_M5        Button_assign_label(BN_M5)
  #define B_M6        Button_assign_label(BN_M6)
  #define B_M7        Button_assign_label(BN_M7)
  #define B_M8        Button_assign_label(BN_M8)
  #define B_MEM       Button_assign_label(BN_MEM)
  #define B_TUNE      Button_assign_label(BN_TUNE)
  #define B_TXSELECT  Button_assign_label(BN_TXSELECT)
  #define B_TONE      BN_TONE      // sideone and long press backlight disable
  */
  #endif
  struct BTN_State {
    TFT_eSPI_Button p_btn;
    uint8_t len;
    uint32_t duration;
  } btn[buttonCount] = {};
  
  // Cannot exceed value of BUTTON_last_button
  struct Keys {
    const uint8_t key_event;   // label for a key eventhandler to use
    uint8_t btn_idx;  // button array index - 0-5 for 6 buttons in a row
    uint8_t row;  // store which row this key bleongs to.
    bool hold;   // this is a long duration key - can be used to highlight a key when displays
    bool skip;  // Do not clear the hold state when ESC is pressed
    bool window;  // used to keep popup window up during successive key presses.
    char text_off[7]; // key text when not highlighted
    char text_on[7];  // key label text when highlighted
  };
  
  struct Keys key[NUM_KEYS] = 
  #ifdef TOUCH_BUTTON_16
  { 
    // 1st row
    {BUTTON_PAUSE,      0,  0, false, false, false, "Pause", "Pause"}, 
    {BUTTON_TX_ENABLE,  1,  0, false, false, false, "TXen", "TXen"},
    {BUTTON_WPM_UP,     2,  0, false, false, false, "Wpm+", "Wpm+"}, 
    {BUTTON_WPM_DN,     3,  0, false, false, false, "Wpm-", "Wpm-"},    
    {BUTTON_TUNE,       4,  0, false, false, false, "Tune", "Tune"},
    {BUTTON_TX_SELECT,  5,  0, false, false, false, "Tx#1", "Tx#1"},
    {BUTTON_SIDETONE_EN,6,  0, false, false, false, "Tone", "Tone"},
    {BUTTON_MEM_LIST,   7,  0, false, false, false, "Mem",  "Mem" }, 
    //2nd row
    {BUTTON_MEM_1,      8,  0, false, false, false, "M1",   "M1-R"},
    {BUTTON_MEM_2,      9 , 0, false, false, false, "M2",   "M2-R"},
    {BUTTON_MEM_3,      10, 0, false, false, false, "M3",   "M3-R"},
    {BUTTON_MEM_4,      11, 0, false, false, false, "M4",   "M4-R"},
    {BUTTON_MEM_5,      12, 0, false, false, false, "M5",   "M5-R"},
    {BUTTON_MEM_6,      13, 0, false, false, false, "M6",   "M6-R"},
    {BUTTON_MEM_7,      14, 0, false, false, false, "M7",   "M7-R"},
    {BUTTON_MEM_8,      15, 0, false, false, false, "M8",   "M8-R"},
    
    {CW_BOX,            16,255, false, false, false, "",       ""      }
  };
  #else
  { 
    {BUTTON_F1,         0, 0, false, false, false, "F1",      "F1"},
    {BUTTON_PAUSE,      1, 0, false, false, false, "Pause","Pause"}, 
    {BUTTON_TX_ENABLE,  2, 0, false, false, false, "TXen",  "TXen"},
    {BUTTON_WPM_UP,     3, 0, false, false, false, "Wpm+",  "Wpm+"}, 
    {BUTTON_WPM_DN,     4, 0, false, false, false, "Wpm-",  "Wpm-"},

    {BUTTON_F2,         0, 1, false, false, false, "F2",      "F2"},
    {BUTTON_MEM_1,      1, 1, false, false, false, "M1",    "M1-R"},
    {BUTTON_MEM_2,      2, 1, false, false, false, "M2",    "M2-R"},
    {BUTTON_MEM_3,      3, 1, false, false, false, "M3",    "M3-R"},
    {BUTTON_MEM_4,      4, 1, false, false, false, "M4",    "M4-R"},
    
    {BUTTON_F3,         0, 2, false, false, false, "F3",      "F3"},
    {BUTTON_MEM_5,      1, 2, false, false, false, "M5",    "M5-R"},
    {BUTTON_MEM_6,      2, 2, false, false, false, "M6",    "M6-R"},
    {BUTTON_MEM_7,      3, 2, false, false, false, "M7",    "M7-R"},
    {BUTTON_MEM_8,      4, 2, false, false, false, "M8",    "M8-R"},

    {BUTTON_F4,         0, 3, false, false, false, "F4",      "F4"},
    {BUTTON_MEM_LIST,   1, 3, false, false, false, "Mem",    "Mem"},   
    {BUTTON_TUNE,       2, 3, false, false, false, "Tune",  "Tune"}, 
    {BUTTON_TX_SELECT,  3, 3, false, false, false, "Tx#1",  "Tx#1"},
    {BUTTON_SIDETONE_EN,4, 3, false, false, false, "Tone",  "Tone"},
    
    {CW_BOX,            5,255, false, false, false, "",      ""     }             // 
  };
  #endif

  void process_buttons();
  int touch_button_available();
  void refresh_button_row(uint8_t row);
  void memX_key(uint16_t key_ID, uint8_t memory_number);
  
  #ifdef USE_TOUCH_TASK
    void check_touch_buttons(void * pvParameters);
  #else
    void check_touch_buttons(void);
  #endif
#endif

// ________________________________
// 
#ifdef FEATURE_TFT_DISPLAY
void initialize_TFT_display(void);
void initialize_m5stack_core2();
int32_t h = 320;  // calculate actual at run time
int32_t w = 240;
#endif
// ________________________________
// 
//#if defined(FEATURE_BT_KEYBOARD) || defined(FEATURE_TOUCH_DISPLAY)
// QUEUESIZE must be a power of two 
#define QUEUESIZE       (128)
#define QUEUEMASK       (QUEUESIZE-1)
#define DEBUG false
int aborted = 0;
int qhead = 0;
int qtail = 0;
char queue[QUEUESIZE];
char queuepop();
void queueadd(const char ch);
int queueempty();
int queue_available();
void queueflush();
int queuefull();
//#endif  //FEATURE_BT_KEYBOARD

void boop_beep();
void check_paddles();
void service_dit_dah_buffers();
void sidetone_adj(int hz);
void adjust_dah_to_dit_ratio(int adjustment);
void ps2_usb_keyboard_play_memory(byte memory_number);
void ps2_keyboard_program_memory(byte memory_number);
void ptt_unkey();
void ptt_key();
void put_serial_number_in_send_buffer();
void check_ptt_tail();
int uppercase (int charbytein);
void service_send_buffer(byte no_print);
int ps2_keyboard_get_number_input(byte places,int lower_limit, int upper_limit);
bool BT_Keyboard_Lost = false;
bool Keyboard_Disconnected_signal = false;
bool Keyboard_Connected_signal = false;
void BT_Keyboard_Status(void);
void s_tone(uint8_t sidetone_line_pin_num, uint16_t frequency, uint32_t duration_ms = 0UL);
void s_noTone(uint8_t sidetone_line_pin_num);
void generic_popup_key(uint16_t key_ID, const char* msg_text);
void display_heading(void);
bool stop_msg = false;
void keyboard_connected_handler();
void keyboard_lost_connection_handler();

//#define USE_BT_TASK // for BT check in a task
#ifdef USE_BT_TASK
  void check_bt_keyboard(void * pvParameters);
#else
  void check_bt_keyboard(void);
#endif

// ________________________________
// 
byte sending_mode = UNDEFINED_SENDING;
byte command_mode_disable_tx = 0;
byte current_tx_key_line = tx_key_line_1;
#ifdef FEATURE_SO2R_BASE
  byte current_tx_ptt_line = ptt_tx_1;
#endif
byte manual_ptt_invoke = 0;
byte manual_ptt_invoke_ptt_input_pin = 0;
byte qrss_dit_length = initial_qrss_dit_length;
byte keyer_machine_mode = KEYER_NORMAL;   // KEYER_NORMAL, BEACON, KEYER_COMMAND_MODE
byte char_send_mode = 0; // CW, HELL, AMERICAN_MORSE
byte key_tx = 0;         // 0 = tx_key_line control suppressed
byte dit_buffer = 0;     // used for buffering paddle hits in iambic operation
byte dah_buffer = 0;     // used for buffering paddle hits in iambic operation
byte button0_buffer = 0;
byte being_sent = 0;     // SENDING_NOTHING, SENDING_DIT, SENDING_DAH
byte key_state = 0;      // 0 = key up, 1 = key down
byte config_dirty = 0;
unsigned long ptt_time = 0; 
byte ptt_line_activated = 0;
byte speed_mode = SPEED_NORMAL;
#if defined(FEATURE_COMMAND_LINE_INTERFACE) || defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_MEMORY_MACROS) || defined(FEATURE_MEMORIES) || defined(FEATURE_COMMAND_MODE)
  unsigned int serial_number = 1;
#endif
byte pause_sending_buffer = 0;
byte length_letterspace = default_length_letterspace;
//byte keying_compensation = default_keying_compensation;
byte first_extension_time = default_first_extension_time;
byte ultimatic_mode = ULTIMATIC_NORMAL;
float ptt_hang_time_wordspace_units = default_ptt_hang_time_wordspace_units;
byte last_sending_mode = MANUAL_SENDING;
byte zero = 0;
byte iambic_flag = 0;
unsigned long last_config_write = 0;
uint16_t memory_area_end = 0;
#define GRIDSQUARE_LEN  (9u)
char grid_sq_str[12] = {};
char default_grid[9] = {};
#ifdef DECLINATION
  float declination = DECLINATION;
#else
  float declination = 0.0f;
#endif
float heading; // populated by the i2c compass computation
bool update_heading_display_flag = false;
char popup_text[(LCD_COLUMNS*LCD_ROWS)+30] = {}; // Text to display in popup
bool popup_active = false;

#ifdef FEATURE_GPS
  #include <TimeLib.h>
  #include "TinyGPSPlus.h"
  #include <string>

