K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  /* Global variables for handling GPS conversion to Maindernhead grid square  */
  #define NMEA_MAX_LENGTH  (120)
  
  struct position {
      double latitude;
      double longitude;
  } pos;
  struct position *p = &pos;

  void reverse(char *str, int len);
  void ftoa(float n, char *res, int afterpoint);
  int positionToMaidenhead(char m[]);
  int Convert_to_MH(char gps_grid[]);
  void ConvertToMinutes(char _gps_msg[]);
  tmElements_t tm;
  TinyGPSPlus gps; // The TinyGPSPlus object
  bool UTC = false;    // 0 local time, 1 UTC time
  uint8_t hr_off;  // time offsets to apply to UTC time
  uint8_t min_off;
  int shift_dir;  // + or -
  char time_str[27] = {};
  bool time_disp_updated = false;
#endif
volatile bool do_process = false;

#ifdef FEATURE_SLEEP
  unsigned long last_activity_time = 0;
#endif

#ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
  unsigned long last_active_time = 0;
#endif

#ifdef FEATURE_DISPLAY
  enum lcd_statuses {LCD_CLEAR, LCD_REVERT, LCD_TIMED_MESSAGE, LCD_SCROLL_MSG};
  #define default_display_msg_delay 2000
#endif //FEATURE_DISPLAY

#ifdef FEATURE_LCD_ADAFRUIT_I2C
  #define RED 0x1
  #define YELLOW 0x3
  #define GREEN 0x2
  #define TEAL 0x6
  #define BLUE 0x4
  #define VIOLET 0x5
  #define WHITE 0x7
  byte lcdcolor = GREEN;  // default color for RGB LCD display
#endif //FEATURE_LCD_ADAFRUIT_I2C

#if defined(OPTION_WINKEY_2_SUPPORT) && defined(FEATURE_WINKEY_EMULATION)
  byte wk2_mode = 1;
  #ifndef FEATURE_SO2R_BASE
    byte wk2_both_tx_activated = 0;
  #endif //FEATURE_SO2R_BASE
  byte wk2_paddle_only_sidetone = 0;
#endif //defined(OPTION_WINKEY_2_SUPPORT) && defined(FEATURE_WINKEY_EMULATION)

#ifdef FEATURE_DISPLAY
  byte lcd_status = LCD_CLEAR;
  unsigned long lcd_timed_message_clear_time = 0;
  byte lcd_previous_status = LCD_CLEAR;
  byte lcd_scroll_buffer_dirty = 0;
  String lcd_scroll_buffer[LCD_ROWS];
  byte lcd_scroll_flag = 0;
  byte lcd_paddle_echo = 1;
  byte lcd_send_echo = 1;
#endif //FEATURE_DISPLAY

#ifdef DEBUG_VARIABLE_DUMP
  long dit_start_time;
  long dit_end_time;
  long dah_start_time;
  long dah_end_time;
#endif //DEBUG_VARIABLE_DUMP

#ifdef FEATURE_BUTTONS
  int button_array_high_limit[analog_buttons_number_of_buttons];
  int button_array_low_limit[analog_buttons_number_of_buttons];
  long button_last_add_to_send_buffer_time = 0;
#endif //FEATURE_BUTTONS

byte pot_wpm_low_value;

#ifdef FEATURE_POTENTIOMETER
  byte pot_wpm_high_value;
  byte last_pot_wpm_read;
  int pot_full_scale_reading = default_pot_full_scale_reading;
#endif //FEATURE_POTENTIOMETER

#if defined(FEATURE_SERIAL)
  #if !defined(OPTION_DISABLE_SERIAL_PORT_CHECKING_WHILE_SENDING_CW)
    byte loop_element_lengths_breakout_flag;
    byte dump_current_character_flag;
  #endif
  byte incoming_serial_byte;
  long primary_serial_port_baud_rate;
  #ifdef FEATURE_GPS
    long gps_serial_port_baud_rate;
  #endif
  byte cw_send_echo_inhibit = 0;
  #ifdef FEATURE_COMMAND_LINE_INTERFACE
    byte serial_backslash_command;
    byte cli_paddle_echo = cli_paddle_echo_on_at_boot;
    byte cli_prosign_flag = 0;
    byte cli_wait_for_cr_to_send_cw = 0;
    #if defined(FEATURE_STRAIGHT_KEY_ECHO)
      byte cli_straight_key_echo = cli_straight_key_echo_on_at_boot;
    #endif   
  #endif //FEATURE_COMMAND_LINE_INTERFACE  
#endif //FEATURE_SERIAL

byte send_buffer_array[send_buffer_size];
byte send_buffer_bytes = 0;
byte send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;

#ifdef FEATURE_MEMORIES
  byte play_memory_prempt = 0;
  long last_memory_button_buffer_insert = 0;
  byte repeat_memory = 255;
  unsigned long last_memory_repeat_time = 0;
#endif //FEATURE_MEMORIES

#if defined(FEATURE_SERIAL)
  byte primary_serial_port_mode = SERIAL_CLI;
#endif //FEATURE_SERIAL

#ifdef FEATURE_WINKEY_EMULATION
  byte winkey_serial_echo = 1;
  byte winkey_host_open = 0;
  unsigned int winkey_last_unbuffered_speed_wpm = 0;
  byte winkey_speed_state = WINKEY_UNBUFFERED_SPEED;
  byte winkey_buffer_counter = 0;
  byte winkey_buffer_pointer = 0;
  byte winkey_dit_invoke = 0;
  byte winkey_dah_invoke = 0;
  long winkey_paddle_echo_buffer = 0;
  byte winkey_paddle_echo_activated = 0;
  unsigned long winkey_paddle_echo_buffer_decode_time = 0;
  byte winkey_sending = 0;
  byte winkey_interrupted = 0;
  byte winkey_xoff = 0;
  byte winkey_session_ptt_tail = 0;
  byte winkey_pinconfig_ptt_bit = 1;
  #ifdef OPTION_WINKEY_SEND_BREAKIN_STATUS_BYTE
    byte winkey_breakin_status_byte_inhibit = 0;
  #endif //OPTION_WINKEY_SEND_BREAKIN_STATUS_BYTE
#endif //FEATURE_WINKEY_EMULATION

#if defined(FEATURE_PS2_KEYBOARD)
  byte ps2_keyboard_mode = PS2_KEYBOARD_NORMAL;
  byte ps2_keyboard_command_buffer[25];
  byte ps2_keyboard_command_buffer_pointer = 0;
#endif //FEATURE_PS2_KEYBOARD

#if defined(FEATURE_BT_KEYBOARD)  || defined(FEATURE_TOUCH_DISPLAY)
  byte bt_keyboard_mode = BT_KEYBOARD_NORMAL;
  byte bt_keyboard_command_buffer[25];
  byte bt_keyboard_command_buffer_pointer = 0;
#endif 

#if defined(FEATURE_BT_KEYBOARD)  && defined(ARDUINO_RASPBERRY_PI_PICO_W)
const char *macToString(const uint8_t *addr, uint8_t addrType) {
  static char mac[32];
  sprintf(mac, "%02x:%02x:%02x:%02x:%02x:%02x,%d\n", addr[0], addr[1], addr[2], addr[3], addr[4], addr[5], addrType ? 1 : 0);
  return mac;
}

uint8_t lastAddress[6] = {};
uint8_t lastAddressType = 0;

void loadEEPROM() {
  if (memcmp(configuration.hdr, DATAHEADER, sizeof(configuration.hdr))) {
    // Not our data, just clear things
    Serial.println("No previous paired device found in EEPROM");
    bzero(lastAddress, 6);
    lastAddressType = 0;
  } else {
    // Our baby, copy it to local storage
    Serial.printf("Previously paired device found: %s\n", macToString(configuration.addr, configuration.addrType));
    memcpy(lastAddress, configuration.addr, sizeof(lastAddress));
    lastAddressType = configuration.addrType;
  }
}

void saveEEPROM() {
  //configuration data;
  memcpy(configuration.hdr, DATAHEADER, sizeof(configuration.hdr));
  memcpy(configuration.addr, lastAddress, sizeof(configuration.addr));
  configuration.addrType = lastAddressType;
  EEPROM.commit();
  Serial.printf("Wrote paired device to EEPROM: %s\n", macToString(lastAddress, lastAddressType));
}

// Either try continually to reconnect to the last device connected,
// or if it's invalid or user holds BOOTSEL then we'll start a new
// pairing process (i.e. the peripheral will need to be put into
// pairing mode to bond)
void connectOrPair() {
  uint8_t x = 0;
  for (int i = 0; i < 6; i++) {
    x |= lastAddress[i];
  }
  if (x) {
    // There's a valid address, attempt to reconnect forever until connect or BOOTSEL
    Serial.printf("Attempting to reconnect to %s...\n", macToString(lastAddress, lastAddressType));
    do {
      delay(10);      
      if (use_BLE) bt_keyboard.connectBLE(lastAddress, lastAddressType);
      else bt_keyboard.connect(lastAddress);
    } while (!bt_keyboard.connected() && !BOOTSEL);
    if (bt_keyboard.connected()) {
      Serial.println("Reconnected!\n");  
      keyboard_connected_handler();  //digitalWrite(LED_BUILTIN, l);    
      return;
    } else {
      keyboard_lost_connection_handler();
    }
    // Fall through to pair
  }
  //pinMode(LED_BUILTIN, OUTPUT);
  bool l = true;
  Serial.println("Entering pairing mode.  Set the peripheral to pair state");
  bt_keyboard.clearPairing();
  do {
    //digitalWrite(LED_BUILTIN, l);    
    l = !l;
    delay(10);
    if (use_BLE) bt_keyboard.connectBLE();
    else bt_keyboard.connectAny();
  } while (!bt_keyboard.connected());
  Serial.printf("Connected to device: %s\n", macToString(bt_keyboard.lastConnectedAddress(), bt_keyboard.lastConnectedAddressType()));
  memcpy(lastAddress, bt_keyboard.lastConnectedAddress(), sizeof(lastAddress));
  lastAddressType = bt_keyboard.lastConnectedAddressType();
  // We've update the connection, store away
  saveEEPROM();
  keyboard_connected_handler();  //digitalWrite(LED_BUILTIN, l);
}
#endif //FEATURE_BT_KEYBOARD

