K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      if (keyer_awake){
        digitalWrite(keyer_awake,KEYER_AWAKE_PIN_AWAKE_STATE);
      }

      last_activity_time = millis();
      #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
        last_active_time = millis(); 
      #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

      #ifdef DEBUG_SLEEP
        debug_serial_port->println(F("check_sleep: I'm awake!"));
      #endif //DEBUG_SLEEP
    }
  }
  #endif //FEATURE_SLEEP
#endif //HARDWARE_ESP32_DEV
//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
void check_backlight() {

  static unsigned long last_bl_check = 0 ;

  if (configuration.backlight_timeout_disable) return;

  if (millis() - last_bl_check < 1000) return;   // not time-critical

  last_bl_check = millis();

  if ((last_bl_check - last_active_time) > ((unsigned long)dim_backlight_inactive_time * BACKLIGHT_TIMEOUT * 1000)){
    
    #ifdef DEBUG_BACKLIGHT
      debug_serial_port->print(F("check_backlight: I'm asleep!  EEPROM Disable Setting=")); debug_serial_port->println(configuration.backlight_timeout_disable, HEX);
    #endif //DEBUG_BACKLIGHT

    if (keyer_power_led){
      analogWrite(keyer_power_led,keyer_power_led_asleep_duty);
    }     

    #ifdef FEATURE_TFT_DISPLAY
      tft_backlight(0);  // turn it off
    #else
      lcd.noBacklight();
    #endif
    
  } else {
    
    #ifdef DEBUG_BACKLIGHT
      debug_serial_port->printf("check_backlight: I'm awake!  EEPROM Disable Setting=%d  Timeout Countdown=%lu seconds until backlight turns off\n", \
            configuration.backlight_timeout_disable, BACKLIGHT_TIMEOUT - ((last_bl_check - last_active_time)/1000));
    #endif //DEBUG_BACKLIGHT

    if (keyer_power_led){
      analogWrite(keyer_power_led,keyer_power_led_awake_duty);
    }

    #ifdef FEATURE_TFT_DISPLAY
      tft_backlight(1);  // turn it on
    #else
      lcd.backlight();
    #endif
  }
}
#endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

//-------------------------------------------------------------------------------------------------------
// claer the scrollable text area of the display
#ifdef FEATURE_DISPLAY

void lcd_scroll_box_clear() {
    #ifdef FEATURE_TFT_DISPLAY
        if (popup_active) {
          //debug_serial_port->println(F("Skipping Popup while in lcd_scroll_clear()")); 
          return;  // skip this when a popup window is up, else will corrupt popup window content
        }
      //if (TFT_VIEWPORT_EXISTS) {
      //    debug_serial_port->println(F("Close Viewport"));
          lcd.fillRoundRect(SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, 6, TFT_BLACK);
          myDelay(1);
      //    lcd.resetViewport();
      //}
      //else {
      //    debug_serial_port->println(F("Clear scroll box, no Close Viewport"));
      //    lcd.fillRoundRect(SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, 6, TFT_BLACK);
          lcd.setTextColor(TFT_WHITE, TFT_BLACK);
      //}
    #else
        lcd.clear();
        lcd.noCursor();//sp5iou 20180328
    #endif
}
#endif


char bt_keyboard_read() {
  #if !defined(USE_BT_TASK) && defined(FEATURE_BT_KEYBOARD)
    myDelay(1);
    check_bt_keyboard();
  #endif
  if (queue_available()) return queuepop();
  else return 0;
}

int bt_keyboard_available() {
  #if !defined(USE_BT_TASK) && defined(FEATURE_BT_KEYBOARD)
    myDelay(1);
    check_bt_keyboard();
  #endif
  return queue_available();
}

int touch_key_read() {  // if touch_button_available then there is a non-zero touch key value set in button_active
  #if defined(FEATURE_TOUCH_DISPLAY)
    #ifndef USE_TOUCH_TASK
      //check_touch_buttons();    
    #endif 
    myDelay(1);
    #if defined(DEBUG_TOUCH)
      debug_serial_port->print(F("Read Touch"));
    #endif //DEBUG_TOUCH
    if (button_active) process_buttons();
    if (queue_available()) return queuepop();
    else return 0;    
  #else
      return 0;
  #endif
}

int touch_button_available() {
  #if defined(FEATURE_TOUCH_DISPLAY)
    #ifndef USE_TOUCH_TASK
      //check_touch_buttons();
    #endif
    #if defined(DEBUG_TOUCH_X)
      debug_serial_port->print(F("Check if Touch Event is Waiting: "));
      debug_serial_port->println(button_active, DEC);
    #endif //DEBUG_TOUCH
    if (button_active) process_buttons();
    return queue_available();
  #else
    return 0;
  #endif
}

void update_icons(void) {
#ifdef FEATURE_TFT_DISPLAY    
    if (popup_active) return;  // bail, these screen writes below are outside the popup window    
    static char last_GridSq[grid_len_max] = "";
    static byte last_key_tx = false;
    static bool last_stop_msg = false;
    static bool stop_msg_changed = false;
    char tx_str[7] = "";
    static uint8_t last_tx = 0;
    const int32_t row = STATUS_BAR_Y_CURSOR;

    if (last_stop_msg != stop_msg) {
      stop_msg_changed = true;
      last_stop_msg = stop_msg;
    }

    lcd.setTextDatum(MY_DATUM);
    //lcd.setFreeFont(STATUS_BAR_FONT);    
    lcd.setTextFont(STATUS_BAR_FONT);  // &fonts::FreeMonoBold12pt7b)    
  
    #ifdef FEATURE_GPS      // if not enabled leave the default grey 00:00:00 printed at init time.
    if (!time_disp_updated && !configuration.ignore_gps && !stop_msg) {
        lcd.setTextColor(TFT_YELLOW, TFT_BLACK);
        time_disp_updated = true;
      } else {
        #ifndef FEATURE_BT_KEYBOARD
          lcd.setTextColor(TFT_YELLOW, TFT_BLACK);
        #else
          lcd.setTextColor(TFT_GREY, TFT_BLACK);
        #endif
        time_disp_updated = true;
      }      
      
      if (time_disp_updated) {
        lcd.drawString(time_str, TIME_ANCHOR, STATUS_BAR_Y_CURSOR);  
        time_disp_updated = false;
      }
    #endif

    if (configuration.current_tx != last_tx || last_key_tx != key_tx) // TX state changed, update display
    {
      sprintf(tx_str, "T%d", last_tx);
      lcd.setTextColor(TFT_BLACK, TFT_BLACK);
      lcd.drawString(tx_str, TX_NUM_ANCHOR, row);   // blank out space 

      sprintf(tx_str, "T%d", configuration.current_tx);
      if (!key_tx) lcd.setTextColor(TFT_RED, TFT_BLACK);  // enabled
      else lcd.setTextColor(TFT_GREEN, TFT_BLACK); // disabled
      lcd.drawString(tx_str, TX_NUM_ANCHOR, row); // update display

