K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      last_tx = configuration.current_tx;  // remember last state
      last_key_tx = key_tx;
    }

    if (stop_msg_changed || strcmp(grid_sq_str, last_GridSq) != 0)  // connect status and/or grid changed, update display
    {
      lcd.setTextColor(TFT_BLACK, TFT_BLACK);
      lcd.drawString(last_GridSq, GRID_ANCHOR, row);   // blank out space 

      if (!configuration.ignore_gps && !stop_msg) {
        lcd.setTextColor(TFT_MAGENTA, TFT_BLACK);
        lcd.drawString(grid_sq_str, GRID_ANCHOR, row); // update display
      } else {
        #ifndef FEATURE_BT_KEYBOARD
          lcd.setTextColor(TFT_MAGENTA, TFT_BLACK);          
        #else
          lcd.setTextColor(TFT_GREY, TFT_BLACK);
        #endif
        lcd.drawString(grid_sq_str, GRID_ANCHOR, row); // update display
      }

      strcpy(last_GridSq, grid_sq_str);  // write grid square
    }

//    GRID_ANCHOR (SCREEN_WIDTH/4)
//    #define WPM_ANCHOR (SCREEN_WIDTH/2)
//    #define ICON_ANCHOR (479-5-(5*COLUMN_WIDTH))
//    #define ICON_WIDTH COLUMN_WIDTH

    char WPM[7] = "\0";
    static int last_WPM = 0;

    if (last_WPM != (int) configuration.wpm)  // wpm changed, update display
    {
      lcd.setTextColor(TFT_CYAN, TFT_BLACK);
      itoa(configuration.wpm, WPM, 10);
      strncat(WPM, "wpm", 6);
      lcd.drawString("       ", WPM_ANCHOR, row);  // erase old
      lcd.drawString(WPM,       WPM_ANCHOR, row);  // WPM rate
      last_WPM = configuration.wpm;
    }

    #ifdef NOT_USING_THESE_NOW
    if (last_sending_mode != sending_mode)    // modes are : Auto, Manual, Auto-Interrupted
    {
      switch (last_sending_mode) {
        case AUTOMATIC_SENDING:             lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('A', ICON_ANCHOR, row); break;
        case AUTOMATIC_SENDING_INTERRUPTED: lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('I', ICON_ANCHOR, row); break;
        case MANUAL_SENDING:                lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('M', ICON_ANCHOR, row); break;
      }
      switch (sending_mode) {
        case AUTOMATIC_SENDING:             lcd.setTextColor(TFT_ORANGE, TFT_BLACK); lcd.drawChar('A', ICON_ANCHOR, row); break;
        case AUTOMATIC_SENDING_INTERRUPTED: lcd.setTextColor(TFT_ORANGE, TFT_BLACK); lcd.drawChar('I', ICON_ANCHOR, row); break;
        case MANUAL_SENDING:                lcd.setTextColor(TFT_PINK, TFT_BLACK);   lcd.drawChar('M', ICON_ANCHOR, row); break;
      }
      last_sending_mode = sending_mode;
    }
    #endif

    static byte last_keyer_machine_mode = 255;

    if (last_keyer_machine_mode != keyer_machine_mode)    // modes are : Beacon KEYER_NORMAL KEYER_COMMAND_MODE
    {
      switch (last_keyer_machine_mode) {
        case BEACON:              lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('B', ICON_ANCHOR+ICON_SPACING, row); break;
        case KEYER_NORMAL:        lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('N', ICON_ANCHOR+ICON_SPACING, row); break;
        case KEYER_COMMAND_MODE:  lcd.setTextColor(TFT_BLACK, TFT_BLACK); lcd.drawChar('C', ICON_ANCHOR+ICON_SPACING, row); break;
      }
      switch (keyer_machine_mode) {
        case BEACON:              lcd.setTextColor(TFT_ORANGE, TFT_BLACK);    lcd.drawChar('B', ICON_ANCHOR+ICON_SPACING, row); break;
        case KEYER_NORMAL:        lcd.setTextColor(TFT_LIGHTGREY, TFT_BLACK); lcd.drawChar('N', ICON_ANCHOR+ICON_SPACING, row);; break;
        case KEYER_COMMAND_MODE:  lcd.setTextColor(TFT_PINK, TFT_BLACK);      lcd.drawChar('C', ICON_ANCHOR+ICON_SPACING, row); break;
      }
      last_keyer_machine_mode = keyer_machine_mode;
    }

    static byte last_ptt_line_activated= 255;

    if (last_ptt_line_activated != ptt_line_activated)  // Tx state changed
    {
      lcd.setTextColor(TFT_BLACK, TFT_BLACK);
      if (ptt_line_activated) {
          lcd.drawChar('R', ICON_ANCHOR+(2*ICON_SPACING), row);
          lcd.setTextColor(TFT_RED, TFT_BLACK);
          lcd.drawChar('T', ICON_ANCHOR+(2*ICON_SPACING), row);
      } else {
          lcd.drawChar('T', ICON_ANCHOR+(2*ICON_SPACING), row);
          lcd.setTextColor(TFT_GREEN, TFT_BLACK);          
          lcd.drawChar('R', ICON_ANCHOR+(2*ICON_SPACING), row);
      }
      last_ptt_line_activated = ptt_line_activated;
    }

    static byte last_pause_sending_buffer = 254;

    if (last_pause_sending_buffer != pause_sending_buffer)
    {
      if (pause_sending_buffer != 0) {
          lcd.setTextColor(TFT_GOLD, TFT_BLACK);
          lcd.drawChar('P', ICON_ANCHOR+(3*ICON_SPACING), row);   // Sending Paused
      } else {
          lcd.setTextColor(TFT_BLACK, TFT_BLACK);
          lcd.drawChar('P', ICON_ANCHOR+(3*ICON_SPACING), row);   
      }
      last_pause_sending_buffer = pause_sending_buffer;
    }

    #if defined(FEATURE_BT_KEYBOARD) 
    static bool last_BT_Connected = 0;
      if (last_BT_Connected != bt_keyboard.is_connected())
      {
        if (bt_keyboard.is_connected()) {
            lcd.setTextColor(TFT_BLUE, TFT_BLACK);
            lcd.drawChar('B', ICON_ANCHOR+(4*ICON_SPACING), row); // BT connected status
        } else {
            lcd.setTextColor(TFT_BLACK, TFT_BLACK);
            lcd.drawChar('B', ICON_ANCHOR+(4*ICON_SPACING), row);
        }
        last_BT_Connected = bt_keyboard.is_connected();
      }
    #endif
    
    lcd.setTextColor(TFT_WHITE, TFT_BLACK);   // set back to normal size and color
    lcd.setFreeFont(TFT_FONT_MEDIUM);
    lcd.setTextDatum(MY_DATUM);
    stop_msg_changed = false;
#endif
}


#ifdef FEATURE_TFT_DISPLAY
void testlcd(char status, int x, int y) {
  int y1=SCROLL_TEXT_TOP_LINE+(y*FONT_HEIGHT);
  int x1=SCROLL_TEXT_LEFT_SIDE+(x*COLUMN_WIDTH);
  lcd.setFreeFont(TFT_FONT_MEDIUM);
  //debug_serial_port->printf("-char [%c] x=%d y=%d x1=%d y1=%d value=%c --\n", status, x, y, x1, y1, (char)lcd_scroll_buffer[y].charAt(x));
  lcd.drawChar(status, x1, y1);
}
#endif

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_DISPLAY
void service_display() {

  #ifdef DEBUG_LOOP
    debug_serial_port->println(F("loop: entering service_display"));
  #endif    

  #define SCREEN_REFRESH_IDLE 0
  #define SCREEN_REFRESH_INIT 1
  #define SCREEN_REFRESH_IN_PROGRESS 2

  static byte x = 0;
  static byte y = 0;

