K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  static byte screen_refresh_status = SCREEN_REFRESH_IDLE;

  #ifdef FEATURE_TFT_DISPLAY
    update_icons();
    if (popup_active) return;  // do not overwrite the window
  #endif

  if (screen_refresh_status == SCREEN_REFRESH_INIT) {   // active at beginning of an event like pause
    #ifdef FEATURE_TFT_DISPLAY
      lcd.setCursor(SCROLL_TEXT_LEFT_SIDE, SCROLL_TEXT_TOP_LINE);
    #else
      lcd.setCursor(0,0);
    #endif
    y = 0;
    x = 0;
    screen_refresh_status = SCREEN_REFRESH_IN_PROGRESS;
    return;
  }

  if (screen_refresh_status == SCREEN_REFRESH_IN_PROGRESS) {
    if (x > lcd_scroll_buffer[y].length()){  // used to draw buffer on screen when pause type event started
      y++;  // move to new row
      if (y >= LCD_ROWS){   // ran out of screen rows, trigger scroll up
        screen_refresh_status = SCREEN_REFRESH_IDLE;
        lcd_scroll_buffer_dirty = 0;
        return;
      } else {   // start a new row
        x = 0;  
        #ifdef FEATURE_TFT_DISPLAY
          lcd.setCursor(SCROLL_TEXT_LEFT_SIDE, SCROLL_TEXT_TOP_LINE+(y*FONT_HEIGHT));
        #else
        lcd.setCursor(0,y);
        #endif         
      }
    } else {
      if (lcd_scroll_buffer[y].charAt(x) > 0){   // called to redraw a screen, not live characters, such as when un- pause type event ended
        #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
          #ifdef FEATURE_TFT_DISPLAY
            tft_backlight(1);  // turn it off
          #else
            lcd.backlight();
          #endif
        #endif  // FEATURE_LCD_BACKLIGHT_AUTO_DIM
    #ifdef FEATURE_TFT_DISPLAY
          lcd.setTextDatum(SCROLL_BOX_DATUM);
          lcd.setFreeFont(SCROLL_BOX_FONT);

          //int y1=SCROLL_TEXT_TOP_LINE+(y*FONT_HEIGHT);
          uint32_t y1 = SCROLL_BOX_ROW1;
          switch (y) {
            case 0: y1 = SCROLL_BOX_ROW1; break;
            case 1: y1 = SCROLL_BOX_ROW2; break;
            case 2: y1 = SCROLL_BOX_ROW3; break;
            case 3: y1 = SCROLL_BOX_ROW4; break;
            case 4: y1 = SCROLL_BOX_ROW5; break;
            default: break;
          }          
          
          uint32_t x1 = SCROLL_TEXT_LEFT_SIDE+(x*COLUMN_WIDTH);
          
          lcd.setTextColor(TFT_WHITE);

          #ifdef DO_STRING
            //lcd.setTextPadding(2);
            //int16_t w = lcd.textWidth(lcd_scroll_buffer[y]);  // width of string with font specified
            //lcd.drawRect(SCROLL_TEXT_LEFT_SIDE, y1, w, FONT_HEIGHT, TFT_BLACK);
            lcd.drawString(lcd_scroll_buffer[y], SCROLL_TEXT_LEFT_SIDE, y1);          
          #else  // do char by char
            char c = lcd_scroll_buffer[y].charAt(x);
            lcd.drawChar(c, x1, y1);  // use char in scroll buffer and place at x1, y1 on graphics screen
          #endif

          //lcd.setCursor(x1, y1);
          //lcd.print(c);
    #else
          lcd.print(lcd_scroll_buffer[y].charAt(x));          
    #endif
      }
      x++;
    }
  }

  if (screen_refresh_status == SCREEN_REFRESH_IDLE) { 
    if (lcd_status == LCD_REVERT) {
      lcd_status = lcd_previous_status;
      switch (lcd_status) {
        case LCD_CLEAR:
            myDelay(1);
            lcd_scroll_box_clear();
            break;
        case LCD_SCROLL_MSG:   // this is called after a timed message clears the display and the buffer has to be redrawn onscreen.  Also at start of Pause
            lcd_scroll_box_clear();     
            screen_refresh_status = SCREEN_REFRESH_INIT;
            lcd_scroll_flag = 0; 
            lcd_scroll_buffer_dirty = 0;         
            break;
      }
    } else {
      switch (lcd_status) {
        case LCD_CLEAR : break;
        case LCD_TIMED_MESSAGE:
          if (millis() > lcd_timed_message_clear_time) {
            lcd_status = LCD_REVERT;
          }
          else {
            myDelay(5);
          }
          break;
        case LCD_SCROLL_MSG:
          if (lcd_scroll_buffer_dirty) { 
            if (lcd_scroll_flag) {
              lcd_scroll_box_clear();
              lcd_scroll_flag = 0;
            }
            lcd_scroll_buffer_dirty = 0;
            screen_refresh_status = SCREEN_REFRESH_INIT;
          }
        break;
      }
    }
  }
 }
#endif

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_DISPLAY
void display_scroll_print_char(char charin){
  
  static byte column_pointer = 0;
  static byte row_pointer = 0;
  static byte holding_space = 0;
  byte x = 0;

  #ifdef DEBUG_DISPLAY_SCROLL_PRINT_CHAR
    debug_serial_port->print(F("display_scroll_print_char: "));
    debug_serial_port->write(charin);
    debug_serial_port->print(F(" "));
    debug_serial_port->println(charin);
  #endif //DEBUG_DISPLAY_SCROLL_PRINT_CHAR

  #ifdef OPTION_DISPLAY_NON_ENGLISH_EXTENSIONS
  switch (byte(charin)){
    case 220: charin = 0;break; // U_umlaut  (D, ...)
    case 214: charin = 1;break; // O_umlaut  (D, SM, OH, ...)
    case 196: charin = 2;break; // A_umlaut  (D, SM, OH, ...)
    case 198: charin = 3;break; // AE_capital (OZ, LA)
    case 216: charin = 4;break; // OE_capital (OZ, LA)
    case 197: charin = 6;break; // AA_capital (OZ, LA, SM)
    case 209: charin = 7;break; // N-tilde (EA) 
  }
  #endif //OPTION_DISPLAY_NON_ENGLISH_EXTENSIONS
  
  if (lcd_status != LCD_SCROLL_MSG) {
    lcd_status = LCD_SCROLL_MSG;
    lcd_scroll_box_clear();
  } 

  if (charin == ' '){
    holding_space = 1;
    return;
  }

  if (holding_space){   // ok, I admit this is a hack.  Hold on to spaces and don't scroll until the next char comes in...
    if (column_pointer > (LCD_COLUMNS-1)) {
      row_pointer++;
      column_pointer = 0;
      if (row_pointer > (LCD_ROWS-1)) {
        for (x = 0; x < (LCD_ROWS-1); x++) {
          lcd_scroll_buffer[x] = lcd_scroll_buffer[x+1];
        }
        lcd_scroll_buffer[x] = "";     
        row_pointer--;
        lcd_scroll_flag = 1;
      }    
    } 
    if (column_pointer > 0){ // don't put a space in the first column
      lcd_scroll_buffer[row_pointer].concat(' ');
      column_pointer++;
    }
    holding_space = 0;
  }

  if (column_pointer > (LCD_COLUMNS-1)) {
    row_pointer++;
    column_pointer = 0;
    if (row_pointer > (LCD_ROWS-1)) {
      for (x = 0; x < (LCD_ROWS-1); x++) {
        lcd_scroll_buffer[x] = lcd_scroll_buffer[x+1];
      }
      lcd_scroll_buffer[x] = "";     
      row_pointer--;
      lcd_scroll_flag = 1;
    }    
  } 
  lcd_scroll_buffer[row_pointer].concat(charin);
  column_pointer++;
  
  lcd_scroll_buffer_dirty = 1;
}

#endif //FEATURE_DISPLAY

//-------------------------------------------------------------------------------------------------------

