K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
#ifdef FEATURE_DISPLAY
void clear_display_row(byte row_number)
{
  #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
    #ifdef FEATURE_TFT_DISPLAY
      tft_backlight(1);  // turn it off
    #else
      lcd.backlight();
    #endif
  #endif  //FEATURE_LCD_BACKLIGHT_AUTO_DIM

  #ifndef FEATURE_TFT_DISPLAY
      lcd.noCursor();//sp5iou 20180328
  #endif

  uint32_t y1 = 0;
  switch (row_number) {
    case 0: y1 = SCROLL_BOX_ROW1; break;
    case 1: y1 = SCROLL_BOX_ROW2; break;
    case 2: y1 = SCROLL_BOX_ROW3; break;
    case 3: y1 = SCROLL_BOX_ROW4; break;
    case 4: y1 = SCROLL_BOX_ROW5; break;
    default: y1 = SCROLL_BOX_ROW1; break;
  }
    y1 -= FONT_HEIGHT;

    // blank out line
  #ifdef FEATURE_TFT_DISPLAY      
      //lcd.setFreeFont(SCROLL_BOX_FONT);
      //lcd.setTextDatum(SCROLL_BOX_CENTER_DATUM);
      //lcd.fillRoundRect(SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP+6+(row_number*FONT_HEIGHT+2), SCROLL_BOX_WIDTH, FONT_HEIGHT, 6, TFT_BLACK);
      //lcd.fillRoundRect(SCROLL_BOX_LEFT_SIDE, y1, SCROLL_BOX_WIDTH, FONT_HEIGHT, 6, TFT_BLACK);
      //lcd.setTextPadding(2);
      lcd.drawRect(SCROLL_BOX_LEFT_SIDE, y1, SCROLL_BOX_WIDTH, FONT_HEIGHT, TFT_BLACK);  // Blank out last line
      lcd.fillRect(SCROLL_BOX_LEFT_SIDE, y1, SCROLL_BOX_WIDTH, FONT_HEIGHT, TFT_BLACK);  // Blank out last line
      //lcd.setTextColor(TFT_WHITE, TFT_BLACK);
      //lcd.setTextDatum(SCROLL_BOX_DATUM);  // set back to usual
      // Loop method
      //int32_t y1 = SCROLL_TOP_LINE+(row_number*FONT_HEIGHT);
      //int32_t x1 = SCROLL_LEFT_SIDE-4+(x*COLUMN_WIDTH);
      //lcd.drawChar(' ', x1, y1);
      //lcd.setTextColor(TFT_WHITE, TFT_BLACK);
  #else
      for (byte x = 0; x < LCD_COLUMNS; x++) {
        lcd.setCursor(x,row_number);
        lcd.print(F(" "));
      }
  #endif
}
#endif

//-------------------------------------------------------------------------------------------------------
#ifdef FEATURE_DISPLAY
void lcd_center_print_timed(String lcd_print_string, byte row_number, unsigned int duration)
{
  if (row_number >= LCD_ROWS)
    row_number = LCD_ROWS-1;
  //debug_serial_port->printf("Start lcd_center_print_timed(): Row:%d  Duration:%d  Incoming string is:", row_number, duration);
  //debug_serial_port->println(lcd_print_string);
  #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
    #ifdef FEATURE_TFT_DISPLAY
      tft_backlight(1);  // turn it off
    #else
      lcd.backlight();
    #endif
  #endif  //FEATURE_LCD_BACKLIGHT_AUTO_DIM
  #ifdef FEATURE_TFT_DISPLAY
    if (popup_active) {
      //debug_serial_port->println(F("Skipping Popup while in Timed Message")); 
      return;  // skip this when a popup window is up, else will corrupt popup window content
    }
  #endif
  //lcd.noCursor();//sp5iou 20180328
  if (lcd_status != LCD_TIMED_MESSAGE) {
    lcd_previous_status = lcd_status;
    lcd_status = LCD_TIMED_MESSAGE;
    lcd_scroll_box_clear();  // for TFT clears the viewport
  } else {
    clear_display_row(row_number);
  }
  #ifdef FEATURE_TFT_DISPLAY
    lcd.setFreeFont(SCROLL_BOX_FONT);
    lcd.setTextDatum(SCROLL_BOX_CENTER_DATUM);
    //uint32_t y1 = SCROLL_TEXT_TOP_LINE+(row_number*FONT_HEIGHT)+(FONT_HEIGHT/4);
    uint32_t y1 = SCROLL_BOX_ROW1;
    switch (row_number) {
      case 0: y1 = SCROLL_BOX_ROW1; break;
      case 1: y1 = SCROLL_BOX_ROW2; break;
      case 2: y1 = SCROLL_BOX_ROW3; break;
      case 3: y1 = SCROLL_BOX_ROW4; break;
      case 4: y1 = SCROLL_BOX_ROW5; break;
      default: break;
    }
    //debug_serial_port->print("lcd_center_print_timed(): string = "); debug_serial_port->println(lcd_print_string);
    lcd.setTextPadding(2);
    lcd.fillRect(SCROLL_BOX_LEFT_SIDE, y1-FONT_HEIGHT, SCROLL_BOX_WIDTH, FONT_HEIGHT, TFT_BLACK);  // Blank out last line
    lcd.setTextColor(TFT_WHITE);
    lcd.drawString(lcd_print_string, SCROLL_BOX_CENTER, y1);
    //lcd.setTextDatum(SCROLL_BOX_DATUM);   // restore to generic datum
  #else
    lcd.setCursor(((LCD_COLUMNS - lcd_print_string.length())/2),row_number);
    lcd.print(lcd_print_string);
  #endif
  myDelay(5);
  lcd_timed_message_clear_time = millis() + duration;
}
#endif

//-------------------------------------------------------------------------------------------------------

void check_for_dirty_configuration()
{
  #ifdef DEBUG_LOOP
    debug_serial_port->print(F("loop: entering check_for_dirty_configuration - config_dirty = "));
    debug_serial_port->println(config_dirty);
  #endif

  #ifdef DEBUG_EEPROM_x
    debug_serial_port->printf("d:%d w:%" PRIu32 " s:%d p:%d dit:%d dah:%d ee:%d pl:%d pr:%d\n",\
       config_dirty,((millis()-last_config_write)>eeprom_write_time_ms), (send_buffer_bytes), \
       (ptt_line_activated), (dit_buffer), (dah_buffer), (async_eeprom_write), \
       (paddle_pin_read(paddle_left)  == HIGH), (paddle_pin_read(paddle_right) == HIGH));
  #endif
  
  //if ((config_dirty) && ((millis()-last_config_write)>30000) && (!send_buffer_bytes) && (!ptt_line_activated)) {
  if ((config_dirty) && ((millis()-last_config_write)>eeprom_write_time_ms) && (!send_buffer_bytes) && (!ptt_line_activated) && (!dit_buffer) && (!dah_buffer) && (!async_eeprom_write) && (paddle_pin_read(paddle_left) == HIGH)  && (paddle_pin_read(paddle_right) == HIGH) ) {
    write_settings_to_eeprom(0);
    last_config_write = millis();
    #ifdef DEBUG_EEPROM
      debug_serial_port->println(F("check_for_dirty_configuration: wrote config\n"));
    #endif
  }
}

//-------------------------------------------------------------------------------------------------------
#ifdef FEATURE_MEMORIES
void check_memory_repeat() {

  #ifdef DEBUG_LOOP
  debug_serial_port->println(F("loop: entering check_memory_repeat"));
  #endif    
  
  if ((repeat_memory < number_of_memories) && ((millis() - last_memory_repeat_time) > configuration.memory_repeat_time)) {
    add_to_send_buffer(SERIAL_SEND_BUFFER_MEMORY_NUMBER);
    add_to_send_buffer(repeat_memory);
    add_to_send_buffer(' ');  // add display space between messages to clean up presentation.
    last_memory_repeat_time = millis();
    #ifdef DEBUG_MEMORIES
    debug_serial_port->print(F("check_memory_repeat: added repeat_memory to send buffer\n\r"));
    #endif
  }
  
