K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
                                    case PS2_F9_SHIFT  :
                                    ps2_keyboard_program_memory(8);
                                    break;

                                    case PS2_F10_SHIFT  :
                                    ps2_keyboard_program_memory(9);
                                    break;

                                    case PS2_F11_SHIFT  :
                                    ps2_keyboard_program_memory(10);
                                    break;

                                    case PS2_F12_SHIFT  :
                                    ps2_keyboard_program_memory(11);
                                    break;
                                #endif //OPTION_SAVE_MEMORY_NANOKEYER
                                #endif //FEATURE_MEMORIES

                                #ifndef OPTION_SAVE_MEMORY_NANOKEYER
                                case PS2_INSERT :   // send serial number and increment
                                    put_serial_number_in_send_buffer();
                                    serial_number++;
                                    break;

                                case PS2_END :      // send serial number no increment
                                    put_serial_number_in_send_buffer();
                                    break;

                                case PS2_BACKSPACE_SHIFT :    // decrement serial number
                                    serial_number--;
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("SN " + String(serial_number), 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("Serial: " + String(serial_number), 0, default_display_msg_delay);
                                    }
                                    #endif          
                                    break;
                                
                                #endif //OPTION_SAVE_MEMORY_NANOKEYER

                                case PS2_LEFT_ALT :
                                #ifdef DEBUG_PS2_KEYBOARD
                                    debug_serial_port->println(F("PS2_LEFT_ALT\n"));
                                #endif
                                break;


                                case PS2_A_CTRL :
                                configuration.keyer_mode = IAMBIC_A;
                                #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("Iambic A", 0, default_display_msg_delay);
                                #endif
                                config_dirty = 1;
                                break;

                                case PS2_B_CTRL :
                                configuration.keyer_mode = IAMBIC_B;
                                #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("Iambic B", 0, default_display_msg_delay);
                                #endif          
                                config_dirty = 1;
                                break;

                                case PS2_C_CTRL :
                                configuration.keyer_mode = SINGLE_PADDLE;
                                #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                    lcd_center_print_timed("SnglePdl", 0, default_display_msg_delay);
                                    } else {
                                    lcd_center_print_timed("Single Paddle", 0, default_display_msg_delay);
                                    }
                                #endif          
                                config_dirty = 1;
                                break;

                                #ifndef OPTION_NO_ULTIMATIC
                                case PS2_D_CTRL :
                                configuration.keyer_mode = ULTIMATIC;
                                #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                    lcd_center_print_timed("Ultimatc", 0, default_display_msg_delay);
                                    } else {
                                    lcd_center_print_timed("Ultimatic", 0, default_display_msg_delay);
                                    }          
                                #endif        
                                config_dirty = 1;
                                break;
                                #endif // OPTION_NO_ULTIMATIC
                                #ifndef OPTION_SAVE_MEMORY_NANOKEYER
                                case PS2_E_CTRL :
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("EnterSN", 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("Enter Serial #", 0, default_display_msg_delay);
                                    }            
                                    #else        
                                    boop_beep();
                                    #endif
                                    work_int = ps2_keyboard_get_number_input(4,0,10000);
                                    if (work_int > 0) {
                                    serial_number = work_int;
                                    #ifdef FEATURE_DISPLAY
                                        lcd_status = LCD_REVERT;
                                    #else             
                                        beep();
                                    #endif
                                    }
                                    break;
                                #endif //OPTION_SAVE_MEMORY_NANOKEYER

