K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
                                case PS2_G_CTRL :
                                configuration.keyer_mode = BUG;
                                #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("Bug", 0, default_display_msg_delay);
                                #endif
                                config_dirty = 1;
                                break;

                                #ifdef FEATURE_HELL
                                case PS2_H_CTRL :       
                                    if (char_send_mode == CW) {
                                    char_send_mode = HELL;
                                    beep();
                                    } else {
                                    char_send_mode = CW;
                                    beep();
                                    }
                                    break;
                                #endif //FEATURE_HELL

                                case PS2_I_CTRL:
                                if (key_tx && keyer_machine_mode != KEYER_COMMAND_MODE) { //Added check that keyer is NOT in command mode or keyer might be enabled for paddle commands (WD9DMP)
                                    key_tx = 0;
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX off", 0, default_display_msg_delay);
                                    #endif
                                    
                                } else if (!key_tx && keyer_machine_mode != KEYER_COMMAND_MODE) { //Added check that keyer is NOT in command mode or keyer might be enabled for paddle commands (WD9DMP)
                                    key_tx = 1;
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX on", 0, default_display_msg_delay);
                                    #endif      
                                }
                                break;

                                case PS2_L_CTRL:  // Disable Backlight auto dim timeout
                                    configuration.backlight_timeout_disable = !configuration.backlight_timeout_disable;  // if a long press will toggle the backlight timeout feature
                                    tft_backlight(1);
                                    config_dirty = 1;
                                break;

                                #ifdef FEATURE_FARNSWORTH
                                case PS2_M_CTRL:         
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("Frnswrth", 1, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("Farnsworth WPM", 1, default_display_msg_delay);
                                    }
                                    #else          
                                    boop_beep();
                                    #endif
                                    work_int = ps2_keyboard_get_number_input(3,-1,1000);
                                    if (work_int > -1) {
                                    configuration.wpm_farnsworth = work_int;
                                    #ifdef FEATURE_DISPLAY
                                        lcd_status = LCD_REVERT;
                                    #else
                                        beep();
                                    #endif
                                    config_dirty = 1;
                                    }
                                    
                                    break;
                                #endif //FEATURE_FARNSWORTH

                                case PS2_N_CTRL :
                                if (configuration.paddle_mode == PADDLE_NORMAL) {
                                    configuration.paddle_mode = PADDLE_REVERSE;
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("Pdl Rev", 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("Paddle Reverse", 0, default_display_msg_delay);
                                    }
                                    #endif
                                } else {
                                    configuration.paddle_mode = PADDLE_NORMAL;
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("Pdl Norm", 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("Paddle Normal", 0, default_display_msg_delay);
                                    }      
                                    #endif      
                                }
                                config_dirty = 1;
                                break;

                                case PS2_O_CTRL : // CTRL-O - cycle through sidetone modes on, paddle only and off - New code Marc-Andre, VE2EVN
                                if (configuration.sidetone_mode == SIDETONE_PADDLE_ONLY) {
                                    configuration.sidetone_mode = SIDETONE_OFF;
                                    boop();  
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("ST Off", 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("Sidetone Off", 0, default_display_msg_delay);
                                    }
                                    #endif
                                } else if (configuration.sidetone_mode == SIDETONE_ON) {
                                    configuration.sidetone_mode = SIDETONE_PADDLE_ONLY;
                                    beep();
                                    myDelay(400);
                                    beep();
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("ST Pdl O", 0, default_display_msg_delay);
                                    }            
                                    if (LCD_COLUMNS > 19){
                                        lcd_center_print_timed("Sidetone Paddle Only", 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("Sidetone", 0, default_display_msg_delay);
                                        lcd_center_print_timed("Paddle Only", 1, default_display_msg_delay);
                                    }
                                    #endif
                                } else {
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("ST On", 0, default_display_msg_delay);
                                    } else {            
                                        lcd_center_print_timed("Sidetone On", 0, default_display_msg_delay);
                                    }
                                    #endif      
                                    configuration.sidetone_mode = SIDETONE_ON;
                                    beep();
                                }
                                config_dirty = 1;
                                break;

                                
                                #if defined(FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING)
                                case PS2_S_CTRL :
                                    if (configuration.cmos_super_keyer_iambic_b_timing_on){
                                    configuration.cmos_super_keyer_iambic_b_timing_on = 0;
                                    #ifdef FEATURE_DISPLAY
                                        lcd_center_print_timed("CMOS Superkeyer Off", 0, default_display_msg_delay);
                                    #endif      
                                    } else {
                                    #ifdef FEATURE_DISPLAY
                                        lcd_center_print_timed("CMOS Superkeyer On", 0, default_display_msg_delay);
                                    #endif      
                                    configuration.cmos_super_keyer_iambic_b_timing_on = 1;
                                    }
                                    config_dirty = 1;
                                    break;
                                #endif //FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING

