K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
                                case PS2_T_CTRL :
                                #ifdef FEATURE_MEMORIES
                                    repeat_memory = 255;
                                #endif
                                if (keyboard_tune_on) {
                                    debug_serial_port->println(F("Tune OFF"));
                                    sending_mode = MANUAL_SENDING;
                                    tx_and_sidetone_key(0);
                                    keyboard_tune_on = 0;
                                    #ifdef FEATURE_DISPLAY
                                    lcd_status = LCD_REVERT;
                                    #endif // FEATURE_DISPLAY
                                } else {
                                    debug_serial_port->println(F("Tune ON"));
                                    #ifdef FEATURE_DISPLAY
                                      lcd_center_print_timed("Tune", 0, default_display_msg_delay);
                                    #endif      
                                    sending_mode = MANUAL_SENDING;
                                    tx_and_sidetone_key(1);
                                    keyboard_tune_on = 1;
                                }
                                break;

                                case PS2_U_CTRL :
                                if (ptt_line_activated) {
                                    manual_ptt_invoke = 0;
                                    ptt_unkey();
                                    #ifdef FEATURE_DISPLAY
                                    lcd_status = LCD_REVERT;
                                    #endif // FEATURE_DISPLAY            
                                } else {
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("PTTInvk", 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("PTT Invoke", 0, default_display_msg_delay);
                                    }
                                    #endif      
                                    manual_ptt_invoke = 1;
                                    ptt_key();
                                }
                                break;

                                case PS2_W_CTRL :
                                #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                    lcd_center_print_timed("WPM Adj", 0, default_display_msg_delay);
                                    } else {
                                    lcd_center_print_timed("WPM Adjust", 0, default_display_msg_delay);
                                    }        
                                #else
                                    boop_beep();
                                #endif
                                queueflush();
                                work_int = ps2_keyboard_get_number_input(3,0,1000);
                                if (work_int > 0) {
                                    speed_set(work_int);
                                    #ifdef FEATURE_DISPLAY
                                    lcd_status = LCD_REVERT;
                                    #else
                                    beep();
                                    #endif
                                    config_dirty = 1;
                                }
                                break;

                                #ifdef FEATURE_GPS
                                case PS2_Y_CTRL : {  // cyc;le thogh GPS serial port baud rates and restart comms                                  
                                  static uint32_t next_baud = 0;
                                  
                                  if (configuration.gps_baud == 0) next_baud = GPS_BAUD_RATE;
                                  else next_baud = configuration.gps_baud;

                                  switch (next_baud) {
                                    case 4800: next_baud = 9600; break;
                                    case 9600: next_baud = 19200; break;
                                    case 19200: next_baud = 38400; break;
                                    case 38400: next_baud = 57600; break;
                                    case 57600: next_baud = 115200; break;
                                    default: next_baud = 4800; break;
                                  }                                   
                                  
                                  debug_serial_port->print("New Serial Port Baud Rate is "); debug_serial_port->println(next_baud);                                                                  
                                  configuration.gps_baud = next_baud;                                  
                                 
                                  #if !defined(GPS_TEST)
                                    #if defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)                                    
                                    gps_serial_port.flush();
                                    gps_serial_port.end();
                                    gps_serial_port.begin(next_baud);
                                    #else
                                      gps_serial_port.updateBaudRate(next_baud);   // serial processing resumes after a few seconds delay
                                    #endif
                                    gps_serial_port.read();  // similar to flush                                 
                                  #endif 
                                  #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("Serial Baud " + String(next_baud), 0, default_display_msg_delay); 
                                  #endif
                                  check_gps(true, false);
                                }
                                break;
                                #endif

