K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
                                case PS2_F1_CTRL :
                                switch_to_tx_silent(1);
                                #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 1", 0, default_display_msg_delay);
                                #endif          
                                break;

                                case PS2_F2_CTRL :
                                if ((ptt_tx_2) || (tx_key_line_2)) {
                                    switch_to_tx_silent(2);          
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 2", 0, default_display_msg_delay);
                                    #endif                      
                                }
                                break;
                                #ifndef OPTION_SAVE_MEMORY_NANOKEYER
                                case PS2_F3_CTRL :
                                if ((ptt_tx_3)  || (tx_key_line_3)) {
                                    switch_to_tx_silent(3);                       
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 3", 0, default_display_msg_delay);
                                    #endif                                  
                                }
                                break;

                                case PS2_F4_CTRL :
                                if ((ptt_tx_4)  || (tx_key_line_4)) {
                                    switch_to_tx_silent(4);   
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 4", 0, default_display_msg_delay);
                                    #endif                                  
                                }
                                break;

                                case PS2_F5_CTRL :
                                if ((ptt_tx_5)  || (tx_key_line_5)) {
                                    switch_to_tx_silent(5);  
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 5", 0, default_display_msg_delay);
                                    #endif                      
                                }
                                break;

                                case PS2_F6_CTRL :
                                if ((ptt_tx_6)  || (tx_key_line_6)) {
                                    switch_to_tx_silent(6);
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 6", 0, default_display_msg_delay);
                                    #endif                                  
                                }
                                break;
                                #endif //OPTION_SAVE_MEMORY_NANOKEYER
                                
                                #ifdef FEATURE_COMPASS
                                case PS2_F8_CTRL : {  // if compass is enabled, display in a popup window                                                                   
                                    if (update_heading_display_flag) {
                                      update_heading_display_flag = false;
                                      if (popup_active) {
                                        popup(false);
                                        popup_active = false;   
                                      }                          
                                      return;
                                    }
                                    display_heading();                                                      
                                }
                                break;
                                #endif

                                case PS2_F9_CTRL : {  // tell GPS how many grid digits to save to memory location                                  
                                  if (configuration.grid_digits == 4) {
                                    configuration.grid_digits = 6;
                                    #ifdef FEATURE_DISPLAY
                                      lcd_center_print_timed(F("GRID LENGTH = 6 "), 0, default_display_msg_delay);
                                    #endif
                                  } else {
                                    configuration.grid_digits = 4;
                                    #ifdef FEATURE_DISPLAY
                                      lcd_center_print_timed(F("GRID LENGTH = 4 "), 0, default_display_msg_delay);
                                    #endif
                                  }
                                  do_process = true;
                                  process_gps(grid_sq_str, true, false);  // force a memory update                  
                                }                                
                                break;

                                case PS2_F10_CTRL :   // ignore stored GPS grid square
                                  check_gps(true, true);  // force a memory update                                             
                                break;
                                          
                                #ifdef FEATURE_GPS
                                case PS2_F11_CTRL : {   // enter new grid sqaure in memory x and store it in config structure                                 
                                  char tmp_str[LCD_COLUMNS] = {};
                                  #ifdef FEATURE_DISPLAY                              
                                    sprintf(tmp_str, "M%d = Grid Sq", GRID_WORKING_MEMORY);
                                    debug_serial_port->println(tmp_str); 
                                    lcd_center_print_timed(tmp_str, 2, default_display_msg_delay);
                                  #endif
                                  ps2_keyboard_program_memory(GRID_WORKING_MEMORY-1);                                                                                        
                                  // store user entered memory x value into config structure, overrides defaults
                                  //command_display_memory(GRID_WORKING_MEMORY-1);
                                  char memory_str[LCD_COLUMNS] = {};
                                  int len = read_memory(GRID_WORKING_MEMORY-1, memory_str);
                                  if (len >=8) len = 8;
                                  memory_str[len] = '\0';  // replace the 255 with null
                                  //debug_serial_port->print("Read memory str = "); debug_serial_port->println(memory_str);  
                                  //debug_serial_port->print("Read memory len = "); debug_serial_port->println(len);                                    
                                  validate_grid(memory_str, tmp_str);  // returns a proper 4-8 grid, or empty grid if bad input.
                                  strcpy(configuration.Mem_GridSq, tmp_str);
                                  config_dirty = 1;
                                  debug_serial_port->print("Read Validated Memory Grid = "); debug_serial_port->println(configuration.Mem_GridSq);
                                  do_process = true;
                                  process_gps(configuration.Mem_GridSq, true, 2);  // force a memory update (source = 2)                                                                   
                                }
                                break;
                                #endif  // FEATURE_GPS
                                
                                #ifdef FEATURE_COMPASS
                                case PS2_F12_CTRL : {   // enter new declination in memory x and store it in config structure                                 
                                  char tmp_str[LCD_COLUMNS] = {};
                                  #ifdef FEATURE_DISPLAY                              
                                    sprintf(tmp_str, "M%d = Declination", DECLINATION_WORKING_MEMORY);
                                    debug_serial_port->println(tmp_str); 
                                    lcd_center_print_timed(tmp_str, 2, default_display_msg_delay);
                                  #endif
                                  ps2_keyboard_program_memory(DECLINATION_WORKING_MEMORY-1);                                                                                        
                                  // store user entered memory x value into config structure, overrides defaults
                                  //command_display_memory(DECLINATION_WORKING_MEMORY-1);
                                  char memory_str[LCD_COLUMNS] = {};
                                  int len = read_memory(DECLINATION_WORKING_MEMORY-1, memory_str);
                                  memory_str[len] = '\0';  // replace the 255 with null
                                  //debug_serial_port->print("Read memory str = "); debug_serial_port->println(memory_str);  
                                  //debug_serial_port->print("Read memory len = "); debug_serial_port->println(len);       
                                  process_compass(true, false);  // force a memory update 
                                }
                                break;
                                #endif  // FEATURE_COMPASS

                                #ifdef FEATURE_AUTOSPACE
                                case PS2_Z_CTRL:
                                if (configuration.autospace_active) {
                                    configuration.autospace_active = 0;
                                    config_dirty = 1;
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed(F("AutoSOff"), 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed(F("Autospace Off"), 0, default_display_msg_delay);
                                    }
                                    #endif                                  
                                } else {
                                    configuration.autospace_active = 1;
                                    config_dirty = 1;
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("AutoSpOn", 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("Autospace On", 0, default_display_msg_delay);
                                    }            
                                    #endif                                  
                                }
                                break;
                                #endif

                                default :
                                if ((keystroke > 31) && (keystroke < 255 /*123*/)) {
                                    if (ps2_prosign_flag) {
                                    add_to_send_buffer(SERIAL_SEND_BUFFER_PROSIGN);
                                    ps2_prosign_flag = 0;
                                    }
                                    keystroke = uppercase(keystroke);
                                    add_to_send_buffer(keystroke);
                                    #ifdef FEATURE_MEMORIES
                                    repeat_memory = 255;
                                    #endif
                                }
                                break;
                            }
                        } 
                        else 
                        {
                            ;  // nothing for now                        
                        }                        
                }  //while ((keyboard.available()) && (play_memory_prempt == 0))
        #endif
    #endif
}

#endif //FEATURE_PS2_KEYBOARD || defined (FEATURE_BT_KEYBOARD)

//-------------------------------------------------------------------------------------------------------
#if (defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_USB_KEYBOARD) || defined(FEATURE_BT_KEYBOARD) || defined(FEATURE_TOUCH_DISPLAY)) && defined(FEATURE_MEMORIES)
void ps2_usb_keyboard_play_memory(byte memory_number){

  if (memory_number < number_of_memories) {
    add_to_send_buffer(SERIAL_SEND_BUFFER_MEMORY_NUMBER);
    add_to_send_buffer(memory_number);
    #ifdef FEATURE_MEMORIES
    repeat_memory = 255;
    #endif //FEATURE_MEMORIES
  }
}
#endif  //defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_USB_KEYBOARD)

//-------------------------------------------------------------------------------------------------------
#if (defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_BT_KEYBOARD) || defined(FEATURE_TOUCH_DISPLAY)) && defined(FEATURE_MEMORIES)
void ps2_keyboard_program_memory(byte memory_number)
{

  char keystroke = 0;
  byte looping = 1;
  byte error = 0;
  int temp_memory_index = 0;
  byte temp_memory[(memory_end(memory_number)-memory_start(memory_number) + 1)];
  int x;
  String keyboard_string;

