K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  serial_number_string = String(serial_number, DEC);
  if ((serial_number_string.length() < 3 ) && (serial_leading_zeros)) {
    if (serial_cut_numbers) {
      add_to_send_buffer('T');
    } else {
      add_to_send_buffer('0');
    }
  }
  if ((serial_number_string.length() == 1) && (serial_leading_zeros)) {
    if (serial_cut_numbers) {
      add_to_send_buffer('T');
    } else {
      add_to_send_buffer('0');
    }
  }
  for (byte a = 0; a < serial_number_string.length(); a++)  {
    if ((serial_number_string[a] == '0') && (serial_cut_numbers)) {
      add_to_send_buffer('T');
    } else {
     if ((serial_number_string[a] == '9')  && (serial_cut_numbers)) {
       add_to_send_buffer('N');
     } else {
       add_to_send_buffer(serial_number_string[a]);
     }
    }
  }
}
#endif //defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_USB_KEYBOARD)

//-------------------------------------------------------------------------------------------------------

#ifdef DEBUG_CAPTURE_COM_PORT
void debug_capture ()
{

  byte serial_byte_in;
  int x = 1022;

  while (primary_serial_port->available() == 0) {myDelay(1);}  // wait for first byte
  serial_byte_in = primary_serial_port->read();
  primary_serial_port->write(serial_byte_in);
  //if ((serial_byte_in > 47) or (serial_byte_in = 20)) { primary_serial_port->write(serial_byte_in); }  // echo back
  if (serial_byte_in == '~') {
    debug_capture_dump();    // go into dump mode if we get a tilde
  } else {
    EEPROM.write(x,serial_byte_in);
    x--;
    while ( x > 400) {
      myDelay(1);
      if (primary_serial_port->available() > 0) {
        serial_byte_in = primary_serial_port->read();
        EEPROM.write(x,serial_byte_in);
        EEPROM.write(x-1,255);
        send_dit();
        x--;
        primary_serial_port->write(serial_byte_in);
        //if ((serial_byte_in > 47) or (serial_byte_in = 20)) { primary_serial_port->write(serial_byte_in); }  // echo back
      }
    }
  }
  #if defined(HARDWARE_ESP32_DEV)  || defined(ARDUINO_RASPBERRY_PI_PICO_W) ||  defined(ARDUINO_RASPBERRY_PI_PICO)
    EEPROM.commit();
  #endif

  while (1) {myDelay(1);}

}
#endif

//-------------------------------------------------------------------------------------------------------

#ifdef DEBUG_CAPTURE_COM_PORT
void debug_capture_dump()
{
  byte eeprom_byte_in;

  for ( int x = 1022; x > (1022-100); x-- ) {
    eeprom_byte_in = EEPROM.read(x);
    if (eeprom_byte_in < 255) {
      primary_serial_port->print(eeprom_byte_in,BYTE);
    } else {
      x = 0;
    }
  }
  primary_serial_port->println(F("\n"));
  for ( int x = 1022; x > (1022-100); x-- ) {
    eeprom_byte_in = EEPROM.read(x);
    if (eeprom_byte_in < 255) {
      primary_serial_port->print(eeprom_byte_in,HEX);
      primary_serial_port->write("   :");
      primary_serial_port->println(eeprom_byte_in,BYTE);
    } else {
      x = 0;
    }
  }

  while (1) {myDelay(1);}

}
#endif

//-------------------------------------------------------------------------------------------------------
#ifdef FEATURE_ROTARY_ENCODER
int chk_rotary_encoder(){

  static unsigned long timestamp[5];

  unsigned char pinstate = (digitalRead(rotary_pin2) << 1) | digitalRead(rotary_pin1);
  state = ttable[state & 0xf][pinstate];
  unsigned char result = (state & 0x30);
  if (result) {
    timestamp[0] = timestamp[1];                    // Encoder step timer
    timestamp[1] = timestamp[2]; 
    timestamp[2] = timestamp[3]; 
    timestamp[3] = timestamp[4]; 
    timestamp[4] = millis();
    
    unsigned long elapsed_time = (timestamp[4] - timestamp[0]); // Encoder step time difference for 10's step
 
    if (result == DIR_CW) {
      if (elapsed_time < 250) {return 2;} else {return 1;};
    }
    if (result == DIR_CCW) {
      if (elapsed_time < 250) {return -2;} else {return -1;};
    }
  }
  return 0;
}

void check_rotary_encoder(){

  int step = chk_rotary_encoder();

  if (step != 0) {
    if (keyer_machine_mode == KEYER_COMMAND_MODE) speed_change_command_mode(step);
    else speed_change(step);
    
    #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
      last_active_time = millis(); 
    #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM
    
    // Start of Winkey Speed change mod for Rotary Encoder -- VE2EVN
    #ifdef FEATURE_WINKEY_EMULATION
      if ((primary_serial_port_mode == SERIAL_WINKEY_EMULATION) && (winkey_host_open)) {
        winkey_port_write(((configuration.wpm-pot_wpm_low_value)|128),0);
        winkey_last_unbuffered_speed_wpm = configuration.wpm;
      }
    #endif    
    // End of Winkey Speed change mod for Rotary Encoder -- VE2EVN

  } // if (step != 0)
  
}
#endif //FEATURE_ROTARY_ENCODER
//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_SIDETONE_SWITCH
void check_sidetone_switch()
{
	static unsigned long lastcheck = 0 ; 

    if ( millis() - lastcheck < 250 ) return ;

    lastcheck = millis() ;

    int ss_read = sidetone_switch_value();

    if ( (ss_read == HIGH)  && ( (configuration.sidetone_mode == SIDETONE_ON) ||
                               (configuration.sidetone_mode == SIDETONE_PADDLE_ONLY) )){
        return ;
    }
    if ( (ss_read == LOW)  && configuration.sidetone_mode == SIDETONE_OFF ){
        return ;
    }
    config_dirty = 1;
    #ifdef FEATURE_SLEEP
     last_activity_time = millis(); 
    #endif //FEATURE_SLEEP
    #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
     last_active_time = millis(); 
    #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

    if ( ss_read == HIGH ) {
        configuration.sidetone_mode = SIDETONE_ON;
        return ;
    }
    if ( ss_read == LOW ){
        configuration.sidetone_mode = SIDETONE_OFF;
        return ;
    }
}

int sidetone_switch_value()
{
    return digitalRead(SIDETONE_SWITCH);
}

#endif


//-------------------------------------------------------------------------------------------------------


#ifdef FEATURE_POTENTIOMETER
void check_potentiometer()
{
  #ifdef DEBUG_LOOP
    debug_serial_port->println(F("loop: entering check_potentiometer")); 
  #endif

  static unsigned long last_pot_check_time = 0;
  
  if ((configuration.pot_activated || potentiometer_always_on) && ((millis() - last_pot_check_time) > potentiometer_check_interval_ms)) {
    last_pot_check_time = millis();
    if ((potentiometer_enable_pin) && (digitalRead(potentiometer_enable_pin) == HIGH)){
      return; 
    }
    byte pot_value_wpm_read = pot_value_wpm();
    if (((abs(pot_value_wpm_read - last_pot_wpm_read) * 10) > (potentiometer_change_threshold * 10))) {
      #ifdef DEBUG_POTENTIOMETER
        debug_serial_port->print(F("check_potentiometer: speed change: "));
        debug_serial_port->print(pot_value_wpm_read);
        debug_serial_port->print(F(" analog read: "));
        debug_serial_port->println(analogRead(potentiometer));
      #endif

      #ifdef FEATURE_WINKEY_EMULATION
        if (keyer_machine_mode == KEYER_COMMAND_MODE) {
          command_speed_set(pot_value_wpm_read);
        } else {
          if (!winkey_host_open){
            speed_set(pot_value_wpm_read);
          }
        }
        if ((primary_serial_port_mode == SERIAL_WINKEY_EMULATION) && (winkey_host_open)) {
          winkey_port_write(((pot_value_wpm_read-pot_wpm_low_value)|128),0);
          winkey_last_unbuffered_speed_wpm = configuration.wpm;
        }        
      #else
        if (keyer_machine_mode == KEYER_COMMAND_MODE) {
          command_speed_set(pot_value_wpm_read);
        } else {
          speed_set(pot_value_wpm_read);
        }
      #endif
      last_pot_wpm_read = pot_value_wpm_read;
      #ifdef FEATURE_SLEEP
        last_activity_time = millis(); 
      #endif //FEATURE_SLEEP
      #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
        last_active_time = millis(); 
      #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM  
    }
  }
}

#endif
//-------------------------------------------------------------------------------------------------------
#ifdef FEATURE_POTENTIOMETER
byte pot_value_wpm()
{
  // int pot_read = analogRead(potentiometer);
  // byte return_value = map(pot_read, 0, pot_full_scale_reading, pot_wpm_low_value, pot_wpm_high_value);
  // return return_value;
  static int last_pot_read = 0;
  static byte return_value = 0;
  int pot_read = analogRead(potentiometer);
  if (abs(pot_read - last_pot_read) > potentiometer_reading_threshold ) {
    #if defined(default_pot_full_ccw_reading)
      return_value = map(pot_read, default_pot_full_ccw_reading, pot_full_scale_reading, pot_wpm_low_value, pot_wpm_high_value);
    #else
      return_value = map(pot_read, 0, pot_full_scale_reading, pot_wpm_low_value, pot_wpm_high_value);
    #endif
    last_pot_read = pot_read;
  }
  return return_value;

