K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      #if defined(FEATURE_USB_KEYBOARD) || defined(FEATURE_USB_MOUSE)
        service_usb();
      #endif //FEATURE_USB_KEYBOARD || FEATURE_USB_MOUSE

      #if defined(FEATURE_PTT_INTERLOCK)
        service_ptt_interlock();
      #endif //FEATURE_PTT_INTERLOCK

      #if defined(FEATURE_4x4_KEYPAD) || defined(FEATURE_3x4_KEYPAD)
        service_keypad();
      #endif

      #if defined(FEATURE_DISPLAY)
        if ((ticks - (micros() - start)) > (10 * 1000)) {
         service_display();
        }
      #endif
      
      if ((configuration.keyer_mode != ULTIMATIC) && (configuration.keyer_mode != SINGLE_PADDLE)) {
        if ((configuration.keyer_mode == IAMBIC_A) && (paddle_pin_read(paddle_left) == LOW ) && (paddle_pin_read(paddle_right) == LOW )) {
          iambic_flag = 1;
        }    
     
        #ifndef FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING
          if (being_sent == SENDING_DIT) {
            check_dah_paddle();
          } else {
            if (being_sent == SENDING_DAH) {
              check_dit_paddle();
            } else {
              check_dah_paddle();
              check_dit_paddle();                
            }
          }            
        #else ////FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING
          //if (configuration.cmos_super_keyer_iambic_b_timing_on){
          if ((configuration.cmos_super_keyer_iambic_b_timing_on) && (sending_mode == MANUAL_SENDING)) {  
            if ((float(float(micros()-start)/float(ticks))*100) >= configuration.cmos_super_keyer_iambic_b_timing_percent) {
            //if ((float(float(millis()-starttime)/float(starttime-ticks))*100) >= configuration.cmos_super_keyer_iambic_b_timing_percent) {
             if (being_sent == SENDING_DIT) {
                check_dah_paddle();
              } else {
                if (being_sent == SENDING_DAH) {
                  check_dit_paddle();
                }
              }     
            } else {
              if (((being_sent == SENDING_DIT) || (being_sent == SENDING_DAH)) && (paddle_pin_read(paddle_left) == LOW ) && (paddle_pin_read(paddle_right) == LOW )) {
                dah_buffer = 0;
                dit_buffer = 0;         
              }              
            }
          } else {
            if (being_sent == SENDING_DIT) {
              check_dah_paddle();
            } else {
              if (being_sent == SENDING_DAH) {
                check_dit_paddle();
              } else {
                check_dah_paddle();
                check_dit_paddle();                
              }
            }  
          }  
        #endif //FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING

      } else { //(configuration.keyer_mode != ULTIMATIC)
        #ifndef OPTION_NO_ULTIMATIC
        if (being_sent == SENDING_DIT) {
          check_dah_paddle();
        } else {
          if (being_sent == SENDING_DAH) {
            check_dit_paddle();
          } else {
            check_dah_paddle();
            check_dit_paddle();                
          }
        }   
        #endif // OPTION_NO_ULTIMATIC

      }
      
      #if defined(FEATURE_MEMORIES) && defined(FEATURE_BUTTONS)
        check_the_memory_buttons();
      #endif

      // blow out prematurely if we're automatic sending and a paddle gets hit
      #ifdef FEATURE_BUTTONS
        if (sending_mode == AUTOMATIC_SENDING && (paddle_pin_read(paddle_left) == LOW || paddle_pin_read(paddle_right) == LOW || analogbuttonread(0) || dit_buffer || dah_buffer)) {
          if (keyer_machine_mode == KEYER_NORMAL) {
            sending_mode = AUTOMATIC_SENDING_INTERRUPTED;
            automatic_sending_interruption_time = millis(); 
            return;
          }
        }   
      #else
        if (sending_mode == AUTOMATIC_SENDING && (paddle_pin_read(paddle_left) == LOW || paddle_pin_read(paddle_right) == LOW || dit_buffer || dah_buffer)) {
          if (keyer_machine_mode == KEYER_NORMAL) {
            sending_mode = AUTOMATIC_SENDING_INTERRUPTED;
            automatic_sending_interruption_time = millis(); 

            #ifdef FEATURE_SO2R_BASE
              so2r_set_rx();
            #endif

            return;
          }
        }   
      #endif

      #ifdef FEATURE_STRAIGHT_KEY
        service_straight_key();
      #endif //FEATURE_STRAIGHT_KEY


      #if defined(FEATURE_WEB_SERVER)
        if (speed_mode == SPEED_QRSS){
          service_web_server();
        }
      #endif //FEATURE_WEB_SERVER

      #ifdef FEATURE_SO2R_SWITCHES
        so2r_switches();
      #endif      
      
    }  //while ((millis() < endtime) && (millis() > 200))
  
    if ((configuration.keyer_mode == IAMBIC_A) && (iambic_flag) && (paddle_pin_read(paddle_left) == HIGH ) && (paddle_pin_read(paddle_right) == HIGH )) {
        iambic_flag = 0;
        dit_buffer = 0;
        dah_buffer = 0;
    }    
  
    if ((being_sent == SENDING_DIT) || (being_sent == SENDING_DAH)){
      if (configuration.dit_buffer_off) {dit_buffer = 0;}
      if (configuration.dah_buffer_off) {dah_buffer = 0;}
    }  

    #if defined(DEBUG_LOOP_ELEMENT_LENGTHS)
      debug_serial_port->println(F("loop_element_lengths: exit"));
    #endif


} //void loop_element_lengths

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_DISPLAY
  void lcd_center_print_timed_wpm(){

    #ifndef FEATURE_TFT_DISPLAY
      #if defined(OPTION_ADVANCED_SPEED_DISPLAY)
        lcd_center_print_timed(String(configuration.wpm) + " wpm - " + (configuration.wpm*5) + " cpm", 0, default_display_msg_delay);
        lcd_center_print_timed(String(1200/configuration.wpm) + ":" + (((1200/configuration.wpm)*configuration.dah_to_dit_ratio)/100) + "ms 1:" + (float(configuration.dah_to_dit_ratio)/100.00), 1, default_display_msg_delay);
      #else

          lcd_center_print_timed(String(configuration.wpm) + " wpm", 0, default_display_msg_delay);

      #endif
    #endif

  }
#endif

//-------------------------------------------------------------------------------------------------------

void speed_change(int change)
{
  if (((configuration.wpm + change) > wpm_limit_low) && ((configuration.wpm + change) < wpm_limit_high)) {
    speed_set(configuration.wpm + change);
  }

