K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
        #ifdef FEATURE_DISPLAY
          service_display();
        #endif

        #ifdef FEATURE_POTENTIOMETER
          if (configuration.pot_activated) {
            check_potentiometer();
          }
        #endif
        
        #ifdef FEATURE_ROTARY_ENCODER
          check_rotary_encoder();
        #endif //FEATURE_ROTARY_ENCODER    

        check_paddles();

        if (dit_buffer) {
          sending_mode = MANUAL_SENDING;
          send_dit();
          dit_buffer = 0;
          paddle_hit = 1;
          cw_char = (cw_char * 10) + 1;
          last_element_time = millis();
        }
        if (dah_buffer) {
          sending_mode = MANUAL_SENDING;
          send_dah();
          dah_buffer = 0;
          paddle_hit = 1;
          cw_char = (cw_char * 10) + 2;
          last_element_time = millis();
        }
 
        // have we hit letterspace time (end of a letter?)
        if ((paddle_hit) && (millis() > (last_element_time + (float(600/configuration.wpm) * length_letterspace)))) {
          #ifdef DEBUG_PRACTICE_CMD_MODE
            debug_serial_port->println(F("command_progressive_5_char_echo_practice: user_send_loop: hit length_letterspace"));
          #endif
          incoming_char = convert_cw_number_to_ascii(cw_char);
          //port_to_use->print(incoming_char);
          user_sent_cw.concat(incoming_char);
          cw_char = 0;
          paddle_hit = 0;
          // TODO - print it to serial and lcd
        }

        // do we have all the characters from the user? - if so, get out of user_send_loop
        if ((user_sent_cw.length() >= cw_to_send_to_user.length()) || ((progressive_step_counter < 255) && (user_sent_cw.length() == progressive_step_counter))) {
          user_send_loop = 0;
          //port_to_use->println();
        }

        // does the user want to exit?
        while (analogbuttonread(0)) {
          myDelay(1);
          user_send_loop = 0;
          loop1 = 0;
          loop2 = 0;
          if (correct_answer_led) digitalWrite(correct_answer_led, LOW);                  // clear the LEDs as we exit
          if (wrong_answer_led) digitalWrite(wrong_answer_led, LOW);
        }

      }                                                //while (user_send_loop)

      if (loop1 && loop2) {
        if (progressive_step_counter < 255) {                                             // we're in progressive mode
          if (user_sent_cw.substring(0,progressive_step_counter) == cw_to_send_to_user.substring(0,progressive_step_counter)) {    // we get here if the character entered is correct
            if (progressive_step_counter < 6) {                                           // if the step counter is less than 6 then we have not finished the 5 character string
              if (correct_answer_led) digitalWrite(correct_answer_led, HIGH);             // set the correct answer LED high
              if (wrong_answer_led) digitalWrite(wrong_answer_led, LOW);                  // clear the wrong answer LED 
              beep();                                                                     // and beep
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS > 17) lcd_center_print_timed("Success! " + String(progressive_step_counter) + " correct", 0, default_display_msg_delay);
                else lcd_center_print_timed("Success!", 0, default_display_msg_delay);
              #endif                                                                      // FEATURE_DISPLAY
              send_char(' ',0);
              send_char(' ',0);
              progressive_step_counter++;
            }                                                                             // end if (progressive_step_counter < 6)
            if (progressive_step_counter == 6) {                                          // we get here if the five character string is correct
              loop2 = 0;
              if (correct_answer_led) digitalWrite(correct_answer_led, HIGH);             // set the correct answer LED high
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("Success!", 0, default_display_msg_delay);
                if (LCD_COLUMNS > 17) lcd_center_print_timed("5 characters correct", 1, default_display_msg_delay);
                if (LCD_COLUMNS < 17) lcd_center_print_timed("5 char correct", 1, default_display_msg_delay);
              #endif                                                                      // FEATURE_DISPLAY
              unsigned int NEWtone               =  400;                                  // the initial tone freuency for the tone sequence
              unsigned int TONEduration          =   50;                                  // define the duration of each tone element in the tone sequence to drive a speaker
              for (int k=0; k<6; k++) {              
                s_tone(sidetone_line, NEWtone, TONEduration);                                              // generate a tone on the speaker pin                
                NEWtone = NEWtone*1.25;                                                                  // calculate a new value for the tone frequency
              }                                                                           // end for
              send_char(' ',0);
              send_char(' ',0);
              if (correct_answer_led) digitalWrite(correct_answer_led, LOW);              // clear the correct answer LED
            }                                                                             // end if (progressive_step_counter == 6)
          } else {                                                                        // we get here if the character entered is wrong
            if (wrong_answer_led) digitalWrite(wrong_answer_led, HIGH);                   // set the wrong answer LED high
            if (correct_answer_led) digitalWrite(correct_answer_led, LOW);                // clear the correct answer LED
            boop();
            send_char(' ',0);
            send_char(' ',0);
          }
        } else {                                                                          // I don't think we ever get here, unless the progressive_step_counter is more than 255, but it is reset as Loop1 starts
          if (user_sent_cw == cw_to_send_to_user) {                                       // correct answer
            beep();
            send_char(' ',0);
            send_char(' ',0);
            loop2 = 0;
          } else {                                                                        // wrong answer
            boop();
            send_char(' ',0);
            send_char(' ',0);
          }
        }                                                                                 // if (progressive_step_counter < 255)
      }                                                                                   // if (loop1 && loop2)
    }                                                                                     //loop2
  }                                                                                       //loop1
  
  speed_mode = speed_mode_before; 
  configuration.keyer_mode = keyer_mode_before;
  paddle_echo_buffer = 0;
}
#endif //defined(FEATURE_COMMAND_MODE_PROGRESSIVE_5_CHAR_ECHO_PRACTICE) && defined(FEATURE_COMMAND_MODE)
	
//-------------------------------------------------------------------------------------------------------

#if defined(FEATURE_COMMAND_MODE)
void command_set_serial_number() {
  
  byte character_count = 0;;
  int cw_char = 0;
  byte number_sent = 0;
  unsigned int repeat_value = 0;
  byte error_flag = 0;
  
