K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  for (character_count = 0; character_count < 4; character_count++) {
    cw_char = get_cw_input_from_user(0);
    number_sent = (convert_cw_number_to_ascii(cw_char) - 48);
    if ((number_sent >= 0) && (number_sent < 10)) {
      repeat_value = (repeat_value * 10) + number_sent;
    } else { // we got a bad value
      error_flag = 1;
      character_count = 5;
    }      
  }
  
  if (error_flag) {
    boop();
  } else {
    serial_number = repeat_value;
    //config_dirty = 1;
    beep();
  }
}
#endif

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_MEMORIES
void command_set_mem_repeat_delay() {
  
  byte character_count = 0;;
  int cw_char = 0;
  int number_sent = 0;
  unsigned int repeat_value = 0;
  byte error_flag = 0;
  
  for (character_count = 0; character_count < 4; character_count++) {
    cw_char = get_cw_input_from_user(0);
    number_sent = (convert_cw_number_to_ascii(cw_char) - 48);
    if ((number_sent >= 0) && (number_sent < 10)) {
      repeat_value = (repeat_value * 10) + number_sent;
    } else { // we got a bad value
      error_flag = 1;
      character_count = 5;
    }      
  }
  
  if (error_flag) {
    boop();
  } else {
    configuration.memory_repeat_time = repeat_value;
    config_dirty = 1;
    beep();
  }
  
}
#endif //FEATURE_MEMORIES

//-------------------------------------------------------------------------------------------------------

void adjust_dah_to_dit_ratio(int adjustment) {

 if ((configuration.dah_to_dit_ratio + adjustment) > 150 && (configuration.dah_to_dit_ratio + adjustment) < 810) {
   configuration.dah_to_dit_ratio = configuration.dah_to_dit_ratio + adjustment;
   #ifdef FEATURE_DISPLAY
     #ifdef OPTION_MORE_DISPLAY_MSGS
        if (LCD_COLUMNS < 9){
          lcd_center_print_timed("DDR:" + String(configuration.dah_to_dit_ratio), 0, default_display_msg_delay);
        } else {   
          lcd_center_print_timed("Dah/Dit: " + String(configuration.dah_to_dit_ratio), 0, default_display_msg_delay);
        }
       service_display();
     #endif
   #endif   
 }

 config_dirty = 1;
}

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_COMMAND_MODE
void command_keying_compensation_adjust() {

  byte looping = 1;

  #ifdef FEATURE_DISPLAY
    if (LCD_COLUMNS < 9){
      lcd_center_print_timed("Key Comp", 0, default_display_msg_delay);
    } else {
      lcd_center_print_timed("Adj Keying Comp", 0, default_display_msg_delay);  
    }        
  #endif

  while (looping) {
    myDelay(1);
    send_dit();
    send_dah();
    if (paddle_pin_read(paddle_left) == LOW) {
      if (configuration.keying_compensation < 255){
        configuration.keying_compensation++;
      }
    }
    if (paddle_pin_read(paddle_right) == LOW) {
      if (configuration.keying_compensation > 0){
        configuration.keying_compensation--;
      }
    }
    while ((paddle_pin_read(paddle_left) == LOW && paddle_pin_read(paddle_right) == LOW) || (analogbuttonread(0))) { // if paddles are squeezed or button0 pressed - exit
      myDelay(1);
      looping = 0;
    }
   

    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER

  }
  while (paddle_pin_read(paddle_left) == LOW || paddle_pin_read(paddle_right) == LOW || analogbuttonread(0) ) {myDelay(1);}  // wait for all lines to go high
  dit_buffer = 0;
  dah_buffer = 0;
  config_dirty = 1;
}
#endif //FEATURE_COMMAND_MODE


//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_COMMAND_MODE
void command_dah_to_dit_ratio_adjust() {

  byte looping = 1;

  #ifdef FEATURE_DISPLAY
    if (LCD_COLUMNS < 9){
      lcd_center_print_timed("Adj DTDR", 0, default_display_msg_delay);
    } else {
      lcd_center_print_timed("Adj dah to dit", 0, default_display_msg_delay);  
    }        
  #endif

  while (looping) {
    myDelay(1);
    send_dit();
    send_dah();
    if (paddle_pin_read(paddle_left) == LOW) {
      adjust_dah_to_dit_ratio(10);
    }
    if (paddle_pin_read(paddle_right) == LOW) {
      adjust_dah_to_dit_ratio(-10);
    }
    while ((paddle_pin_read(paddle_left) == LOW && paddle_pin_read(paddle_right) == LOW) || (analogbuttonread(0))) { // if paddles are squeezed or button0 pressed - exit
      myDelay(1);
      looping = 0;
    }
   

    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER

  }
  while (paddle_pin_read(paddle_left) == LOW || paddle_pin_read(paddle_right) == LOW || analogbuttonread(0) ) {myDelay(1);}  // wait for all lines to go high
  dit_buffer = 0;
  dah_buffer = 0;
}
#endif //FEATURE_COMMAND_MODE

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_COMMAND_MODE
void command_weighting_adjust() {

  byte looping = 1;

  #ifdef FEATURE_DISPLAY
    if (LCD_COLUMNS < 9){
      lcd_center_print_timed("Weight", 0, default_display_msg_delay);
    } else {
      lcd_center_print_timed("Adj weighting", 0, default_display_msg_delay);
    }          
  #endif

  while (looping) {
    myDelay(1);
    send_dit();
    send_dah();
    if (paddle_pin_read(paddle_left) == LOW) {
      configuration.weighting = configuration.weighting + 1;
      if (configuration.weighting > 90){configuration.weighting = 90;}
    }
    if (paddle_pin_read(paddle_right) == LOW) {
      configuration.weighting = configuration.weighting - 1;
      if (configuration.weighting < 10){configuration.weighting = 10;}
    }
    while ((paddle_pin_read(paddle_left) == LOW && paddle_pin_read(paddle_right) == LOW) || (analogbuttonread(0))) { // if paddles are squeezed or button0 pressed - exit
      myDelay(1);
      looping = 0;
    }
   
    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER

  }
  while (paddle_pin_read(paddle_left) == LOW || paddle_pin_read(paddle_right) == LOW || analogbuttonread(0) ) {myDelay(1);}  // wait for all lines to go high
  dit_buffer = 0;
  dah_buffer = 0;
}
#endif //FEATURE_COMMAND_MODE

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_COMMAND_MODE
void command_tuning_mode() {

  byte looping = 1;
  byte latched = 0;
  
  
