K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #ifdef DEBUG_BUTTONS
      debug_serial_port->print(F("initialize_analog_button_array: "));
  #endif

  #if defined(FEATURE_DL2SBA_BANKSWITCH)
    button_array.Add(0,0);
    button_array.Add(1,3);
    button_array.Add(2,2);
    button_array.Add(3,1);
    button_array.Add(4,9);
    button_array.Add(5,8);
    button_array.Add(6,7);
    button_array.Add(7,6);
    button_array.Add(8,5);
    button_array.Add(9,4);

  #elseif defined(OPTION_DFROBOT_LCD_COMMAND_BUTTONS)
    button_array.Add(0,dfrobot_btnSELECT, dfrobot_btnLEFT_analog, dfrobot_btnSELECT_analog);
    button_array.Add(1,dfrobot_btnLEFT, dfrobot_btnDOWN_analog, dfrobot_btnLEFT_analog);
    button_array.Add(2,dfrobot_btnDOWN, dfrobot_btnUP_analog, dfrobot_btnDOWN_analog);
    button_array.Add(3,dfrobot_btnUP, dfrobot_btnRIGHT_analog, dfrobot_btnUP_analog);
    button_array.Add(4,dfrobot_btnRIGHT, 0, dfrobot_btnRIGHT_analog);
  #else //FEATURE_DL2SBA_BANKSWITCH
    button_array.AddAll();

      
  #endif //FEATURE_DL2SBA_BANKSWITCH
#endif //FEATURE_BUTTONS
}

//------------------------------------------------------------------
#ifdef FEATURE_BUTTONS
byte analogbuttonread(byte button_number) {
 
    if (button_array.Pressed(button_number)) {
      return 1;
    }
    return 0;
}
#endif

//------------------------------------------------------------------

#ifdef FEATURE_BUTTONS
void check_buttons() {


  #ifdef DEBUG_LOOP
    debug_serial_port->println(F("loop: entering check_buttons"));
  #endif

  static long last_button_action = 0;
  int analogbuttontemp = button_array.Pressed();
  long button_depress_time;
  byte paddle_was_hit = 0;
  byte previous_sidetone_mode = 0;

  if (analogbuttontemp < 0 ) { // no button pressed.
    return;
  }

  #ifdef FEATURE_MEMORIES
    repeat_memory = 255;
  #endif

  button_depress_time = button_array.last_pressed_ms;

  while (button_array.Held(analogbuttontemp, button_depress_time + 1000)) {
    myDelay(1);
    if ((paddle_pin_read(paddle_left) == LOW) || (paddle_pin_read(paddle_right) == LOW)) {
      button_depress_time = 1001;  // if button 0 is held and a paddle gets hit, assume we have a hold and shortcut out
    }
  }
  if ((millis() - button_depress_time) < 500) {  // regular button press
    #ifdef FEATURE_COMMAND_MODE
      if (analogbuttontemp == 0) {
        
        command_mode_disable_tx = !key_tx; //Added to sync the Command Mode entry state to actual key_tx state in case changed by CLI or keyboard (WD9DMP)
        key_tx = 0;
        command_mode();
        if (command_mode_disable_tx) {
          //key_tx = !store_key_tx; //Inverting pre-command mode state seems to cause Command Mode sync issues (WD9DMP)
          key_tx = 0; //Added this line to explicitly disable key_tx if command_mode_disable_tx is set after exiting Command Mode (WD9DMP)
        } else {
          key_tx = 1;
        }
        
      }
    #endif //FEATURE_COMMAND_MODE
    #ifdef FEATURE_MEMORIES
      if ((analogbuttontemp > 0) && (analogbuttontemp < (number_of_memories + 1)) && ((millis() - button_last_add_to_send_buffer_time) > 400)) {
        
        #ifdef FEATURE_WINKEY_EMULATION
          #ifndef OPTION_WINKEY_2_SUPPORT
            add_to_send_buffer(SERIAL_SEND_BUFFER_MEMORY_NUMBER);
            add_to_send_buffer(analogbuttontemp - 1);
          #else //OPTION_WINKEY_2_SUPPORT
            if ((winkey_host_open) && (wk2_mode == 2)) {   // if winkey is open and in wk2 mode, tell it about the button press
              byte winkey_byte_to_send = 0xc8;
              switch(analogbuttontemp) {
                case 1: winkey_byte_to_send = winkey_byte_to_send | 1; break;
                case 2: winkey_byte_to_send = winkey_byte_to_send | 2; break;
                case 3: winkey_byte_to_send = winkey_byte_to_send | 4; break;
                case 4: winkey_byte_to_send = winkey_byte_to_send | 16; break;            
              } 
              winkey_port_write(winkey_byte_to_send,0);
              winkey_port_write(0xc8,0); // tell it that the button is unpressed
            } else {  // otherwise, have the buttons act as normal
              add_to_send_buffer(SERIAL_SEND_BUFFER_MEMORY_NUMBER);
              add_to_send_buffer(analogbuttontemp - 1);
            }  
          #endif //OPTION_WINKEY_2_SUPPORT
        #else //FEATURE_WINKEY_EMULATION
          add_to_send_buffer(SERIAL_SEND_BUFFER_MEMORY_NUMBER);
          add_to_send_buffer(analogbuttontemp - 1);
        #endif //FEATURE_WINKEY_EMULATION

        button_last_add_to_send_buffer_time = millis();
        #ifdef DEBUG_BUTTONS
        debug_serial_port->print(F("\ncheck_buttons: add_to_send_buffer: "));
        debug_serial_port->println(analogbuttontemp - 1);
        #endif //DEBUG_BUTTONS
      }
    #endif //ifdef FEATURE_MEMORIES

  } else { //if ((millis() - button_depress_time) < 500)   -- Button hold down

      if (analogbuttontemp == 0) {
        key_tx = 0;
        // do stuff if this is a command button hold down
        while (button_array.Held(analogbuttontemp)) {
          myDelay(1);
          if (paddle_pin_read(paddle_left) == LOW) { 
 	          #ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
              speed_change(-1);                                           // left paddle decrease speed
	          #else
	            speed_change(1);                                            // left paddle increase speed
	          #endif                                                        // OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
            previous_sidetone_mode = configuration.sidetone_mode;
            configuration.sidetone_mode = SIDETONE_ON; 
            sending_mode = MANUAL_SENDING;
            send_dit();
            configuration.sidetone_mode = previous_sidetone_mode;
            //speed_button_cmd_executed = 1;
            dit_buffer = 0;
            
            #ifdef DEBUG_BUTTONS
	            #ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
		            debug_serial_port->println(F("\ncheck_buttons: speed_change(-1)"));
 	            #else
		            debug_serial_port->println(F("\ncheck_buttons: speed_change(1)"));
	            #endif                                                 // OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION                                                      
            #endif                                                   // DEBUG_BUTTONS            

            #if defined(FEATURE_WINKEY_EMULATION) && defined(FEATURE_POTENTIOMETER)
              if ((primary_serial_port_mode == SERIAL_WINKEY_EMULATION) && (winkey_host_open)) {
                winkey_port_write(((configuration.wpm-pot_wpm_low_value)|128),0);
                winkey_last_unbuffered_speed_wpm = configuration.wpm;
              }
            #endif

