K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
          }
          if (paddle_pin_read(paddle_right) == LOW) {
 	          #ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
              speed_change(1);                                           // right paddle increase speed
	          #else
	            speed_change(-1);                                          // right paddle decrease speed
	          #endif                                                       
            previous_sidetone_mode = configuration.sidetone_mode;
            configuration.sidetone_mode = SIDETONE_ON; 
            sending_mode = MANUAL_SENDING;
            send_dah();
            configuration.sidetone_mode = previous_sidetone_mode;              
            dah_buffer = 0;

            #ifdef DEBUG_BUTTONS
	            #ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
                debug_serial_port->println(F("\ncheck_buttons: speed_change(1)"));
	            #else
                debug_serial_port->println(F("\ncheck_buttons: speed_change(-1)"));
              #endif                                // OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
            #endif                                  // DEBUG_BUTTONS            

            #if defined(FEATURE_WINKEY_EMULATION) && defined(FEATURE_POTENTIOMETER)
              if ((primary_serial_port_mode == SERIAL_WINKEY_EMULATION) && (winkey_host_open)) {
                winkey_port_write(((configuration.wpm-pot_wpm_low_value)|128),0);
                winkey_last_unbuffered_speed_wpm = configuration.wpm;
              }
            #endif
          } //if (paddle_pin_read(paddle_right) == LOW) {
        }
        key_tx = 1;
      }  // (analogbuttontemp == 0)
      if ((analogbuttontemp > 0) && (analogbuttontemp < analog_buttons_number_of_buttons)) {
        while (button_array.Held(analogbuttontemp)) {
          myDelay(1);
          if (((paddle_pin_read(paddle_left) == LOW) || (paddle_pin_read(paddle_right) == LOW)) && (analogbuttontemp < (number_of_memories + 1))){
            #ifdef FEATURE_MEMORIES
              repeat_memory = analogbuttontemp - 1;
              last_memory_repeat_time = 0;
              #ifdef DEBUG_BUTTONS
                debug_serial_port->print(F("\ncheck_buttons: repeat_memory:"));
                debug_serial_port->println(repeat_memory);
              #endif //DEBUG_BUTTONS                    
            #endif
            paddle_was_hit = 1;
          }
        }  //while (button_array.Held(analogbuttontemp)) {

        if (!paddle_was_hit) {  // if no paddle was hit, this was a button hold to change transmitters
            key_tx = 0;
            previous_sidetone_mode = configuration.sidetone_mode;
            configuration.sidetone_mode = SIDETONE_ON;
            switch_to_tx(analogbuttontemp);
            key_tx = 1;
            configuration.sidetone_mode = previous_sidetone_mode;
        }
      } //if ((analogbuttontemp > 0) && (analogbuttontemp < analog_buttons_number_of_buttons)) {
    //}                                  // button hold
  }
  last_button_action = millis();
  
  #ifdef FEATURE_SLEEP
    last_activity_time = millis(); 
  #endif //FEATURE_SLEEP
  #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
    last_active_time = millis(); 
  #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM
  
}
#endif                                    // FEATURE_BUTTONS

//-------------------------------------------------------------------------------------------------------

void service_dit_dah_buffers()
{
  #ifdef DEBUG_LOOP
    debug_serial_port->println(F("loop: entering service_dit_dah_buffers"));
  #endif      

  if (keyer_machine_mode == BEACON){return;}

  if (automatic_sending_interruption_time != 0){
    if ((millis() - automatic_sending_interruption_time) > (configuration.paddle_interruption_quiet_time_element_lengths*(1200/configuration.wpm))){
      automatic_sending_interruption_time = 0;
      sending_mode = MANUAL_SENDING;
    } else {
      dit_buffer = 0;
      dah_buffer = 0;
      return;        
    }
  }

  static byte bug_dah_flag = 0;

  #ifdef FEATURE_PADDLE_ECHO
    static unsigned long bug_dah_key_down_time = 0;
  #endif //FEATURE_PADDLE_ECHO

      
  if ((configuration.keyer_mode == IAMBIC_A) || (configuration.keyer_mode == IAMBIC_B) || (configuration.keyer_mode == ULTIMATIC) || (configuration.keyer_mode == SINGLE_PADDLE)) {
    if ((configuration.keyer_mode == IAMBIC_A) && (iambic_flag) && (paddle_pin_read(paddle_left)) && (paddle_pin_read(paddle_right))) {
      iambic_flag = 0;
      dit_buffer = 0;
      dah_buffer = 0;
    } else {
      if (dit_buffer) {
        dit_buffer = 0;
        sending_mode = MANUAL_SENDING;
        send_dit();
      }
      if (dah_buffer) {
        dah_buffer = 0;
        sending_mode = MANUAL_SENDING;
        send_dah();
      }
    }
  } else {
    if (configuration.keyer_mode == BUG) {
      if (dit_buffer) {
        dit_buffer = 0;
        sending_mode = MANUAL_SENDING;
        send_dit();
      }

      if (dah_buffer) {
        dah_buffer = 0;
        if (!bug_dah_flag) {
          sending_mode = MANUAL_SENDING;
          tx_and_sidetone_key(1);
          bug_dah_flag = 1; 
          #ifdef FEATURE_PADDLE_ECHO
            bug_dah_key_down_time = millis();
          #endif //FEATURE_PADDLE_ECHO
        }   



      } else {
        if (bug_dah_flag){
          sending_mode = MANUAL_SENDING;
          tx_and_sidetone_key(0);
          #ifdef FEATURE_PADDLE_ECHO
            if ((millis() - bug_dah_key_down_time) > (0.5 * (1200.0/configuration.wpm))){
              if ((millis() - bug_dah_key_down_time) > (2 * (1200.0/configuration.wpm))){
                paddle_echo_buffer = (paddle_echo_buffer * 10) + 2;
              } else {
                paddle_echo_buffer = (paddle_echo_buffer * 10) + 1;
              }
              paddle_echo_buffer_decode_time = millis() + (((float)3000.0/(float)configuration.wpm) * ((float)configuration.cw_echo_timing_factor/(float)100));
            }
          #endif //FEATURE_PADDLE_ECHO            
          bug_dah_flag = 0;
        }
      }
      #ifdef FEATURE_DEAD_OP_WATCHDOG
        dah_counter = 0;
      #endif
    } else {
      if (configuration.keyer_mode == STRAIGHT) {
        if (dit_buffer) {
          dit_buffer = 0;
          sending_mode = MANUAL_SENDING;
          tx_and_sidetone_key(1);
        } else {
          sending_mode = MANUAL_SENDING;
          tx_and_sidetone_key(0);
        }
        #ifdef FEATURE_DEAD_OP_WATCHDOG
          dit_counter = 0;
        #endif
      }
    }
  }

