K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
}

//-------------------------------------------------------------------------------------------------------

void beep()
{
  // #if defined(FEATURE_SINEWAVE_SIDETONE)
  //   tone(sidetone_line, hz_high_beep);
  //   myDelay(200);
  //   noTone(sidetone_line);
  // #else
  s_tone(sidetone_line, hz_high_beep, 200);
}

//-------------------------------------------------------------------------------------------------------

void boop()
{
  s_tone(sidetone_line,hz_low_beep,200);   // generate a tone on the speaker pin
}

//-------------------------------------------------------------------------------------------------------

void beep_boop()
{
  s_tone(sidetone_line,hz_high_beep,300);  // generate a tone on the speaker pin
  myDelay(200);
  s_tone(sidetone_line,hz_low_beep,200);   // generate a tone on the speaker pin
}

//-------------------------------------------------------------------------------------------------------

void boop_beep()
{
  s_tone(sidetone_line,hz_low_beep,200);   // generate a tone on the speaker pin
  myDelay(200);
  s_tone(sidetone_line,hz_high_beep,300);  // generate a tone on the speaker pin
}

//-------------------------------------------------------------------------------------------------------
void send_the_dits_and_dahs(char const * cw_to_send){


  /* American Morse - Special Symbols
    ~  long dah (4 units)
    =  very long dah (5 units)
    &  an extra space (1 unit)
  */ 

  //debug_serial_port->println(F("send_the_dits_and_dahs()"));

  sending_mode = AUTOMATIC_SENDING;

  #if defined(FEATURE_SERIAL) && !defined(OPTION_DISABLE_SERIAL_PORT_CHECKING_WHILE_SENDING_CW)
    dump_current_character_flag = 0;
  #endif  

  #if defined(FEATURE_FARNSWORTH)
    //float additional_intercharacter_time_ms;
  #endif

  for (int x = 0;x < 12;x++){
    switch(cw_to_send[x]){
      case '.': send_dit(); break;
      case '-': send_dah(); break;
      #if defined(FEATURE_AMERICAN_MORSE)  // this is a bit of a hack, but who cares!  :-)
      case '~': 

        being_sent = SENDING_DAH;
        tx_and_sidetone_key(1);
        if ((tx_key_dah) && (key_tx)) {digitalWrite(tx_key_dah,tx_key_dit_and_dah_pins_active_state);}
        loop_element_lengths((float(4.0)*(float(configuration.weighting)/50)),configuration.keying_compensation,configuration.wpm);
        if ((tx_key_dah) && (key_tx)) {digitalWrite(tx_key_dah,tx_key_dit_and_dah_pins_inactive_state);}
        tx_and_sidetone_key(0);
        loop_element_lengths((4.0-(3.0*(float(configuration.weighting)/50))),(-1.0*configuration.keying_compensation),configuration.wpm);
        break;

      case '=': 
        being_sent = SENDING_DAH;
        tx_and_sidetone_key(1);
        if ((tx_key_dah) && (key_tx)) {digitalWrite(tx_key_dah,tx_key_dit_and_dah_pins_active_state);}
        loop_element_lengths((float(5.0)*(float(configuration.weighting)/50)),configuration.keying_compensation,configuration.wpm);
        if ((tx_key_dah) && (key_tx)) {digitalWrite(tx_key_dah,tx_key_dit_and_dah_pins_inactive_state);}
        tx_and_sidetone_key(0);
        loop_element_lengths((4.0-(3.0*(float(configuration.weighting)/50))),(-1.0*configuration.keying_compensation),configuration.wpm);
        break;

      case '&': 
        loop_element_lengths((4.0-(3.0*(float(configuration.weighting)/50))),(-1.0*configuration.keying_compensation),configuration.wpm);
        break;            
      #endif //FEATURE_AMERICAN_MORSE
      default: 
        //return; 
        x = 12;
        break;
    }

    if ((dit_buffer || dah_buffer || sending_mode == AUTOMATIC_SENDING_INTERRUPTED) && (keyer_machine_mode != BEACON)){
      dit_buffer = 0;
      dah_buffer = 0;
      //debug_serial_port->println(F("send_the_dits_and_dahs: AUTOMATIC_SENDING_INTERRUPTED"));
      //return;
      x = 12;
    }
    #if defined(FEATURE_SERIAL)
      check_serial();
      #if !defined(OPTION_DISABLE_SERIAL_PORT_CHECKING_WHILE_SENDING_CW)
        if (dump_current_character_flag){
          x = 12;
        }
      #endif
    #endif

    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER

  }  // for (int x = 0;x < 12;x++)


}

//-------------------------------------------------------------------------------------------------------

void send_char(byte cw_char, byte omit_letterspace)
{
  #ifdef DEBUG_SEND_CHAR
    debug_serial_port->print(F("send_char: called with cw_char:"));
    debug_serial_port->print((byte)cw_char);
    if (omit_letterspace) {
      debug_serial_port->print(F(" OMIT_LETTERSPACE"));
    }
    debug_serial_port->println();
  #endif


  #ifdef FEATURE_SLEEP
    last_activity_time = millis(); 
  #endif //FEATURE_SLEEP
  #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
    last_active_time = millis(); 
  #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

  if ((cw_char == 10) || (cw_char == 13)) { return; }  // don't attempt to send carriage return or line feed

  sending_mode = AUTOMATIC_SENDING;

  if (char_send_mode == CW) {
    switch (cw_char) {
      case 'A': send_the_dits_and_dahs(".-");   break;
      case 'B': send_the_dits_and_dahs("-..."); break;
      case 'C': send_the_dits_and_dahs("-.-."); break;
      case 'D': send_the_dits_and_dahs("-..");  break;
      case 'E': send_the_dits_and_dahs(".");    break;
      case 'F': send_the_dits_and_dahs("..-."); break;
      case 'G': send_the_dits_and_dahs("--.");  break;
      case 'H': send_the_dits_and_dahs("...."); break;
      case 'I': send_the_dits_and_dahs("..");   break;
      case 'J': send_the_dits_and_dahs(".---"); break;
      case 'K': send_the_dits_and_dahs("-.-");  break;
      case 'L': send_the_dits_and_dahs(".-.."); break;
      case 'M': send_the_dits_and_dahs("--");   break;
      case 'N': send_the_dits_and_dahs("-.");   break;
      case 'O': send_the_dits_and_dahs("---");  break;
      case 'P': send_the_dits_and_dahs(".--."); break;
      case 'Q': send_the_dits_and_dahs("--.-"); break;
      case 'R': send_the_dits_and_dahs(".-.");  break;
      case 'S': send_the_dits_and_dahs("...");  break;
      case 'T': send_the_dits_and_dahs("-");    break;
      case 'U': send_the_dits_and_dahs("..-");  break;
      case 'V': send_the_dits_and_dahs("...-"); break;
      case 'W': send_the_dits_and_dahs(".--");  break;
      case 'X': send_the_dits_and_dahs("-..-"); break;
      case 'Y': send_the_dits_and_dahs("-.--"); break;
      case 'Z': send_the_dits_and_dahs("--.."); break;

