K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      #if defined(OPTION_DO_NOT_SEND_UNKNOWN_CHAR_QUESTION)
        case '?': send_the_dits_and_dahs("..--..");break;
      #endif

      default: 
        #if !defined(OPTION_DO_NOT_SEND_UNKNOWN_CHAR_QUESTION)
          send_the_dits_and_dahs("..--..");
        #endif
        break;
      
    }
    if (omit_letterspace != OMIT_LETTERSPACE) {

      loop_element_lengths((length_letterspace-1),0,configuration.wpm); //this is minus one because send_dit and send_dah have a trailing element space

    }

    #ifdef FEATURE_FARNSWORTH  
    // Farnsworth Timing : http://www.arrl.org/files/file/Technology/x9004008.pdf
     if (configuration.wpm_farnsworth > configuration.wpm){
       float additional_intercharacter_time_ms = ((( (1.0 * farnsworth_timing_calibration) * ((60.0 * float(configuration.wpm_farnsworth) ) - (37.2 * float(configuration.wpm) ))/( float(configuration.wpm) * float(configuration.wpm_farnsworth) ))/19.0)*1000.0) - (1200.0/ float(configuration.wpm_farnsworth) );
       loop_element_lengths(1,additional_intercharacter_time_ms,0);}
    #endif  

  } else {
    if (char_send_mode == HELL){
      #ifdef FEATURE_HELL
        transmit_hell_char(cw_char);
      #endif
    } else {
      if (char_send_mode == AMERICAN_MORSE){
        #ifdef FEATURE_AMERICAN_MORSE

          /* 

            ~  long dah (4 units)
    
            =  very long dah (5 units)
      
            &  an extra space (1 unit)

          */ 


          switch (cw_char){   // THIS SECTION IS AMERICAN MORSE CODE - DO NOT TOUCH IT !

            case 'A': send_the_dits_and_dahs(".-");break;
            case 'B': send_the_dits_and_dahs("-...");break;
            case 'C': send_the_dits_and_dahs("..&.");break;
            case 'D': send_the_dits_and_dahs("-..");break;
            case 'E': send_the_dits_and_dahs(".");break;
            case 'F': send_the_dits_and_dahs(".-.");break;
            case 'G': send_the_dits_and_dahs("--.");break;
            case 'H': send_the_dits_and_dahs("....");break;
            case 'I': send_the_dits_and_dahs("..");break;
            case 'J': send_the_dits_and_dahs("-.-.");break;
            case 'K': send_the_dits_and_dahs("-.-");break;
            case 'L': send_the_dits_and_dahs("~");break;
            case 'M': send_the_dits_and_dahs("--");break;
            case 'N': send_the_dits_and_dahs("-.");break;
            case 'O': send_the_dits_and_dahs(".&.");break;
            case 'P': send_the_dits_and_dahs(".....");break;
            case 'Q': send_the_dits_and_dahs("..-.");break;
            case 'R': send_the_dits_and_dahs(".&..");break;
            case 'S': send_the_dits_and_dahs("...");break;
            case 'T': send_the_dits_and_dahs("-");break;
            case 'U': send_the_dits_and_dahs("..-");break;
            case 'V': send_the_dits_and_dahs("...-");break;
            case 'W': send_the_dits_and_dahs(".--");break;
            case 'X': send_the_dits_and_dahs(".-..");break;
            case 'Y': send_the_dits_and_dahs("..&..");break;
            case 'Z': send_the_dits_and_dahs("...&.");break;

            // THIS SECTION IS AMERICAN MORSE CODE - DO NOT TOUCH IT !

            case '&': send_the_dits_and_dahs(".&...");break;

            case '0': send_the_dits_and_dahs("=");break;
            case '1': send_the_dits_and_dahs(".---.");break;
            case '2': send_the_dits_and_dahs("..--..");break;
            case '3': send_the_dits_and_dahs("...-.");break;
            case '4': send_the_dits_and_dahs("....-");break;
            case '5': send_the_dits_and_dahs("---");break;
            case '6': send_the_dits_and_dahs("......");break;
            case '7': send_the_dits_and_dahs("--..");break;
            case '8': send_the_dits_and_dahs("-....");break;
            case '9': send_the_dits_and_dahs("-..-");break;   
 
            // THIS SECTION IS AMERICAN MORSE CODE - DO NOT TOUCH IT !

            case ',': send_the_dits_and_dahs(".-.-");break;  
            case '.': send_the_dits_and_dahs("..--..");break;
            case '?': send_the_dits_and_dahs("-..-.");break;  
            case '!': send_the_dits_and_dahs("---.");break;  
            case ':': send_the_dits_and_dahs("-.-&.&.");break;    
            case ';': send_the_dits_and_dahs("...&..");break;   
            case '-': send_the_dits_and_dahs("....&.-..");break;    

          }  //switch (cw_char)
        
        #endif      
      } 
    }
  }

}

//-------------------------------------------------------------------------------------------------------

int uppercase (int charbytein)
{
  if (((charbytein > 96) && (charbytein < 123)) || ((charbytein > 223) && (charbytein < 255))) {
    charbytein = charbytein - 32;
  }
  if (charbytein == 158) { charbytein = 142; }  // ž -> Ž
  if (charbytein == 154) { charbytein = 138; }  // š -> Š
  
  return charbytein;
}

//-------------------------------------------------------------------------------------------------------
#if defined(FEATURE_SERIAL)
#ifdef FEATURE_COMMAND_LINE_INTERFACE
void serial_qrss_mode()
{
  byte looping = 1;
  byte incoming_serial_byte;
  byte numbers[4];
  byte numberindex = 0;
  String numberstring;
  byte error =0;

  while (looping) {
    myDelay(1);
    if (primary_serial_port->available() == 0) {        // wait for the next keystroke
      if (keyer_machine_mode == KEYER_NORMAL) {          // might as well do something while we're waiting
        check_paddles();
        service_dit_dah_buffers();
        //check_the_memory_buttons();
      }
    } else {

      incoming_serial_byte = primary_serial_port->read();
      if ((incoming_serial_byte > 47) && (incoming_serial_byte < 58)) {    // ascii 48-57 = "0" - "9")
        numberstring = numberstring + incoming_serial_byte;
        numbers[numberindex] = incoming_serial_byte;
//        primary_serial_port->write("numberindex:");
//        primary_serial_port->print(numberindex,DEC);
//        primary_serial_port->write("     numbers:");
//        primary_serial_port->println(numbers[numberindex],DEC);
        numberindex++;
        if (numberindex > 2)
          {
            looping = 0;
            error = 1;
          }
      } else {
        if (incoming_serial_byte == 13) {   // carriage return - get out
          looping = 0;
        } else {                 // bogus input - error out
          looping = 0;
          error = 1;
        }
      }
    }
  }

  if (error) {
    primary_serial_port->println(F("Error..."));
    while (primary_serial_port->available() > 0) { 
      myDelay(1);
      incoming_serial_byte = primary_serial_port->read(); 
    }  // clear out buffer
    return;
  } else {
    primary_serial_port->print(F("Setting keyer to QRSS Mode. Dit length: "));
    primary_serial_port->print(numberstring);
    primary_serial_port->println(F(" seconds"));
    int y = 1;
    int set_dit_length = 0;
    for (int x = (numberindex - 1); x >= 0 ; x = x - 1) {
      set_dit_length = set_dit_length + ((numbers[x]-48) * y);
      y = y * 10;
    }
    qrss_dit_length = set_dit_length;
    speed_mode = SPEED_QRSS;
  }

