K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
}
#endif
#endif
//-------------------------------------------------------------------------------------------------------

void service_send_buffer(byte no_print)
{
  // send one character out of the send buffer

  #ifdef DEBUG_LOOP
    debug_serial_port->println(F("loop: entering service_send_buffer"));
  #endif       

  static unsigned long timed_command_end_time;
  static byte timed_command_in_progress = 0;

  #if defined(DEBUG_SERVICE_SEND_BUFFER)

    byte no_bytes_flag = 0;

    if (send_buffer_bytes > 0){
      debug_serial_port->print(F("service_send_buffer: enter:"));
      for (int x = 0;x < send_buffer_bytes;x++){
        debug_serial_port->write(send_buffer_array[x]);
        debug_serial_port->print(F("["));
        debug_serial_port->print(send_buffer_array[x]);
        debug_serial_port->print(F("]"));
      }
      debug_serial_port->println();        
    } else {
      no_bytes_flag = 1;
    }
    Serial.flush();
  #endif


  if (service_tx_inhibit_and_pause() == 1){
    #if defined(DEBUG_SERVICE_SEND_BUFFER)
      debug_serial_port->println(F("service_send_buffer: tx_inhib"));
    #endif
    return;
    
  }


  #ifdef FEATURE_MEMORIES
    play_memory_prempt = 0;
  #endif


  if (send_buffer_status == SERIAL_SEND_BUFFER_NORMAL) {
    if ((send_buffer_bytes) && (pause_sending_buffer == 0)) {
      #ifdef FEATURE_SLEEP
        last_activity_time = millis(); 
      #endif //FEATURE_SLEEP
      #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
        last_active_time = millis(); 
      #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

      if ((send_buffer_array[0] > SERIAL_SEND_BUFFER_SPECIAL_START) && (send_buffer_array[0] < SERIAL_SEND_BUFFER_SPECIAL_END)) {

        #if defined(DEBUG_SERVICE_SEND_BUFFER)
          debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_SPECIAL"));
        #endif


        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_HOLD_SEND) {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_HOLD_SEND"));
          #endif

          send_buffer_status = SERIAL_SEND_BUFFER_HOLD;
          remove_from_send_buffer();
        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE) {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE"));
          #endif

          remove_from_send_buffer();
        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_MEMORY_NUMBER) {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_MEMORY_NUMBER"));
          #endif

          #ifdef DEBUG_SEND_BUFFER
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_MEMORY_NUMBER"));
          #endif
          #ifdef FEATURE_WINKEY_EMULATION
            if (winkey_sending && winkey_host_open) {
              #if !defined(OPTION_WINKEY_UCXLOG_SUPRESS_C4_STATUS_BYTE)
                winkey_port_write(0xc0|winkey_sending|winkey_xoff,0);
              #endif
              winkey_interrupted = 1;
             }
          #endif
          remove_from_send_buffer();
          if (send_buffer_bytes) {
            if (send_buffer_array[0] < number_of_memories) {
              #ifdef FEATURE_MEMORIES
                play_memory(send_buffer_array[0]);
              #endif
            }
            remove_from_send_buffer();
          }
        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_WPM_CHANGE) {  // two bytes for wpm
          //remove_from_send_buffer();
          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_WPM_CHANGE"));
          #endif
          if (send_buffer_bytes > 2) {
            #if defined(DEBUG_SERVICE_SEND_BUFFER)
              debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_WPM_CHANGE: send_buffer_bytes>2"));
            #endif
            remove_from_send_buffer();
            #ifdef FEATURE_WINKEY_EMULATION
              if ((winkey_host_open) && (winkey_speed_state == WINKEY_UNBUFFERED_SPEED)){
                winkey_speed_state = WINKEY_BUFFERED_SPEED;
                #if defined(DEBUG_SERVICE_SEND_BUFFER)
                  debug_serial_port->println(F("service_send_buffer: winkey_speed_state = WINKEY_BUFFERED_SPEED"));
                #endif
                winkey_last_unbuffered_speed_wpm = configuration.wpm;
              }
            #endif
            configuration.wpm = send_buffer_array[0] * 256;
            remove_from_send_buffer();
            configuration.wpm = configuration.wpm + send_buffer_array[0];
            remove_from_send_buffer();
            config_dirty = 1;
            
            #ifdef FEATURE_LED_RING
              update_led_ring();
            #endif //FEATURE_LED_RING            
            
          } else {
            #if defined(DEBUG_SERVICE_SEND_BUFFER)
              debug_serial_port->println(F("service_send_buffer:SERIAL_SEND_BUFFER_WPM_CHANGE < 2"));
            #endif
          }

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->print(F("service_send_buffer: SERIAL_SEND_BUFFER_WPM_CHANGE: exit send_buffer_bytes:"));
            debug_serial_port->println(send_buffer_bytes);
          #endif

        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_TX_CHANGE) {  // one byte for transmitter #


          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_TX_CHANGE"));
          #endif

          remove_from_send_buffer();
          if (send_buffer_bytes > 1) {
            // if ((send_buffer_array[0] > 0) && (send_buffer_array[0] < 7)){
            //   switch_to_tx_silent(send_buffer_array[0]);
            // }
            #ifdef FEATURE_SO2R_BASE
              if ((send_buffer_array[0] > 0) && (send_buffer_array[0] < 3)){
                if (ptt_line_activated) {
                  so2r_pending_tx = send_buffer_array[0];
                }
                else {
                  so2r_tx = send_buffer_array[0];
                  so2r_set_tx();
                }
              }
            #else
              if ((send_buffer_array[0] > 0) && (send_buffer_array[0] < 7)){
                switch_to_tx_silent(send_buffer_array[0]);
              }
            #endif //FEATURE_SO2R_BASE

            remove_from_send_buffer();          
          }
        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_NULL) {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_NULL"));
          #endif

          remove_from_send_buffer();
        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_PROSIGN) {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_PROSIGN"));
          #endif

          remove_from_send_buffer();
          if (send_buffer_bytes) {
            send_char(send_buffer_array[0],OMIT_LETTERSPACE);
            #ifdef FEATURE_WINKEY_EMULATION
              if (winkey_host_open){
                // Must echo back PROSIGN characters sent  N6TV
                winkey_port_write(0xc4|winkey_sending|winkey_xoff,0);  // N6TV
                winkey_port_write(send_buffer_array[0],0);  // N6TV  
              }          
            #endif //FEATURE_WINKEY_EMULATION
            remove_from_send_buffer();
          }
          if (send_buffer_bytes) {
            send_char(send_buffer_array[0],KEYER_NORMAL);
            #ifdef FEATURE_WINKEY_EMULATION
              if (winkey_host_open){
                // Must echo back PROSIGN characters sent  N6TV
                winkey_port_write(0xc4|winkey_sending|winkey_xoff,0);  // N6TV
                winkey_port_write(send_buffer_array[0],0);  // N6TV  
              }          
            #endif //FEATURE_WINKEY_EMULATION
            remove_from_send_buffer();
          }
        }

