K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_TIMED_KEY_DOWN) {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_TIMED_KEY_DOWN"));
          #endif

          remove_from_send_buffer();
          if (send_buffer_bytes) {
            send_buffer_status = SERIAL_SEND_BUFFER_TIMED_COMMAND;
            sending_mode = AUTOMATIC_SENDING;
            tx_and_sidetone_key(1);
            timed_command_end_time = millis() + (send_buffer_array[0] * 1000);
            timed_command_in_progress = SERIAL_SEND_BUFFER_TIMED_KEY_DOWN;
            remove_from_send_buffer();
          }
        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_TIMED_WAIT) {


          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_TIMED_WAIT"));
          #endif

          remove_from_send_buffer();
          if (send_buffer_bytes) {
            send_buffer_status = SERIAL_SEND_BUFFER_TIMED_COMMAND;
            timed_command_end_time = millis() + (send_buffer_array[0] * 1000);
            timed_command_in_progress = SERIAL_SEND_BUFFER_TIMED_WAIT;
            remove_from_send_buffer();
          }
        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_PTT_ON) {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_PTT_ON"));
          #endif

          remove_from_send_buffer();
          manual_ptt_invoke = 1;
          ptt_key();
        }

        if (send_buffer_array[0] == SERIAL_SEND_BUFFER_PTT_OFF) {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_PTT_OFF"));
          #endif

          remove_from_send_buffer();
          manual_ptt_invoke = 0;
          ptt_unkey();
        }

      } else {   // if ((send_buffer_array[0] > SERIAL_SEND_BUFFER_SPECIAL_START) && (send_buffer_array[0] < SERIAL_SEND_BUFFER_SPECIAL_END))

        // #ifdef FEATURE_WINKEY_EMULATION
        //   if ((primary_serial_port_mode == SERIAL_WINKEY_EMULATION) && (winkey_serial_echo) && (winkey_host_open) && (!no_print) && (!cw_send_echo_inhibit)){
        //     #if defined(OPTION_WINKEY_ECHO_7C_BYTE)
        //       if (send_buffer_array[0] > 30) {winkey_port_write(send_buffer_array[0],0);}
        //     #else
        //       if ((send_buffer_array[0]!= 0x7C) && (send_buffer_array[0] > 30)) {winkey_port_write(send_buffer_array[0],0);}
        //     #endif
        //   }
        // #endif //FEATURE_WINKEY_EMULATION


        #if defined(FEATURE_COMMAND_LINE_INTERFACE)
          if ((!no_print) && (!cw_send_echo_inhibit)){
            if (primary_serial_port_mode == SERIAL_CLI) {primary_serial_port->write(send_buffer_array[0]);};
            #ifdef FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT
              secondary_serial_port->write(send_buffer_array[0]);
            #endif //FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT
            if (send_buffer_array[0] == 13) {
              if (primary_serial_port_mode == SERIAL_CLI) {primary_serial_port->write(10);}  // if we got a carriage return, also send a line feed
              #ifdef FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT
                secondary_serial_port->write(10);
              #endif //FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT              
            }
          }
        #endif //FEATURE_COMMAND_LINE_INTERFACE

        #ifdef FEATURE_DISPLAY
          if (lcd_send_echo) {
            display_scroll_print_char(send_buffer_array[0]);
            service_display();
          }
        #endif //FEATURE_DISPLAY

        #if defined(DEBUG_SERVICE_SEND_BUFFER)
          debug_serial_port->print(F("service_send_buffer: send_char:"));
          debug_serial_port->write(send_buffer_array[0]);
          debug_serial_port->println();
          Serial.flush();
        #endif

        send_char(send_buffer_array[0],KEYER_NORMAL);  //****************

        #ifdef FEATURE_WINKEY_EMULATION
          if ((primary_serial_port_mode == SERIAL_WINKEY_EMULATION) && (winkey_serial_echo) && (winkey_host_open) && (!no_print) && (!cw_send_echo_inhibit)){
            #if defined(OPTION_WINKEY_ECHO_7C_BYTE)
              if (send_buffer_array[0] > 30) {winkey_port_write(send_buffer_array[0],0);}
            #else
              if ((send_buffer_array[0]!= 0x7C) && (send_buffer_array[0] > 30)) {winkey_port_write(send_buffer_array[0],0);}
            #endif
          }
        #endif //FEATURE_WINKEY_EMULATION

        if (!pause_sending_buffer){

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: after send_char: remove_from_send_buffer"));
            if (no_bytes_flag){
              debug_serial_port->println(F("service_send_buffer: no_bytes_flag"));
            }
            Serial.flush();
          #endif

          if (!((send_buffer_array[0] > SERIAL_SEND_BUFFER_SPECIAL_START) && (send_buffer_array[0] < SERIAL_SEND_BUFFER_SPECIAL_END))){ // this is a friggin hack to fix something I can't explain with SO2R - Goody 20191217
            remove_from_send_buffer();

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: after send_char: remove_from_send_buffer"));
            if (no_bytes_flag){
              debug_serial_port->println(F("service_send_buffer: no_bytes_flag"));
            }
            Serial.flush();
          #endif


          } else {

          #if defined(DEBUG_SERVICE_SEND_BUFFER)
            debug_serial_port->println(F("service_send_buffer: snagged errant remove_from_send_buffer"));
            Serial.flush();
          #endif
          }

        }
      }
    }  //if ((send_buffer_bytes) && (pause_sending_buffer == 0))

  } else {   //if (send_buffer_status == SERIAL_SEND_BUFFER_NORMAL)

    if (send_buffer_status == SERIAL_SEND_BUFFER_TIMED_COMMAND) {    // we're in a timed command

