K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      if ((timed_command_in_progress == SERIAL_SEND_BUFFER_TIMED_KEY_DOWN) && (millis() > timed_command_end_time)) {
        sending_mode = AUTOMATIC_SENDING;
        tx_and_sidetone_key(0);
        timed_command_in_progress = 0;
        send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;

        #if defined(DEBUG_SERVICE_SEND_BUFFER)
          debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_TIMED_KEY_DOWN->SERIAL_SEND_BUFFER_NORMAL"));
        #endif

      }

      if ((timed_command_in_progress == SERIAL_SEND_BUFFER_TIMED_WAIT) && (millis() > timed_command_end_time)) {
        timed_command_in_progress = 0;
        send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;

        #if defined(DEBUG_SERVICE_SEND_BUFFER)
          debug_serial_port->println(F("service_send_buffer: SERIAL_SEND_BUFFER_TIMED_WAIT->SERIAL_SEND_BUFFER_NORMAL"));
        #endif

      }

    }

    if (send_buffer_status == SERIAL_SEND_BUFFER_HOLD) {  // we're in a send hold ; see if there's a SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE in the buffer
      if (send_buffer_bytes == 0) {
        send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;  // this should never happen, but what the hell, we'll catch it here if it ever does happen
      } else {
        for (int z = 0; z < send_buffer_bytes; z++) {
          if (send_buffer_array[z] ==  SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE) {
            send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;
            z = send_buffer_bytes;
          }
        }
      }
    }

  }  //if (send_buffer_status == SERIAL_SEND_BUFFER_NORMAL)

  //if the paddles are hit, dump the buffer
  check_paddles();
  if (((dit_buffer || dah_buffer) && (send_buffer_bytes)) && (keyer_machine_mode != BEACON)) {

    #if defined(DEBUG_SERVICE_SEND_BUFFER)
      debug_serial_port->println(F("service_send_buffer: buffer dump"));
    #endif

    clear_send_buffer();
    send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;
    dit_buffer = 0;
    dah_buffer = 0;    
    #ifdef FEATURE_MEMORIES
      repeat_memory = 255;
    #endif
    #ifdef FEATURE_WINKEY_EMULATION
      if (winkey_sending && winkey_host_open) {
        winkey_port_write(0xc2|winkey_sending|winkey_xoff,0); // 0xc2 - BREAKIN bit set high
        winkey_interrupted = 1;
      }
    #endif
  }

}

//-------------------------------------------------------------------------------------------------------
void clear_send_buffer()
{
  #ifdef FEATURE_WINKEY_EMULATION
    winkey_xoff=0;
  #endif 
  send_buffer_bytes = 0;
}

//-------------------------------------------------------------------------------------------------------
void remove_from_send_buffer()
{
  
  #ifdef FEATURE_WINKEY_EMULATION
    if ((send_buffer_bytes < winkey_xon_threshold) && winkey_xoff && winkey_host_open) {
      winkey_xoff=0;
      winkey_port_write(0xc0|winkey_sending|winkey_xoff,0); //send status /XOFF
    }
  #endif
  
  if (send_buffer_bytes) {
    send_buffer_bytes--;
  }
  if (send_buffer_bytes) {
    for (int x = 0;x < send_buffer_bytes;x++) {
      send_buffer_array[x] = send_buffer_array[x+1];
    }
    #if defined(FEATURE_WINKEY_EMULATION) && defined(OPTION_WINKEY_FREQUENT_STATUS_REPORT)
      winkey_port_write(0xc0|winkey_sending|winkey_xoff,0);
    #endif
  }

  #if defined(DEBUG_SERVICE_SEND_BUFFER)
    debug_serial_port->print(F("remove_from_send_buffer: send_buffer_bytes:"));
    debug_serial_port->println(send_buffer_bytes);
    debug_serial_port->print(F("send_buffer:"));
    for (int x = 0;x < send_buffer_bytes;x++){
      debug_serial_port->write(send_buffer_array[x]);
      debug_serial_port->print(F("["));
      debug_serial_port->print(send_buffer_array[x]);
      debug_serial_port->print(F("]"));
    }
    debug_serial_port->println();    
  #endif

}

//-------------------------------------------------------------------------------------------------------

void add_to_send_buffer(byte incoming_serial_byte)
{

  if (send_buffer_bytes < send_buffer_size) {
    if (incoming_serial_byte != 127) {
      send_buffer_bytes++;
      send_buffer_array[send_buffer_bytes - 1] = incoming_serial_byte;
  
      #ifdef FEATURE_WINKEY_EMULATION
        if ((send_buffer_bytes>winkey_xoff_threshold) && winkey_host_open) {
          winkey_xoff=1;
          winkey_port_write(0xc0|winkey_sending|winkey_xoff,0); //send XOFF status         
        }
      #endif
            
    } else {  // we got a backspace
      if (send_buffer_bytes){
        send_buffer_bytes--;
      }
    }

    #if defined(DEBUG_SERVICE_SEND_BUFFER)
      debug_serial_port->print(F("add_to_send_buffer: "));
      debug_serial_port->write(incoming_serial_byte);
      debug_serial_port->print(F(" ["));
      debug_serial_port->print(incoming_serial_byte);
      debug_serial_port->println(F("]"));
      debug_serial_port->print(F("send_buffer:"));
      for (int x = 0;x < send_buffer_bytes;x++){
        debug_serial_port->write(send_buffer_array[x]);
        debug_serial_port->print(F("["));
        debug_serial_port->print(send_buffer_array[x]);
        debug_serial_port->print(F("]"));
      }
      debug_serial_port->println();
    #endif


  } else {

    #if defined(DEBUG_SERVICE_SEND_BUFFER)
      debug_serial_port->println(F("add_to_send_buffer: !send_buffer_bytes < send_buffer_size"));
    #endif

  }

}
//-------------------------------------------------------------------------------------------------------

/*

10 CLS 
20 PRINT "HELLO"
30 GOTO 20

*/


//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_WINKEY_EMULATION
void winkey_unbuffered_speed_command(byte incoming_serial_byte) {

  if (incoming_serial_byte == 0) {
    #ifdef FEATURE_POTENTIOMETER
      configuration.pot_activated = 1;
    #endif
  } else {
    configuration.wpm = incoming_serial_byte;
    winkey_speed_state = WINKEY_UNBUFFERED_SPEED;
    winkey_last_unbuffered_speed_wpm = configuration.wpm;
    //calculate_element_length();
    #ifdef OPTION_WINKEY_STRICT_EEPROM_WRITES_MAY_WEAR_OUT_EEPROM
      config_dirty = 1;
    #endif
    
    #ifdef FEATURE_LED_RING
      update_led_ring();
    #endif //FEATURE_LED_RING    
    
