K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
}
#endif  //FEATURE_WINKEY_EMULATION

//-------------------------------------------------------------------------------------------------------
#ifdef FEATURE_COMMAND_LINE_INTERFACE
void service_command_line_interface(PRIMARY_SERIAL_CLS * port_to_use) {
 
  static byte cli_wait_for_cr_flag = 0; 

  if (serial_backslash_command == 0) {
    incoming_serial_byte = uppercase(incoming_serial_byte);
    if ((incoming_serial_byte != 92) && (incoming_serial_byte != 27)) { // we do not have a backslash or ESC


      #if !defined(OPTION_EXCLUDE_MILL_MODE)
        if (configuration.cli_mode == CLI_NORMAL_MODE){
          if (cli_prosign_flag) {
            add_to_send_buffer(SERIAL_SEND_BUFFER_PROSIGN);
            cli_prosign_flag = 0;
          }
          if (cli_wait_for_cr_to_send_cw) {
            if (cli_wait_for_cr_flag == 0) {
              if (incoming_serial_byte > 31) {
                #ifdef DEBUG_CHECK_SERIAL
                  port_to_use->println(F("check_serial: add_to_send_buffer(SERIAL_SEND_BUFFER_HOLD_SEND)"));
                #endif
                add_to_send_buffer(SERIAL_SEND_BUFFER_HOLD_SEND);
                cli_wait_for_cr_flag = 1;
              }
            } else {
              if (incoming_serial_byte == 13) {
                #ifdef DEBUG_CHECK_SERIAL
                  port_to_use->println(F("check_serial: add_to_send_buffer(SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE)"));
                #endif
                add_to_send_buffer(SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE);
                cli_wait_for_cr_flag = 0;
              }
            }
          }
          add_to_send_buffer(incoming_serial_byte);
        } else {  // configuration.cli_mode != CLI_NORMAL_MODE
          if (configuration.cli_mode == CLI_MILL_MODE_KEYBOARD_RECEIVE){
            port_to_use->write(incoming_serial_byte);
            if (incoming_serial_byte == 13){port_to_use->println();}
            #ifdef FEATURE_SD_CARD_SUPPORT
              sd_card_log("",incoming_serial_byte);
            #endif            

          } else { // configuration.cli_mode == CLI_MILL_MODE_PADDLE_SEND
            port_to_use->println();
            port_to_use->println();
            if (incoming_serial_byte == 13){port_to_use->println();}
            port_to_use->write(incoming_serial_byte);
            configuration.cli_mode = CLI_MILL_MODE_KEYBOARD_RECEIVE;
            #ifdef FEATURE_SD_CARD_SUPPORT
              sd_card_log("\r\nRX:",0);
              sd_card_log("",incoming_serial_byte);
            #endif          
          }
        } //if (configuration.cli_mode == CLI_NORMAL_MODE)

      #else //!defined(OPTION_EXCLUDE_MILL_MODE)

        if (cli_prosign_flag) {
          add_to_send_buffer(SERIAL_SEND_BUFFER_PROSIGN);
          cli_prosign_flag = 0;
        }
        if (cli_wait_for_cr_to_send_cw) {
          if (cli_wait_for_cr_flag == 0) {
            if (incoming_serial_byte > 31) {
              #ifdef DEBUG_CHECK_SERIAL
                port_to_use->println(F("check_serial: add_to_send_buffer(SERIAL_SEND_BUFFER_HOLD_SEND)"));
              #endif
              add_to_send_buffer(SERIAL_SEND_BUFFER_HOLD_SEND);
              cli_wait_for_cr_flag = 1;
            }
          } else {
            if (incoming_serial_byte == 13) {
              #ifdef DEBUG_CHECK_SERIAL
                port_to_use->println(F("check_serial: add_to_send_buffer(SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE)"));
              #endif
              add_to_send_buffer(SERIAL_SEND_BUFFER_HOLD_SEND_RELEASE);
              cli_wait_for_cr_flag = 0;
            }
          }
        }
        add_to_send_buffer(incoming_serial_byte);

      #endif // !defined(OPTION_EXCLUDE_MILL_MODE)

      #ifdef FEATURE_MEMORIES
        if ((incoming_serial_byte != 13) && (incoming_serial_byte != 10)) {repeat_memory = 255;}
      #endif
    } else {     //if ((incoming_serial_byte != 92) && (incoming_serial_byte != 27)) -- we got a backslash or ESC
      if (incoming_serial_byte == 92){  // backslash
        serial_backslash_command = 1;
        port_to_use->write(incoming_serial_byte);
      } else {  // escape
        clear_send_buffer();
        #ifdef FEATURE_MEMORIES
          play_memory_prempt = 1;
          repeat_memory = 255;
        #endif
      }  
    }
  } else { // (serial_backslash_command == 0) -- we already got a backslash
      incoming_serial_byte = uppercase(incoming_serial_byte);
      port_to_use->write(incoming_serial_byte);
      process_serial_command(port_to_use);
      serial_backslash_command = 0;
      port_to_use->println();
  }
}
#endif //FEATURE_COMMAND_LINE_INTERFACE

//-------------------------------------------------------------------------------------------------------

#if defined(FEATURE_SERIAL)
void check_serial(){
  

  #if defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE)
    if (check_serial_override){return;}
  #endif

  #ifdef DEBUG_SERIAL_SEND_CW_CALLOUT
    byte debug_serial_send_cw[2];
    byte previous_tx = 0;
    byte previous_sidetone = 0;
  #endif
  
  #ifdef DEBUG_LOOP
    debug_serial_port->println(F("loop: entering check_serial")); 
  #endif

  #ifdef FEATURE_WINKEY_EMULATION
    if (primary_serial_port_mode == SERIAL_WINKEY_EMULATION) {
      service_winkey(WINKEY_HOUSEKEEPING);
    }
  #endif

  while (primary_serial_port->available() > 0) {
    myDelay(1);
    incoming_serial_byte = primary_serial_port->read();
    #ifdef FEATURE_SLEEP
      last_activity_time = millis(); 
    #endif //FEATURE_SLEEP
    #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
      last_active_time = millis(); 
    #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM
    #ifdef DEBUG_SERIAL_SEND_CW_CALLOUT
      debug_serial_send_cw[0] = (incoming_serial_byte & 0xf0)>>4;
      debug_serial_send_cw[1] = incoming_serial_byte & 0x0f;
      for (byte x = 0;x < 2;x++) {
        if (debug_serial_send_cw[x] < 10) {
          debug_serial_send_cw[x] = debug_serial_send_cw[x] + 48;
        } else {
          debug_serial_send_cw[x] = debug_serial_send_cw[x] + 55;
        }
      }
      previous_tx = key_tx;
      key_tx = 0;
      previous_sidetone = configuration.sidetone_mode;
      configuration.sidetone_mode = SIDETONE_ON;
      send_char(debug_serial_send_cw[0],0);
      send_char(debug_serial_send_cw[1],0);
      key_tx = previous_tx;
      configuration.sidetone_mode = previous_sidetone;
    #endif
    
    #if !defined(FEATURE_WINKEY_EMULATION) && !defined(FEATURE_COMMAND_LINE_INTERFACE)
      primary_serial_port->println(F("No serial features enabled..."));
    #endif

    #if defined(FEATURE_WINKEY_EMULATION) && defined(FEATURE_COMMAND_LINE_INTERFACE)
      if (primary_serial_port_mode == SERIAL_WINKEY_EMULATION) {
        service_winkey(SERVICE_SERIAL_BYTE);
      } else {
        service_command_line_interface(primary_serial_port);
      }
    #else  //defined(FEATURE_WINKEY_EMULATION) && defined(FEATURE_COMMAND_LINE_INTERFACE)
      #ifdef FEATURE_COMMAND_LINE_INTERFACE    
        service_command_line_interface(primary_serial_port);
      #endif //FEATURE_COMMAND_LINE_INTERFACE
      #ifdef FEATURE_WINKEY_EMULATION
        service_winkey(SERVICE_SERIAL_BYTE);
      #endif //FEATURE_WINKEY_EMULATION
    #endif //defined(FEATURE_WINKEY_EMULATION) && defined(FEATURE_COMMAND_LINE_INTERFACE)

  }  //while (primary_serial_port->available() > 0)

  #ifdef FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT
    while (secondary_serial_port->available() > 0) {
      myDelay(1);
      incoming_serial_byte = secondary_serial_port->read();     
      #ifdef FEATURE_SLEEP
        last_activity_time = millis(); 
      #endif //FEATURE_SLEEP
      #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
        last_active_time = millis(); 
      #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM
      #ifdef DEBUG_SERIAL_SEND_CW_CALLOUT
        debug_serial_send_cw[0] = (incoming_serial_byte & 0xf0)>>4;
        debug_serial_send_cw[1] = incoming_serial_byte & 0x0f;
        for (byte x = 0;x < 2;x++) {
          if (debug_serial_send_cw[x] < 10) {
            debug_serial_send_cw[x] = debug_serial_send_cw[x] + 48;
          } else {
            debug_serial_send_cw[x] = debug_serial_send_cw[x] + 55;
          }
        }
        previous_tx = key_tx;
        key_tx = 0;
        previous_sidetone = configuration.sidetone_mode;
        configuration.sidetone_mode = SIDETONE_ON;
        send_char(debug_serial_send_cw[0],0);
        send_char(debug_serial_send_cw[1],0);
        key_tx = previous_tx;
        configuration.sidetone_mode = previous_sidetone;
      #endif //DEBUG_SERIAL_SEND_CW_CALLOUT
      service_command_line_interface(secondary_serial_port);
    } //  while (secondary_serial_port->available() > 0)  
  #endif //FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT

