K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #if defined(FEATURE_AUTOSPACE)
    if (userinput.startsWith("AF ")){cli_autospace_timing_factor(port_to_use,userinput.substring(3));return;}
  #endif // defined(FEATURE_AUTOSPACE)

  if (userinput.startsWith("COMP ")){cli_keying_compensation(port_to_use,userinput.substring(5));return;}
#if defined(FEATURE_WIFI) //SP5IOU 20220128
  if (userinput.startsWith("WIFI ")) { cli_wifi(port_to_use, userinput.substring(5)); return; }
#endif

  port_to_use->println(F("\r\nError"));

}
#endif
//---------------------------------------------------------------------
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS) && defined(FEATURE_WIFI)
void cli_wifi(PRIMARY_SERIAL_CLS* port_to_use, String command_arguments) {
#if defined(DEBUG_WIFI)
    debug_serial_port->print(F("\ncommand_arguments ")); //DEBUG
    debug_serial_port->print(command_arguments); //DEBUG
    debug_serial_port->print(F(" Sizeof command_arguments "));//DEBUG
    debug_serial_port->println(command_arguments.length()); //DEBUG
#endif
    int index;
    for (index = 0; (index < command_arguments.length()) && (command_arguments[index]!=' '); index++) {
        configuration.wifissid[index] = command_arguments[index];
        }
    configuration.wifissid[index] = 0; //Insert NULL as string terminantion
    String trimmer = configuration.wifissid;
     int index1 = index + 1;
#if defined(DEBUG_WIFI)
    debug_serial_port->print(F("\nconfiguration.wifissid "));
    debug_serial_port->print(configuration.wifissid); //DEBUG
    debug_serial_port->print(F(" index1 "));
    debug_serial_port->print(index1); //DEBUG
#endif
    for (index = index1; (index < command_arguments.length())/* && (command_arguments[index] != ' ')*/; index++) {
        configuration.wifipassword[index-index1] = command_arguments[index];
    }
    configuration.wifipassword[index-index1] = 0;//Insert NULL as string terminantion
    port_to_use->print(F(" configuration.wifipassword "));
    port_to_use->println(configuration.wifipassword); //DEBUG
    write_settings_to_eeprom(0);
    setup_esp();
}
#endif
//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)
void cli_keying_compensation(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments){

  configuration.keying_compensation = command_arguments.toInt();
  config_dirty = 1;
  port_to_use->print(F("\r\nKeying Compensation Set To: "));
  port_to_use->print(configuration.keying_compensation);
  port_to_use->println(F(" mS"));
  if (configuration.keying_compensation > (0.90 * (1200.0/(float)configuration.wpm))) {
    port_to_use->println(F("WARNING: This is setting is probably too high for your current speed setting."));
  }
  config_dirty = 1;

}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS) && defined(FEATURE_AUTOSPACE)



//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS) && defined(FEATURE_AUTOSPACE)
void cli_autospace_timing_factor(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments){

  configuration.autospace_timing_factor = command_arguments.toInt();
  config_dirty = 1;
  port_to_use->print(F("\r\nAutospace Timing Factor Set To: "));
  port_to_use->println((float)configuration.autospace_timing_factor/(float)100);


}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS) && defined(FEATURE_AUTOSPACE)


//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)
void cli_paddle_echo_factor(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments){

  configuration.cw_echo_timing_factor = command_arguments.toInt();
  config_dirty = 1;
  port_to_use->print(F("\r\nPaddle Echo Factor Set To: "));
  port_to_use->println((float)configuration.cw_echo_timing_factor/(float)100);


}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)

//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)
void cli_timing_command(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments,byte command_called){

  byte valid_command = 0;
  unsigned int parm1 = 0;
  unsigned int parm2 = 0;
  String temp_string;

  temp_string = command_arguments.substring(0,1);
  parm1 = temp_string.toInt();
  temp_string = command_arguments.substring(2);
  parm2 = temp_string.toInt();
  if ((command_called == COMMAND_PL) || (command_called == COMMAND_PT)){
    if ((parm1 > 0) && (parm1 < 7)){
      if (command_called == COMMAND_PL){
        configuration.ptt_lead_time[parm1 - 1] = parm2;
      } else {
        configuration.ptt_tail_time[parm1 - 1] = parm2;
      }
      valid_command = 1;
    }    
  }

  #if defined(FEATURE_SEQUENCER)
    if ((command_called == COMMAND_PA) || (command_called == COMMAND_PI)){
      if ((parm1 > 0) && (parm1 < 6)){
        if (command_called == COMMAND_PA){
          configuration.ptt_active_to_sequencer_active_time[parm1 - 1] = parm2;
        } else {
          configuration.ptt_inactive_to_sequencer_inactive_time[parm1 - 1] = parm2;
        }
        valid_command = 1;
      }    
    }
  #endif //FEATURE_SEQUENCER

  if (!valid_command){
    port_to_use->println(F("\r\nError."));
  } else {
    config_dirty = 1;
  }

}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)
//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)
void cli_timing_print(PRIMARY_SERIAL_CLS * port_to_use){


  port_to_use->println(F("\r\nTimings (mS)"));
  port_to_use->println(F("\r\nPTT"));
  port_to_use->println(F("TX\tLead\tTail"));
  port_to_use->println(F("--\t----\t----"));
  for (int x = 0; x < 6; x++){
    port_to_use->print(x+1);
    port_to_use->print(F("\t"));
    port_to_use->print(configuration.ptt_lead_time[x]);
    port_to_use->print(F("\t"));
    port_to_use->println(configuration.ptt_tail_time[x]);
  }
  #if defined(FEATURE_SEQUENCER)
  port_to_use->println(F("\r\nSequencer"));
  port_to_use->println(F("#\tPTT Active to Sequencer Active\tPTT Inactive to Sequencer Inactive"));
  port_to_use->println(F("-\t------------------------------\t----------------------------------"));
  for (int x = 0; x < 5; x++){
    port_to_use->print(x+1);
    port_to_use->print(F("\t\t\t"));
    port_to_use->print(configuration.ptt_active_to_sequencer_active_time[x]);
    port_to_use->print(F("\t\t\t\t"));
    port_to_use->println(configuration.ptt_inactive_to_sequencer_inactive_time[x]);
  }  
  #endif //FEATURE_SEQUENCER
  port_to_use->println(F("\r\nCommand Hints\r\n"));
  port_to_use->println(F("pl <transmitter> <mS>\tSet PTT lead time"));
  port_to_use->println(F("pt <transmitter> <mS>\tSet PTT tail time"));
  #if defined(FEATURE_SEQUENCER)
    port_to_use->println(F("pa <#> <mS>\t\tSet PTT active to Sequencer active time"));
    port_to_use->println(F("pi <#> <mS>\t\tSet PTT inactive to Sequencer inactive time"));
  #endif //FEATURE_SEQUENCER

