K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)

//---------------------------------------------------------------------
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)  && defined(FEATURE_SD_CARD_SUPPORT)
void cli_sd_ls_command(PRIMARY_SERIAL_CLS * port_to_use,String directory){

  port_to_use->println();

  File dir = SD.open(directory);

  while (true) {
    myDelay(1);
    File entry =  dir.openNextFile();
    if (! entry) {
      // no more files
      break;
    }
    if (entry.isDirectory()) {
      port_to_use->print(F("/"));
      port_to_use->println(entry.name());
    } else {
      // files have sizes, directories do not
      port_to_use->print(entry.name());
      port_to_use->print(F("\t\t"));
      port_to_use->println(entry.size(), DEC);
    }
    entry.close();
  }
}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)  && defined(FEATURE_SD_CARD_SUPPORT)

//---------------------------------------------------------------------
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS) && defined(FEATURE_SD_CARD_SUPPORT)
void sd_card_clear_log_file(PRIMARY_SERIAL_CLS * port_to_use,String filename) {

  if(sd_card_log_state == SD_CARD_LOG_OPEN){
    sdlogfile.close();
  }
  SD.remove(filename);
  sdlogfile = SD.open(filename,FILE_WRITE);
  sd_card_log_state = SD_CARD_LOG_NOT_OPEN;
  if (!sdfile){
    port_to_use->println(F("Unable to open file "));
    sd_card_state = SD_CARD_ERROR;
    sd_card_log_state = SD_CARD_LOG_ERROR;
  }
  sdlogfile.close();

}
#endif
//---------------------------------------------------------------------
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS) && defined(FEATURE_SD_CARD_SUPPORT)
void sd_card_print_file(PRIMARY_SERIAL_CLS * port_to_use,String filename) {

  sdfile = SD.open(filename);
  if (!sdfile){
    port_to_use->print(F("Unable to open file "));
    port_to_use->println(filename);
  } else {
    port_to_use->println(F("\r\nSTART"));
    while(sdfile.available()){
      port_to_use->write(sdfile.read());
    }
    port_to_use->println(F("\r\nEND"));
  }

}
#endif
//---------------------------------------------------------------------


#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS) && defined(FEATURE_SD_CARD_SUPPORT)
void sd_card_load_eeprom_from_file(PRIMARY_SERIAL_CLS * port_to_use,String filename) {

  uint8_t eeprom_byte_;
  unsigned int x;



  sdfile = SD.open(filename, FILE_READ);

  if (sdfile) {
    port_to_use->print(F("Loading eeprom from "));
    port_to_use->print(filename);
  } else {
    port_to_use->println(F("Error opening file.  Exiting."));
    return;
  }

  for (x = 0; x < memory_area_end; x++) {
    if (sdfile.available()){
      EEPROM.write(x,sdfile.read());
      if ((x % 16) == 0){port_to_use->print(F("#"));}
    } else {
      x = memory_area_end;
      port_to_use->println(F("\r\nHit end of file before end of eeprom"));
    }
  }

  sdfile.close();
  port_to_use->println(F("\r\nReading settings from eeprom."));
  read_settings_from_eeprom();
  port_to_use->println(F("Done."));



}

#endif //defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS) && defined(FEATURE_SD_CARD_SUPPORT)

//---------------------------------------------------------------------


#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS) && defined(FEATURE_SD_CARD_SUPPORT)
void sd_card_save_eeprom_to_file(PRIMARY_SERIAL_CLS * port_to_use,String filename) {

  uint8_t eeprom_byte_in;
  unsigned int x;

  SD.remove(filename);
  sdfile = SD.open(filename, FILE_WRITE);

  if (sdfile) {
    port_to_use->print(F("Writing to "));
    port_to_use->print(filename);
  } else {
    port_to_use->println(F("Error opening file.  Exiting."));
    return;
  }

  for (x = 0; x < memory_area_end; x++) {
    eeprom_byte_in = EEPROM.read(x);
    sdfile.write(eeprom_byte_in);
    if ((x % 16) == 0){port_to_use->print(F("."));}
  }

  sdfile.close();
  port_to_use->println(F("Done."));

}

#endif //defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && d!defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)
//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && !defined(OPTION_EXCLUDE_EXTENDED_CLI_COMMANDS)
void cli_eeprom_dump(PRIMARY_SERIAL_CLS * port_to_use){

  byte eeprom_byte_in;
  byte y = 0;
  int w = 0;
  int x = 0;

  #define EEPROM_DUMP_COLUMNS 32
  #define EEPROM_DUMP_LINES 30

  for (x = 0; x < memory_area_end; x++) {
    if (y == 0){
      port_to_use->print(F("\r\n"));
      if (x < 0x1000){port_to_use->print(F("0"));}
      if (x < 0x100){port_to_use->print(F("0"));}
      if (x < 0x10){port_to_use->print(F("0"));}
      port_to_use->print(x,HEX);
      port_to_use->print(F("\t"));
    }
    eeprom_byte_in = EEPROM.read(x);
    if (eeprom_byte_in < 0x10){port_to_use->print(F("0"));}
    port_to_use->print(eeprom_byte_in,HEX);
    port_to_use->write(" ");
    y++;
    if (y > (EEPROM_DUMP_COLUMNS - 1)){
      port_to_use->print(F("\t"));
      for (int z = x+1 - y; z < x+1; z++) {
        eeprom_byte_in = EEPROM.read(z);
        if ((eeprom_byte_in > 31) && (eeprom_byte_in < 127)){
          port_to_use->write(eeprom_byte_in);
        } else {
          port_to_use->print(F("."));
        }  
      }
      y = 0;
      w++;
      if (w > EEPROM_DUMP_LINES){
        port_to_use->println(F("\r\nPress enter..."));
        while(!port_to_use->available()){myDelay(1);}
        while(port_to_use->available()){port_to_use->read(); myDelay(1);}
        w = 0;
      }
    }
  }
  if (y > 0){
    for (int z = (EEPROM_DUMP_COLUMNS - y); z > 0; z--){
      port_to_use->write("   ");
    }
    port_to_use->print(F("\t"));
    for (int z = x - y; z < x; z++) {
      eeprom_byte_in = EEPROM.read(z);
      if ((eeprom_byte_in > 31) && (eeprom_byte_in < 127)){
        port_to_use->write(eeprom_byte_in);
      } else {
        port_to_use->print(F("."));
      }  
    }    
  }

