K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
//---------------------------------------------------------------------
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_set_dit_to_dah_ratio(PRIMARY_SERIAL_CLS * port_to_use)
{
    int set_ratio_to = serial_get_number_input(4, 99, 1000, port_to_use, DONT_RAISE_ERROR_MSG);
    // if ((set_ratio_to > 99) && (set_ratio_to < 1000)) {
    //   configuration.dah_to_dit_ratio = set_ratio_to;
    //   port_to_use->print(F("Setting dah to dit ratio to "));
    //   port_to_use->println((float(configuration.dah_to_dit_ratio)/100));
    //   config_dirty = 1;
    // }

    if ((set_ratio_to < 100) || (set_ratio_to > 999)) {
      set_ratio_to = 300;
    }
    configuration.dah_to_dit_ratio = set_ratio_to;
    port_to_use->write("\r\nDah to dit ratio set to ");
    port_to_use->println((float(configuration.dah_to_dit_ratio)/100));
    config_dirty = 1;
}
#endif

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_set_serial_number(PRIMARY_SERIAL_CLS * port_to_use)
{
  int set_serial_number_to = serial_get_number_input(4,0,10000, port_to_use,RAISE_ERROR_MSG);
  if (set_serial_number_to > 0) {
    serial_number = set_serial_number_to;
    port_to_use->write("\r\nSetting serial number to ");
    port_to_use->println(serial_number);
  }
}
#endif

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && defined(FEATURE_POTENTIOMETER)
void serial_set_pot_low_high(PRIMARY_SERIAL_CLS * port_to_use)
{
  int serial_get_number = serial_get_number_input(4,500,10000, port_to_use,RAISE_ERROR_MSG);
  int low_number = (serial_get_number / 100);
  int high_number = serial_get_number % (int(serial_get_number / 100)*100);
  if ((low_number < high_number) && (low_number >= wpm_limit_low) && (high_number <= wpm_limit_high)){
    port_to_use->print(F("\r\nSetting potentiometer range to "));
    port_to_use->print(low_number);
    port_to_use->print(F(" - "));
    port_to_use->print(high_number);
    port_to_use->println(F(" WPM"));
    pot_wpm_low_value = low_number;
    pot_wpm_high_value = high_number;
  } else {
    port_to_use->println(F("\nError"));
  }
}
#endif

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_set_sidetone_freq(PRIMARY_SERIAL_CLS * port_to_use) {
  int set_sidetone_hz = serial_get_number_input(4,(sidetone_hz_limit_low-1),(sidetone_hz_limit_high+1), port_to_use, RAISE_ERROR_MSG);
  if ((set_sidetone_hz > sidetone_hz_limit_low) && (set_sidetone_hz < sidetone_hz_limit_high)) {
    port_to_use->write("\r\nSetting sidetone to ");
    port_to_use->print(set_sidetone_hz,DEC);
    port_to_use->println(F(" hz"));
    configuration.hz_sidetone = set_sidetone_hz;
    config_dirty = 1;
    #ifdef FEATURE_DISPLAY
      if (LCD_COLUMNS < 9) lcd_center_print_timed(String(configuration.hz_sidetone) + " Hz", 0, default_display_msg_delay);
      else lcd_center_print_timed("Sidetone " + String(configuration.hz_sidetone) + " Hz", 0, default_display_msg_delay);
    #endif                                                                    // FEATURE_DISPLAY
  }
}
#endif

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_wpm_set(PRIMARY_SERIAL_CLS * port_to_use) {
  int set_wpm = serial_get_number_input(3,0,1000, port_to_use, RAISE_ERROR_MSG);
  if (set_wpm > 0) {
    speed_set(set_wpm);
    port_to_use->write("\r\nSetting WPM to ");
    port_to_use->println(set_wpm,DEC);
    config_dirty = 1;
  }
}
#endif

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE) && defined(FEATURE_FARNSWORTH)
void serial_set_farnsworth(PRIMARY_SERIAL_CLS * port_to_use) {
  int set_farnsworth_wpm = serial_get_number_input(3,-1,1000, port_to_use, RAISE_ERROR_MSG);
  if ((set_farnsworth_wpm > 0) || (set_farnsworth_wpm == 0)) {
    configuration.wpm_farnsworth = set_farnsworth_wpm;
    port_to_use->write("\r\nSetting Farnsworth WPM to ");
    port_to_use->println(set_farnsworth_wpm,DEC);
    config_dirty = 1;
  }
}
#endif

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_set_weighting(PRIMARY_SERIAL_CLS * port_to_use) {
  int set_weighting = serial_get_number_input(2,9,91,port_to_use, DONT_RAISE_ERROR_MSG);
  if (set_weighting < 1) {
    set_weighting = 50;
  }
  configuration.weighting = set_weighting;
  port_to_use->write("\r\nSetting weighting to ");
  port_to_use->println(set_weighting,DEC);
}
#endif

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_tune_command (PRIMARY_SERIAL_CLS * port_to_use) {
  byte incoming;

  myDelay(100);
  while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
    myDelay(1);
    incoming = port_to_use->read();
  }

  sending_mode = MANUAL_SENDING;
  tx_and_sidetone_key(1);
  port_to_use->println(F("\r\nKeying tx - press a key to unkey"));
  #ifdef FEATURE_BUTTONS
    while ((port_to_use->available() == 0) && (!analogbuttonread(0))) {myDelay(1);}  // keystroke or button0 hit gets us out of here
  #else
    while (port_to_use->available() == 0) {myDelay(1);}
  #endif
  while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
    myDelay(1);
    incoming = port_to_use->read();
  }
  tx_and_sidetone_key(0);
}
#endif

//---------------------------------------------------------------------
	    
#ifdef FEATURE_TRAINING_COMMAND_LINE_INTERFACE

String generate_callsign(byte callsign_mode) {

  static String callsign(10);
  char nextchar;
  char word_buffer[10];

  callsign = "";

  if (callsign_mode == CALLSIGN_INTERNATIONAL){
    if (random(1,101) < 96) {
      // start with a letter 96% of the time
      nextchar = random(65,91);
      callsign = callsign + nextchar;
      if (random(1,101) < 20) {   // randomly add second prefix letter 20% of the time
        nextchar = random(65,91);
        callsign = callsign + nextchar;
      }
    } else {
      // start with a number
      nextchar = random(49,58);    // generate the number
      callsign = callsign + nextchar;
      nextchar = random(65,91);   // must add a letter next
      callsign = callsign + nextchar;
    }
  } //CALLSIGN_INTERNATIONAL

