K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    switch(incoming_char) {
      case 'X': menu_loop = 0; break;
      case 'I': receive_transmit_echo_practice(port_to_use,CALLSIGN_INTERNATIONAL); break;
      case 'U': receive_transmit_echo_practice(port_to_use,CALLSIGN_US); break;
      case 'E': receive_transmit_echo_practice(port_to_use,CALLSIGN_EUROPEAN); break;
      case 'C': receive_transmit_echo_practice(port_to_use,CALLSIGN_CANADA); break; 
      case 'P': receive_transmit_echo_practice(port_to_use,ECHO_PROGRESSIVE_5); break;   
      case '2': receive_transmit_echo_practice(port_to_use,ECHO_2_CHAR_WORDS); break;
      case '3': receive_transmit_echo_practice(port_to_use,ECHO_3_CHAR_WORDS); break;
      case '4': receive_transmit_echo_practice(port_to_use,ECHO_4_CHAR_WORDS); break;
      case 'N': receive_transmit_echo_practice(port_to_use,ECHO_NAMES); break;
      case 'M': receive_transmit_echo_practice(port_to_use,ECHO_MIXED); break;
      case 'Q': receive_transmit_echo_practice(port_to_use,ECHO_QSO_WORDS); break;          
    } //switch(incoming_char)

  } // while(menu_loop)
      
  port_to_use->println(F("Exiting receive / transmit echo practice..."));
}
#endif

//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void receive_transmit_echo_practice(PRIMARY_SERIAL_CLS * port_to_use, byte practice_mode_called) {

  byte loop1 = 1;
  byte loop2 = 0;
  byte x = 0;
  byte user_send_loop = 0;
  String cw_to_send_to_user(10);
  char incoming_char = ' ';
  String user_sent_cw = "";
  byte paddle_hit = 0;
  unsigned long last_element_time = 0;
  unsigned long cw_char;
  byte speed_mode_before = speed_mode;
  byte keyer_mode_before = configuration.keyer_mode;
  byte progressive_step_counter;
  byte practice_mode;
  char word_buffer[10];

  speed_mode = SPEED_NORMAL;                 // put us in normal speed mode 
  if ((configuration.keyer_mode != IAMBIC_A) && (configuration.keyer_mode != IAMBIC_B)) {
    configuration.keyer_mode = IAMBIC_B;                   // we got to be in iambic mode (life is too short to make this work in bug mode)
  }  

  randomSeed(millis());

  #ifdef FEATURE_DISPLAY
    #ifndef FEATURE_TFT_DISPLAY
      lcd_scroll_box_clear();
    #endif
    if (LCD_COLUMNS > 17) {
      lcd_center_print_timed("Receive / Transmit", 0, default_display_msg_delay);
      lcd_center_print_timed("Echo Practice", 1, default_display_msg_delay);
    } else {
      lcd_center_print_timed("RX / TX", 0, default_display_msg_delay);
      if (LCD_ROWS > 1) {
        if (LCD_COLUMNS < 9) {
          lcd_center_print_timed("EchoPrct", 1, default_display_msg_delay);
        } else {
          lcd_center_print_timed("Echo Practice", 1, default_display_msg_delay); 
        }
      }     
    }
    service_display();
  #endif 

  port_to_use->println(F("Receive / Transmit Echo Practice\r\n\r\nCopy the code and send it back using the paddle."));
  port_to_use->println(F("Enter a blackslash \\ to exit.\r\n"));
  while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
    myDelay(1);
    incoming_char = port_to_use->read();
  }
  port_to_use->print(F("Press enter to start...\r\n"));
  while (port_to_use->available() == 0) {
    myDelay(1);
  }
  while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
    myDelay(1);
    incoming_char = port_to_use->read();
  }

  while (loop1) {
    myDelay(1);
    if (practice_mode_called == ECHO_MIXED){
      practice_mode = random(ECHO_2_CHAR_WORDS,ECHO_QSO_WORDS+1);
    } else {
      practice_mode = practice_mode_called;
    }

    progressive_step_counter = 255;
    
    switch (practice_mode) {
      case CALLSIGN_INTERNATIONAL:
      case CALLSIGN_US:
      case CALLSIGN_EUROPEAN:
      case CALLSIGN_CANADA:
        cw_to_send_to_user = generate_callsign(practice_mode);
        break;
      case ECHO_PROGRESSIVE_5:
        cw_to_send_to_user = (char)random(65,91);
        cw_to_send_to_user.concat((char)random(65,91));
        cw_to_send_to_user.concat((char)random(65,91));
        cw_to_send_to_user.concat((char)random(65,91));
        cw_to_send_to_user.concat((char)random(65,91));
        progressive_step_counter = 1;
        break; 
      case ECHO_2_CHAR_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s2_table[random(0,s2_size)])));
        cw_to_send_to_user = word_buffer;
        break;
      case ECHO_3_CHAR_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s3_table[random(0,s3_size)])));
        cw_to_send_to_user = word_buffer;
        break;
      case ECHO_4_CHAR_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s4_table[random(0,s4_size)])));
        cw_to_send_to_user = word_buffer;
        break;    
      case ECHO_NAMES: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(name_table[random(0,name_size)])));
        cw_to_send_to_user = word_buffer;
        break; 
      case ECHO_QSO_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(qso_table[random(0,qso_size)])));
        cw_to_send_to_user = word_buffer;
        break; 

    } // switch (practice_mode)
    
    loop2 = 1;
    
    while (loop2){
      myDelay(1);
      user_send_loop = 1;
      user_sent_cw = "";
      cw_char = 0;
      x = 0;

      // send the CW to the user
      while ((x < (cw_to_send_to_user.length())) && (x < progressive_step_counter)) {
        myDelay(1);
        send_char(cw_to_send_to_user[x],KEYER_NORMAL);
        // test
        port_to_use->print(cw_to_send_to_user[x]);
        //
        x++;
      }
      port_to_use->println();

      while (user_send_loop) {
        // get their paddle input
        myDelay(1);
        #ifdef FEATURE_DISPLAY
          service_display();
        #endif

        #ifdef FEATURE_POTENTIOMETER
          if (configuration.pot_activated) {
            check_potentiometer();
          }
        #endif
        
        #ifdef FEATURE_ROTARY_ENCODER
          check_rotary_encoder();
        #endif //FEATURE_ROTARY_ENCODER    

        check_paddles();

        if (dit_buffer) {
          sending_mode = MANUAL_SENDING;
          send_dit();
          dit_buffer = 0;
          paddle_hit = 1;
          cw_char = (cw_char * 10) + 1;
          last_element_time = millis();
        }
        if (dah_buffer) {
          sending_mode = MANUAL_SENDING;
          send_dah();
          dah_buffer = 0;
          paddle_hit = 1;
          cw_char = (cw_char * 10) + 2;
          last_element_time = millis();
        }
 
        // have we hit letterspace time (end of a letter?)
        if ((paddle_hit) && (millis() > (last_element_time + (float(600/configuration.wpm) * length_letterspace)))) {
          #ifdef DEBUG_PRACTICE_SERIAL
            debug_serial_port->println(F("receive_transmit_echo_practice: user_send_loop: hit length_letterspace"));
          #endif                                  // DEBUG_PRACTICE_SERIAL
          incoming_char = convert_cw_number_to_ascii(cw_char);
          port_to_use->print(incoming_char);
          #ifdef FEATURE_DISPLAY
            display_scroll_print_char(incoming_char);
            service_display();
          #endif                                   // FEATURE_DISPLAY
          user_sent_cw.concat(incoming_char);
          cw_char = 0;
          paddle_hit = 0;
          // TODO - print it to serial and lcd
        }

        // code from Piotr, SP2BPD
        #if defined(FEATURE_STRAIGHT_KEY)
          long ext_key = service_straight_key();
          if (ext_key != 0){
            incoming_char = convert_cw_number_to_ascii(ext_key);
            user_sent_cw.concat(incoming_char);
            cw_char = 0;
          }
        #endif
        // ------

        // do we have all the characters from the user? - if so, get out of user_send_loop
        if ((user_sent_cw.length() >= cw_to_send_to_user.length()) || ((progressive_step_counter < 255) && (user_sent_cw.length() == progressive_step_counter))) {
          user_send_loop = 0;
          port_to_use->println();
          #ifdef FEATURE_DISPLAY
            display_scroll_print_char(' ');
            service_display();
          #endif

