K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    }
  } // while(menu_loop)
      
  port_to_use->println(F("Exiting callsign training..."));
  
}
#endif

//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_set_wordspace_parameters(PRIMARY_SERIAL_CLS * port_to_use,byte mode_select) {

  byte menu_loop = 1;
  byte menu_loop2 = 1;
  char incoming_char = ' ';
  unsigned int temp_value;

  
  while(menu_loop){
  
    while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
      myDelay(1);
      port_to_use->read();
    }  
  
    switch(mode_select){
      case WORDSWORTH_WORDSPACE: port_to_use->print(F("\r\nEnter Wordspace >")); break;
      case WORDSWORTH_WPM: port_to_use->print(F("\r\nEnter WPM >")); break;
      case WORDSWORTH_REPETITION: port_to_use->print(F("\r\nEnter Repetition >")); break;
    }


    menu_loop2 = 1;
    temp_value = 0;
    
    while (menu_loop2){
      myDelay(1);
      if (port_to_use->available()){
        incoming_char = port_to_use->read();
        if ((incoming_char > 47) && (incoming_char < 58)){
          port_to_use->print(incoming_char);
          temp_value = (temp_value * 10) + (incoming_char - 48);
        }
        if (incoming_char == 13){  // Enter Key
          menu_loop2 = 0;
        }
      }
    }
      
    // validate value     
    if (temp_value == 0){
      menu_loop = 0;        // just blow out if nothing was entered
    } else {
      if ((temp_value > 0) && (temp_value < 101) && (mode_select == WORDSWORTH_WPM)){
        configuration.wpm = temp_value;
        config_dirty = 1;
        menu_loop = 0;
      } else {
        if ((temp_value > 1) && (temp_value < 13) && (mode_select == WORDSWORTH_WORDSPACE)){
          configuration.wordsworth_wordspace = temp_value;
          config_dirty = 1;
          menu_loop = 0;     
        } else { 
          if ((temp_value > 0) && (temp_value < 11) && (mode_select == WORDSWORTH_REPETITION)){
            configuration.wordsworth_repetition = temp_value;
            config_dirty = 1;
            menu_loop = 0;     
          } else {           
            port_to_use->println(F("\r\nOMG that's an invalid value. Try again, OM..."));
          }
        }
      }
    }
    
  } //while(menu_loop)
      
}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)


//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_random_menu(PRIMARY_SERIAL_CLS * port_to_use){

  byte menu_loop = 1;
  byte menu_loop2 = 1;
  char incoming_char = ' ';
  
  while(menu_loop){
  
    while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
      myDelay(1);
      port_to_use->read();
    }  
    
    port_to_use->println(F("\r\n\nRandom Code Receive Practice Menu\n"));
    port_to_use->println(F("A - Letter Groups"));
    port_to_use->println(F("1 - Number Groups"));
    port_to_use->println(F("M - Mixed Groups"));
    port_to_use->println(F("\nX - Exit\n"));

    menu_loop2 = 1;
    
    while (menu_loop2){
      myDelay(1);
      if (port_to_use->available()){
        incoming_char = port_to_use->read();
        if ((incoming_char != 10) && (incoming_char != 13)){
          menu_loop2 = 0;
        }
      }
    }

    incoming_char = toUpperCase(incoming_char);

    switch(incoming_char){
      case 'A': random_practice(port_to_use,RANDOM_LETTER_GROUPS,5); break;
      case '1': random_practice(port_to_use,RANDOM_NUMBER_GROUPS,5); break;
      case 'M': random_practice(port_to_use,RANDOM_MIXED_GROUPS,5); break;
      case 'X': menu_loop = 0; break;        
    } //switch(incoming_char)
    
  } //while(menu_loop)
      
  port_to_use->println(F("Exiting Random code module..."));
}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)

//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void random_practice(PRIMARY_SERIAL_CLS * port_to_use,byte random_mode,byte group_size) {

  byte loop1 = 1;
  byte x = 0;
  byte y = 0;
  char incoming_char = ' ';
  char random_character = 0;

  randomSeed(millis());
  port_to_use->println(F("Random group practice\r\n"));

  #ifdef FEATURE_DISPLAY
    #ifndef FEATURE_TFT_DISPLAY
      lcd_scroll_box_clear();
    #endif
    if (LCD_COLUMNS < 9){
      lcd_center_print_timed("RndGroup", 0, default_display_msg_delay);
    } else {
      lcd_center_print_timed("Random Group", 0, default_display_msg_delay);
    }
    if (LCD_ROWS > 1){
      lcd_center_print_timed("Practice", 1, default_display_msg_delay);
    }
    service_display();
  #endif

  while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
    myDelay(1);
    incoming_char = port_to_use->read();
  }

  while (loop1){
    myDelay(1);
    switch(random_mode){
      case RANDOM_LETTER_GROUPS: random_character = random(65,91); break;
      case RANDOM_NUMBER_GROUPS: random_character = random(48,58); break;
      case RANDOM_MIXED_GROUPS: 
        random_character = random(65,101);
        if (random_character > 90) {random_character = random_character - 43;};
        break;
    }

    send_char(random_character,KEYER_NORMAL);
    port_to_use->print(random_character);
    #ifdef FEATURE_DISPLAY
      display_scroll_print_char(random_character);
      service_display();
    #endif


    x++;

    if (x == group_size){
      send_char(' ',KEYER_NORMAL);
      port_to_use->print(F(" "));
      #ifdef FEATURE_DISPLAY
        display_scroll_print_char(' ');
        service_display();
      #endif
      x = 0;
      y++;
    }

    if (y > 4){
      port_to_use->println(F(""));
      y = 0;
    }

