K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    if (port_to_use->available()){
      port_to_use->read();
      loop1 = 0;
    }

    #ifdef FEATURE_BUTTONS
      while ((paddle_pin_read(paddle_left) == LOW) || (paddle_pin_read(paddle_right) == LOW) || (analogbuttonread(0))) {
        loop1 = 0;
      }
    #else 
      while ((paddle_pin_read(paddle_left) == LOW) || (paddle_pin_read(paddle_right) == LOW)) {
        myDelay(1);
        loop1 = 0;
      }    
    #endif //FEATURE_BUTTONS

  } //loop1
  

}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)

//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_wordsworth_menu(PRIMARY_SERIAL_CLS * port_to_use){

  byte menu_loop = 1;
  byte menu_loop2 = 1;
  char incoming_char = ' ';
  byte effective_wpm_factor[] = {100,93,86,81,76,71,68,64,61,58,56,53};
  
  while(menu_loop){
  
    while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
      myDelay(1);
      port_to_use->read();
    }  
    
    port_to_use->println(F("\r\n\nWordsworth Menu\n"));
    port_to_use->println(F("2 - Two Letter Words"));
    port_to_use->println(F("3 - Three Letter Words"));
    port_to_use->println(F("4 - Four Letter Words"));
    port_to_use->println(F("N - Names"));
    port_to_use->println(F("Q - QSO Words"));
    port_to_use->println(F("M - Mixed\n"));
    port_to_use->println(F("O - Set Wordspace"));
    port_to_use->println(F("W - Set WPM"));
    port_to_use->println(F("R - Set Repetition"));
    port_to_use->println(F("\nX - Exit\n"));
    port_to_use->print(F("WPM:"));
    port_to_use->print(configuration.wpm);
    port_to_use->print(F(" Wordspace:"));
    port_to_use->print(configuration.wordsworth_wordspace);
    port_to_use->print(F(" Effective WPM:"));
    port_to_use->print(configuration.wpm * (effective_wpm_factor[configuration.wordsworth_wordspace-1]/100.0),0);
    port_to_use->print(F(" Repetition:"));
    port_to_use->println(configuration.wordsworth_repetition);
    port_to_use->println(F("\r\n\nEnter choice >"));

    menu_loop2 = 1;
    
    while (menu_loop2){
      myDelay(1);
      if (port_to_use->available()){
        incoming_char = port_to_use->read();
        if ((incoming_char != 10) && (incoming_char != 13)){
          menu_loop2 = 0;
        }
      }
    }

    incoming_char = toUpperCase(incoming_char);

    switch(incoming_char){
      case '2': wordsworth_practice(port_to_use,WORDSWORTH_2_CHAR_WORDS); break;
      case '3': wordsworth_practice(port_to_use,WORDSWORTH_3_CHAR_WORDS); break;
      case '4': wordsworth_practice(port_to_use,WORDSWORTH_4_CHAR_WORDS); break;
      case 'N': wordsworth_practice(port_to_use,WORDSWORTH_NAMES); break;
      case 'M': wordsworth_practice(port_to_use,WORDSWORTH_MIXED); break;
      case 'Q': wordsworth_practice(port_to_use,WORDSWORTH_QSO_WORDS); break;
      case 'W': serial_set_wordspace_parameters(port_to_use,WORDSWORTH_WPM); break;
      case 'O': serial_set_wordspace_parameters(port_to_use,WORDSWORTH_WORDSPACE); break;
      case 'R': serial_set_wordspace_parameters(port_to_use,WORDSWORTH_REPETITION); break;
      case 'X': menu_loop = 0; break;        
    } //switch(incoming_char)
    
 
    
  } //while(menu_loop)
      
  port_to_use->println(F("Exiting Wordsworth module..."));


}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)


//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void wordsworth_practice(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type)
{

  byte loop1 = 1;
  byte loop2;
  byte loop3;
  unsigned int word_index;
  char word_buffer[10];
  byte x;
  byte not_printed;
  byte practice_type_called = practice_type;
  byte repetitions;


  randomSeed(millis());
  port_to_use->println(F("Wordsworth practice...\n"));

  #ifdef FEATURE_DISPLAY
    //#ifndef FEATURE_TFT_DISPLAY
      lcd_scroll_box_clear();
   // #endif 
    if (LCD_COLUMNS < 9){
      lcd_center_print_timed("Wrdswrth", 0, default_display_msg_delay);
    } else {
      lcd_center_print_timed("Wordsworth", 0, default_display_msg_delay);      
    }
    if (LCD_ROWS > 1){
      lcd_center_print_timed("Practice", 1, default_display_msg_delay);
    }
    service_display();
  #endif

  while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
    myDelay(1);
    port_to_use->read();
  }


  while (loop1){
    myDelay(1);
    if (practice_type_called == WORDSWORTH_MIXED){
      practice_type = random(WORDSWORTH_2_CHAR_WORDS,WORDSWORTH_QSO_WORDS+1);
    } else {
      practice_type = practice_type_called;
    }

    switch(practice_type){
      case WORDSWORTH_2_CHAR_WORDS: 
        word_index = random(0,s2_size);  // min parm is inclusive, max parm is exclusive
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s2_table[word_index])));
        break;
      case WORDSWORTH_3_CHAR_WORDS: 
        word_index = random(0,s3_size);  // min parm is inclusive, max parm is exclusive
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s3_table[word_index])));
        break;
      case WORDSWORTH_4_CHAR_WORDS: 
        word_index = random(0,s4_size);  // min parm is inclusive, max parm is exclusive
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s4_table[word_index])));
        break;    
      case WORDSWORTH_NAMES: 
        word_index = random(0,name_size);  // min parm is inclusive, max parm is exclusive
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(name_table[word_index])));
        break; 
      case WORDSWORTH_QSO_WORDS: 
        word_index = random(0,qso_size);  // min parm is inclusive, max parm is exclusive
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(qso_table[word_index])));
        break; 
    }

    #if defined(DEBUG_WORDSWORTH)
      debug_serial_port->print(F("wordsworth_practice: word_index:"));
      debug_serial_port->println(word_index);
      debug_serial_port->print(F("wordsworth_practice: word_buffer:"));
      debug_serial_port->println(word_buffer);
    #endif
    
