K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    loop3 = 1;
    repetitions = 0;

    while ((loop3) && (repetitions < configuration.wordsworth_repetition)){ // word sending loop
      myDelay(1);
      loop2 = 1;
      x = 0;

      while (loop2){ //character sending loop
        myDelay(1);
        #if defined(DEBUG_WORDSWORTH)
          debug_serial_port->print(F("wordsworth_practice: send_char:"));
          debug_serial_port->print(word_buffer[x]);
          debug_serial_port->print(F(" "));
          debug_serial_port->println((byte)word_buffer[x]);
        #endif

        //word_buffer[x] = toUpperCase(word_buffer[x]); // word files should be in CAPS

        #if defined(OPTION_NON_ENGLISH_EXTENSIONS)
          if (((byte)word_buffer[x] == 195) || ((byte)word_buffer[x] == 197)){  // do we have a unicode character?
            x++;
            if ((word_buffer[x] != 0) && (x < 10)){
              send_char(convert_unicode_to_send_char_code((byte)word_buffer[x-1],(byte)word_buffer[x]),KEYER_NORMAL);
              #ifdef FEATURE_DISPLAY
                display_scroll_print_char(convert_unicode_to_send_char_code((byte)word_buffer[x-1],(byte)word_buffer[x]));
                service_display();
              #endif                 
              x++;
            }
          } else {
            send_char(word_buffer[x],KEYER_NORMAL);
            #ifdef FEATURE_DISPLAY
              display_scroll_print_char(word_buffer[x]);
              service_display();
            #endif            
            x++;
          }
        #else //OPTION_NON_ENGLISH_EXTENSIONS
          send_char(word_buffer[x],KEYER_NORMAL);
          #ifdef FEATURE_DISPLAY
            display_scroll_print_char(word_buffer[x]);
            service_display();
          #endif             
          x++;
        #endif //OPTION_NON_ENGLISH_EXTENSIONS

        not_printed = 1;

        if ((word_buffer[x] == 0) || (x > 9)){ // are we at the end of the word?
          loop2 = 0;
          for (int y = 0;y < (configuration.wordsworth_wordspace-1);y++){  // send extra word spaces
            send_char(' ',KEYER_NORMAL);
            #ifdef FEATURE_DISPLAY
              display_scroll_print_char(' ');
              service_display();
            #endif                 
            if (((y > ((configuration.wordsworth_wordspace-1)/2)) || (configuration.wordsworth_wordspace < 4)) && (not_printed)){
              port_to_use->println(word_buffer);
              not_printed = 0;
            }
            if (port_to_use->available()){
              port_to_use->read();
              y = 99;
              loop1 = 0;
              loop2 = 0;
              loop3 = 0;
            }
          }
        }

        if (port_to_use->available()){
          port_to_use->read();
          loop1 = 0;
          loop2 = 0;
          loop3 = 0;
        }
      }  //loop2

      repetitions++;

    } //loop3

  } //loop1
  
 

}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)

//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_practice_interactive(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type_called)
{

  byte loop1 = 1;
  byte loop2 = 0;
  byte x = 0;
  byte serialwaitloop = 0;
  String cw_to_send_to_user(10);
  char incoming_char = ' ';
  String user_entered_cw = "";
  byte practice_type = 0;
  char word_buffer[20];

  randomSeed(millis());

  #ifdef FEATURE_DISPLAY
    //#ifdef FEATURE_TFT_DISPLAY
      lcd_scroll_box_clear();
    //#endif
    if (LCD_COLUMNS < 9){
      lcd_center_print_timed("IntrctRX", 0, default_display_msg_delay);
    } else {
      lcd_center_print_timed("Interactive RX", 0, default_display_msg_delay);      
    }
    if (LCD_ROWS > 1){
      lcd_center_print_timed("Practice", 1, default_display_msg_delay);
    }
    service_display();
  #endif

  port_to_use->println(F("Interactive receive practice\r\n\r\nCopy the code, type it in, and hit ENTER."));
  port_to_use->println(F("If you are using the Arduino serial monitor, select \"Carriage Return\" line ending."));
  port_to_use->println(F("Enter a blackslash \\ to exit.\r\n"));
  while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
    myDelay(1);
    incoming_char = port_to_use->read();
  }
  port_to_use->print(F("Press enter to start...\r\n"));
  while (port_to_use->available() == 0) {
    myDelay(1);
  }
  while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
    myDelay(1);
    incoming_char = port_to_use->read();
  }

  while (loop1){
    myDelay(1);
    if (practice_type_called == PRACTICE_MIXED){
      practice_type = random(PRACTICE_2_CHAR_WORDS,PRACTICE_QSO_WORDS+1);
    } else {
      practice_type = practice_type_called;
    }

    switch(practice_type){
      case CALLSIGN_INTERNATIONAL:
      case CALLSIGN_US:
      case CALLSIGN_EUROPEAN:
      case CALLSIGN_CANADA:  
        cw_to_send_to_user = generate_callsign(practice_type);
        break;
      case PRACTICE_2_CHAR_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s2_table[random(0,s2_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_interactive: PRACTICE_2_CHAR_WORDS:"));
        #endif
        break;
      case PRACTICE_3_CHAR_WORDS:
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s3_table[random(0,s3_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_interactive: PRACTICE_3_CHAR_WORDS:"));
        #endif        
        break;
      case PRACTICE_4_CHAR_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s4_table[random(0,s4_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_interactive: PRACTICE_4_CHAR_WORDS:"));
        #endif        
        break;    
      case PRACTICE_NAMES: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(name_table[random(0,name_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_interactive: PRACTICE_NAMES:"));
        #endif        
        break; 
      case PRACTICE_QSO_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(qso_table[random(0,qso_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_interactive: PRACTICE_QSO_WORDS:"));
        #endif        
        break; 
    } //switch(practice_type)

    loop2 = 1;
    
