K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    while (loop2){
      myDelay(1);
      #if defined(DEBUG_CALLSIGN_PRACTICE_SHOW_CALLSIGN)
        port_to_use->println(callsign);
      #endif
  
      serialwaitloop = 1;
      user_entered_cw = "";
      x = 0;
      while (serialwaitloop) {
        myDelay(1);
        if(x < (cw_to_send_to_user.length())){
          send_char(cw_to_send_to_user[x],KEYER_NORMAL);
          #ifdef FEATURE_DISPLAY
            display_scroll_print_char(cw_to_send_to_user[x]);
            service_display();
          #endif    
          x++;
        }

        while(port_to_use->available() > 0) {
          myDelay(1);
          incoming_char = port_to_use->read();
          incoming_char = toUpperCase(incoming_char);
          port_to_use->print(incoming_char);
          if (incoming_char == 13) {
            serialwaitloop = 0;
          } else {
            if (incoming_char != 10) {
              user_entered_cw = user_entered_cw + incoming_char;
            }
          }
        }
      }
  
      if (user_entered_cw[0] != '?') {
        if ((user_entered_cw[0] == '\\')){
          port_to_use->println(F("Exiting...\n"));
          loop1 = 0;
          loop2 = 0;
        } else {
          user_entered_cw.toUpperCase();  // the toUpperCase function was modified in 1.0; now it changes string in place
          if (cw_to_send_to_user.compareTo(user_entered_cw) == 0) {
            port_to_use->println(F("\nCorrect!"));
            #ifdef FEATURE_DISPLAY
              #ifndef FEATURE_TFT_DISPLAY
                lcd_scroll_box_clear();
              #endif
                lcd_center_print_timed("Correct!", 0, default_display_msg_delay);
              service_display();
            #endif
            loop2 = 0;
          } else {
            port_to_use->println(F("\nWrong!"));
            #ifdef FEATURE_DISPLAY
              #ifndef FEATURE_TFT_DISPLAY
                lcd_scroll_box_clear();
              #endif
              lcd_center_print_timed("Wrong!", 0, default_display_msg_delay);
              service_display();
            #endif            
          }
        }
      }
  
      #ifdef FEATURE_BUTTONS
        while ((paddle_pin_read(paddle_left) == LOW) || (paddle_pin_read(paddle_right) == LOW) || (analogbuttonread(0))) {
          myDelay(1);
          loop1 = 0;
          loop2 = 0;
        }
      #else 
        while ((paddle_pin_read(paddle_left) == LOW) || (paddle_pin_read(paddle_right) == LOW)) {
          myDelay(1);
          loop1 = 0;
          loop2 = 0;
        }    
      #endif //FEATURE_BUTTONS
    } //loop2
  } //loop1
  

}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)

//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_practice_non_interactive(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type_called)
{

  byte loop1 = 1;
  byte loop2;
  byte x;
  String cw_to_send_to_user(10);
  char incoming_char = ' ';
  byte practice_type;
  char word_buffer[10];

  key_tx = 0;
  randomSeed(millis());

  #ifdef FEATURE_DISPLAY
    #ifndef FEATURE_TFT_DISPLAY
      lcd_scroll_box_clear();
    #endif
    if (LCD_COLUMNS < 9){
      lcd_center_print_timed("Call RX", 0, default_display_msg_delay);
    } else {
      lcd_center_print_timed("Callsign RX", 0, default_display_msg_delay);      
    }
    if (LCD_ROWS > 1){
      lcd_center_print_timed("Practice", 1, default_display_msg_delay);
    }
    service_display();
  #endif

  port_to_use->println(F("Callsign receive practice\r\n"));

  while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
    myDelay(1);
    incoming_char = port_to_use->read();
  }



  while (loop1){
    myDelay(1);
    if (practice_type_called == PRACTICE_MIXED){
      practice_type = random(PRACTICE_2_CHAR_WORDS,PRACTICE_QSO_WORDS+1);
    } else {
      practice_type = practice_type_called;
    }

    switch(practice_type){
      case CALLSIGN_INTERNATIONAL:
      case CALLSIGN_US:
      case CALLSIGN_EUROPEAN:
      case CALLSIGN_CANADA:  
        cw_to_send_to_user = generate_callsign(practice_type);
        break;
      case PRACTICE_2_CHAR_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s2_table[random(0,s2_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_non_interactive: PRACTICE_2_CHAR_WORDS:"));
        #endif
        break;
      case PRACTICE_3_CHAR_WORDS:
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s3_table[random(0,s3_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_non_interactive: PRACTICE_3_CHAR_WORDS:"));
        #endif        
        break;
      case PRACTICE_4_CHAR_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(s4_table[random(0,s4_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_non_interactive: PRACTICE_4_CHAR_WORDS:"));
        #endif        
        break;    
      case PRACTICE_NAMES: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(name_table[random(0,name_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_non_interactive: PRACTICE_NAMES:"));
        #endif        
        break; 
      case PRACTICE_QSO_WORDS: 
        strcpy_P(word_buffer, (char*)pgm_read_dword(&(qso_table[random(0,qso_size)])));
        cw_to_send_to_user = word_buffer;
        #ifdef DEBUG_PRACTICE_SERIAL
          debug_serial_port->print(F("serial_practice_non_interactive: PRACTICE_QSO_WORDS:"));
        #endif        
        break; 
    } //switch(practice_type)


    cw_to_send_to_user = cw_to_send_to_user + "    ";


    loop2 = 1;
    x = 0;

    while ((loop2) && (x < (cw_to_send_to_user.length()))) {
      myDelay(1);
      send_char(cw_to_send_to_user[x],KEYER_NORMAL);
      #ifdef FEATURE_DISPLAY
        display_scroll_print_char(cw_to_send_to_user[x]);
        service_display();
      #endif  
      x++;
    
