K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
//---------------------------------------------------------------------
#if defined(FEATURE_MCP23017_EXPANDER)
  #define BIT_PADDLE_LEFT	  ( 1 << 0)
  #define BIT_PADDLE_RIGHT	( 1 << 1)    
  #define BIT_STRAIGHT_KEY	( 1 << 2)
  #include "freertos/FreeRTOS.h"
  #include <freertos/event_groups.h>

//------ For Port Expander Only ---------------------------------------------------------------
  #ifdef HARDWARE_ESP32_DEV
    static void IRAM_ATTR paddle_intr_handler(void *arg)
    {
        // On interrupt set bit in event group
        BaseType_t hp_task, xResult;
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        if (xEventGroupSetBitsFromISR(Key_Events,  BIT_PADDLE_LEFT | BIT_PADDLE_RIGHT | BIT_STRAIGHT_KEY, &hp_task) != pdFAIL) {        
          #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)        
            portYIELD_FROM_ISR(hp_task);
          #else
            portYIELD_FROM_ISR();
          #endif
        }
    }
  #else
    static void paddle_intr_handler(void)
    {
        // On interrupt set bit in event group
        BaseType_t hp_task, xResult;
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        if (xEventGroupSetBitsFromISR(Key_Events,  BIT_PADDLE_LEFT | BIT_PADDLE_RIGHT | BIT_STRAIGHT_KEY, &hp_task) != pdFAIL) {               
            portYIELD_FROM_ISR(hp_task);

        }
    }
  #endif

//-------------------------------------------------------------------
  #ifdef HARDWARE_ESP32_DEV
  IRAM_ATTR void read_io_handler(void *pvParameters)
  #else
  void read_io_handler(void *pvParameters)
  #endif
  {
      //EventBits_t e_bits;
      uint8_t bits = 0;
      myDelay(100);
      while (1)
      {
          if (xEventGroupWaitBits(Key_Events, BIT_PADDLE_LEFT | BIT_PADDLE_RIGHT | BIT_STRAIGHT_KEY, pdTRUE, pdFALSE, portMAX_DELAY)) {            
              bits = mcp23017.readPort(MCP23017Port::A);
              paddle_left_state = bits & (1 << paddle_left);  // mask left paddle                                    
              paddle_right_state = bits & (1 << paddle_right);  // mask right paddle                         
              #ifdef FEATURE_STRAIGHT_KEY
                  straight_key_state = bits & (1 << pin_straight_key);  // mask right paddle                             
              #endif
              bits = 0x00;
          }
          myDelay(1);
      } 
  }

//-------------------------------------------------------------------

  void init_MCP23017(void) {
    BaseType_t xReturned;

    Key_Events = xEventGroupCreate();
    // Set the expander port A pins for the paddles to input with pullup
    // could be bus 1 if board has a touch controller. else normally bus 0
    mcp23017.init();
    mcp23017.interruptMode(MCP23017InterruptMode::Or);  // MCP23017InterruptMode::Separated
    mcp23017.interrupt(MCP23017Port::A, CHANGE);
    mcp23017.pinMode(paddle_left, INPUT_PULLUP, false);    
    mcp23017.pinMode(paddle_right, INPUT_PULLUP, false);    
    #ifdef FEATURE_STRAIGHT_KEY
        mcp23017.pinMode(pin_straight_key, INPUT_PULLUP, false);
    #endif
    mcp23017.clearInterrupts();

    // create task that sets the global variable for paddle pin state when interrupt event arrives for our watched pins.
    xReturned = xTaskCreate(read_io_handler, "read_io_handler", 4096, NULL, 0, NULL);

    #if defined(HARDWARE_ESP32_DEV)
      // Setup CPU side GPIO interrupt for IntA 
      gpio_set_direction((gpio_num_t) MCP23017_INTA_GPIO, GPIO_MODE_INPUT);
      //gpio_set_pull_mode((gpio_num_t) MCP23017_INTA_GPIO, GPIO_PULLUP_ONLY);  // no pullup on pin 35
      gpio_set_intr_type((gpio_num_t) MCP23017_INTA_GPIO, GPIO_INTR_ANYEDGE);
      gpio_install_isr_service(0);
      gpio_isr_handler_add((gpio_num_t) MCP23017_INTA_GPIO, paddle_intr_handler, (void *)(gpio_num_t) MCP23017_INTA_GPIO);
    #else
      // Setup CPU side GPIO interrupt for IntA       
      pinMode (MCP23017_INTA_GPIO, INPUT);
      attachInterrupt(digitalPinToInterrupt(MCP23017_INTA_GPIO), paddle_intr_handler, CHANGE);      
    #endif

    uint16_t val;
    val = mcp23017.readPort(MCP23017Port::A);
    debug_serial_port->print("MCP23107 Port A read:"); debug_serial_port->println(val, HEX);
    mcp23017.clearInterrupts();
    // Now any pin state change will call the handler.
  }
#endif
//---------------------------------------------------------------------

void initialize_pins() {
#if defined (ARDUINO_MAPLE_MINI) || defined(ARDUINO_GENERIC_STM32F103C) || defined(HARDWARE_ESP32_DEV) || defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)
  #ifdef FEATURE_MCP23017_EXPANDER
    init_MCP23017();  // pin interrupts used on the expander, not local io pins.
  #elif (defined(HARDWARE_ESP32_DEV) && defined(USE_KEY_PIN_INTERRUPTS))
    init_ESP32_GPIO_key_pins();
  #elif (!defined(HARDWARE_ESP32_DEV) && defined(USE_KEY_PIN_INTERRUPTS))
    init_GPIO_key_pins();
  #else  // no interrupts
    pinMode (paddle_left, INPUT_PULLUP);
    pinMode (paddle_right, INPUT_PULLUP);
  #endif
#else
  pinMode (paddle_left, INPUT);
  digitalWrite (paddle_left, HIGH);
  pinMode (paddle_right, INPUT);
  digitalWrite (paddle_right, HIGH);
#endif //defined (ARDUINO_MAPLE_MINI)||defined(ARDUINO_GENERIC_STM32F103C) sp5iou 20180329

  #if defined(FEATURE_CAPACITIVE_PADDLE_PINS)
    if (capactive_paddle_pin_inhibit_pin){
      pinMode (capactive_paddle_pin_inhibit_pin, INPUT);
      digitalWrite (capactive_paddle_pin_inhibit_pin, LOW);    
    }
  #endif //FEATURE_CAPACITIVE_PADDLE_PINS
  
  // This pin 4 is for the Hoysond 3.5" TFT to enable the audio amp. 
  // It works OK for input, but it does not work as an output on 2 boards.  It is always logic high.
  // A trace cut to pin 1 of the audio amp was made and a jumper to GND made on the amp enable Pin 1.
  // Setting this to input.  Could remove it but might be useful for similar boards that do work.  Make it output then.
  if (audio_enable){  // enable audio amp (LOW). DAC pin outputs to audio amp and then out to speaker
    pinMode (audio_enable, INPUT_PULLUP);  // this pin is disconnected 
    digitalRead (audio_enable);
  }

  if (tx_key_line_1) {
    pinMode (tx_key_line_1, OUTPUT);
    digitalWrite (tx_key_line_1, tx_key_line_inactive_state);
  }
  if (tx_key_line_2) {
    pinMode (tx_key_line_2, OUTPUT);
    digitalWrite (tx_key_line_2, tx_key_line_inactive_state);
  }
  if (tx_key_line_3) {
    pinMode (tx_key_line_3, OUTPUT);
    digitalWrite (tx_key_line_3, tx_key_line_inactive_state);
  }
  if (tx_key_line_4) {
    pinMode (tx_key_line_4, OUTPUT);
    digitalWrite (tx_key_line_4, tx_key_line_inactive_state);
  }
  if (tx_key_line_5) {
    pinMode (tx_key_line_5, OUTPUT);
    digitalWrite (tx_key_line_5, tx_key_line_inactive_state);
  }
  if (tx_key_line_6) {
    pinMode (tx_key_line_6, OUTPUT);
    digitalWrite (tx_key_line_6, tx_key_line_inactive_state);
  }
    

  if (ptt_tx_1) {
    pinMode (ptt_tx_1, OUTPUT);
    digitalWrite (ptt_tx_1, ptt_line_inactive_state);
  }
  if (ptt_tx_2) {
    pinMode (ptt_tx_2, OUTPUT);
    digitalWrite (ptt_tx_2, ptt_line_inactive_state);
  }
  if (ptt_tx_3) {
    pinMode (ptt_tx_3, OUTPUT);
    digitalWrite (ptt_tx_3, ptt_line_inactive_state);
  }
  if (ptt_tx_4) {
    pinMode (ptt_tx_4, OUTPUT);
    digitalWrite (ptt_tx_4, ptt_line_inactive_state);
  }
  if (ptt_tx_5) {
    pinMode (ptt_tx_5, OUTPUT);
    digitalWrite (ptt_tx_5, ptt_line_inactive_state);
  }
  if (ptt_tx_6) {
    pinMode (ptt_tx_6, OUTPUT);
    digitalWrite (ptt_tx_6, ptt_line_inactive_state);
  }
  if (sidetone_line) {
    pinMode (sidetone_line, OUTPUT);
    digitalWrite (sidetone_line, sidetone_line_inactive_state);
  }
  if (tx_key_dit) {
    pinMode (tx_key_dit, OUTPUT);
    digitalWrite (tx_key_dit, tx_key_dit_and_dah_pins_inactive_state);
  }
  if (tx_key_dah) {
    pinMode (tx_key_dah, OUTPUT);
    digitalWrite (tx_key_dah, tx_key_dit_and_dah_pins_inactive_state);
  }

  #ifdef FEATURE_CW_DECODER
    pinMode (cw_decoder_pin, INPUT_PULLUP);
    // pinMode (cw_decoder_pin, INPUT);
    // digitalWrite (cw_decoder_pin, HIGH);

    #if defined(OPTION_CW_DECODER_GOERTZEL_AUDIO_DETECTOR)
      //pinMode (cw_decoder_audio_input_pin, INPUT);
      //digitalWrite (cw_decoder_audio_input_pin, LOW);
      analogSetPinAttenuation(cw_decoder_audio_input_pin, ADC_6db); //ADC_ATTENDB_MAX);
      analogReadResolution(4095);
      //analogSetWidth(12);
      cwtonedetector.init(cw_decoder_audio_input_pin);
    #endif //OPTION_CW_DECODER_GOERTZEL_AUDIO_DETECTOR

    if (cw_decoder_indicator){
      pinMode(cw_decoder_indicator,OUTPUT);
      digitalWrite(cw_decoder_indicator, LOW);
    }
  #endif //FEATURE_CW_DECODER
  
  #if defined(FEATURE_COMMAND_MODE) && defined(command_mode_active_led)
    if(command_mode_active_led) {
      pinMode (command_mode_active_led, OUTPUT);
      digitalWrite (command_mode_active_led,LOW);
    }
  #endif //FEATURE_COMMAND_MODE && command_mode_active_led
  
  
  #ifdef FEATURE_LED_RING
    pinMode(led_ring_sdi,OUTPUT);
    pinMode(led_ring_clk,OUTPUT);
    pinMode(led_ring_le,OUTPUT);
  #endif //FEATURE_LED_RING  

  #ifdef FEATURE_ALPHABET_SEND_PRACTICE
    if (correct_answer_led) {
      pinMode(correct_answer_led, OUTPUT);
      digitalWrite(correct_answer_led, LOW);
    }
    if (wrong_answer_led) {
      pinMode(wrong_answer_led, OUTPUT);
      digitalWrite(wrong_answer_led, LOW);
    }
  #endif //FEATURE_ALPHABET_SEND_PRACTICE

  #ifdef FEATURE_PTT_INTERLOCK
    pinMode(ptt_interlock,INPUT_PULLUP);
    // pinMode(ptt_interlock,INPUT);
    // if (ptt_interlock_active_state == HIGH){
    //   digitalWrite(ptt_interlock,LOW);
    // } else {
    //   digitalWrite(ptt_interlock,HIGH);
    // }
  #endif //FEATURE_PTT_INTERLOCK

