K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #if defined(FEATURE_STRAIGHT_KEY) && !defined(USE_KEY_PIN_INTERRUPTS)
    pinMode(pin_straight_key,INPUT_PULLUP);
    if (STRAIGHT_KEY_ACTIVE_STATE == HIGH){
      digitalWrite (pin_straight_key, LOW);
    } else {
      digitalWrite (pin_straight_key, HIGH);
    }
  #endif //FEATURE_STRAIGHT_KEY

  #if defined(FEATURE_COMPETITION_COMPRESSION_DETECTION)
    pinMode(compression_detection_pin,OUTPUT);
    digitalWrite(compression_detection_pin,LOW);
  #endif //FEATURE_COMPETITION_COMPRESSION_DETECTION

  #if defined(FEATURE_SLEEP)
    if (keyer_awake){
      pinMode(keyer_awake,OUTPUT);
      digitalWrite(keyer_awake,KEYER_AWAKE_PIN_AWAKE_STATE);
    }
  #endif //FEATURE_SLEEP
  
  #if defined(FEATURE_LCD_BACKLIGHT_AUTO_DIM)
    if (keyer_power_led){
      pinMode(keyer_power_led,OUTPUT);
      analogWrite(keyer_power_led,keyer_power_led_awake_duty);
    }
  #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

  #ifdef FEATURE_SIDETONE_SWITCH
    pinMode(SIDETONE_SWITCH,INPUT_PULLUP);
  #endif //FEATURE_SIDETONE_SWITCH

  #if defined (FEATURE_4x4_KEYPAD)||defined(FEATURE_3x4_KEYPAD)
    pinMode(Row3,INPUT_PULLUP);
    pinMode(Row2,INPUT_PULLUP);
    pinMode(Row1,INPUT_PULLUP);
    pinMode(Row0,INPUT_PULLUP);
    pinMode(Col2,INPUT_PULLUP);
    pinMode(Col1,INPUT_PULLUP);
    pinMode(Col0,INPUT_PULLUP);
  #endif

  #if defined (FEATURE_4x4_KEYPAD)
    pinMode(Col3,INPUT_PULLUP);        //Col3 not used if 3x4 keypad is defined.
  #endif

  #ifdef FEATURE_SEQUENCER
    if (sequencer_1_pin){
      pinMode(sequencer_1_pin,OUTPUT);
      digitalWrite(sequencer_1_pin,sequencer_pins_inactive_state);
    }
    if (sequencer_2_pin){
      pinMode(sequencer_2_pin,OUTPUT);
      digitalWrite(sequencer_2_pin,sequencer_pins_inactive_state);
    }
    if (sequencer_3_pin){
      pinMode(sequencer_3_pin,OUTPUT);
      digitalWrite(sequencer_3_pin,sequencer_pins_inactive_state);
    }
    if (sequencer_4_pin){
      pinMode(sequencer_4_pin,OUTPUT);
      digitalWrite(sequencer_4_pin,sequencer_pins_inactive_state);
    }
    if (sequencer_5_pin){
      pinMode(sequencer_5_pin,OUTPUT);
      digitalWrite(sequencer_5_pin,sequencer_pins_inactive_state);
    }
  #endif //FEATURE_SEQUENCER

  #ifdef FEATURE_SO2R_BASE
    if (so2r_tx_1) {
      pinMode(so2r_tx_1, OUTPUT);
    }

    if (so2r_tx_2) {
      pinMode(so2r_tx_2, OUTPUT);
    }

    if (so2r_rx_1) {
      pinMode(so2r_rx_1, OUTPUT);
    }

    if (so2r_rx_1s) {
      pinMode(so2r_rx_1s, OUTPUT);
    }

    if (so2r_rx_2) {
      pinMode(so2r_rx_2, OUTPUT);
    }

    if (so2r_rx_2s) {
      pinMode(so2r_rx_2s, OUTPUT);
    }

    if (so2r_rx_s) {
      pinMode(so2r_rx_s, OUTPUT);
    }

    so2r_set_tx();
    so2r_set_rx();

    #ifdef FEATURE_SO2R_SWITCHES
      if (so2r_tx_switch) {
        pinMode(so2r_tx_switch, INPUT_PULLUP);
      }

      if (so2r_rx1_switch) {
        pinMode(so2r_rx1_switch, INPUT_PULLUP);
      }

      if (so2r_rx2_switch) {
        pinMode(so2r_rx2_switch, INPUT_PULLUP);
      }
    #endif // FEATURE_SO2R_SWITCHES
  #endif // FEATURE_SO2R_BASE 

  if (ptt_input_pin){
    pinMode(ptt_input_pin,INPUT_PULLUP);
  }

  if (tx_inhibit_pin){
    pinMode(tx_inhibit_pin,INPUT_PULLUP);
  }

  if (tx_pause_pin){
    pinMode(tx_pause_pin,INPUT_PULLUP);
  }

  if (potentiometer_enable_pin){
    pinMode(potentiometer_enable_pin,INPUT_PULLUP);
  }

  if (pin_sending_mode_automatic){
    pinMode(pin_sending_mode_automatic,OUTPUT);
    digitalWrite(pin_sending_mode_automatic,LOW);
  }

  if (pin_sending_mode_manual){
    pinMode(pin_sending_mode_manual,OUTPUT);
    digitalWrite(pin_sending_mode_manual,LOW);
  }  
  
} //initialize_pins()

//---------------------------------------------------------------------

void initialize_debug_startup()  {
#ifdef DEBUG_STARTUP

  serial_status(debug_serial_port);  
  #if defined(FEATURE_SERIAL)
  debug_serial_port->println(F("FEATURE_SERIAL"));
  #endif
  #ifdef FEATURE_COMMAND_LINE_INTERFACE
  debug_serial_port->println(F("FEATURE_COMMAND_LINE_INTERFACE"));
  #endif
  #ifndef OPTION_DO_NOT_SAY_HI
  debug_serial_port->println(F("OPTION_DO_NOT_SAY_HI"));
  #endif
  #ifdef FEATURE_MEMORIES
  debug_serial_port->println(F("FEATURE_MEMORIES"));
  #endif
  #ifdef FEATURE_MEMORY_MACROS
  debug_serial_port->println(F("FEATURE_MEMORY_MACROS"));
  #endif
  #ifdef FEATURE_WINKEY_EMULATION
  debug_serial_port->println(F("FEATURE_WINKEY_EMULATION"));
  #endif
  #ifdef OPTION_WINKEY_2_SUPPORT
  debug_serial_port->println(F("OPTION_WINKEY_2_SUPPORT"));
  #endif
  #ifdef FEATURE_BEACON
  debug_serial_port->println(F("FEATURE_BEACON"));
  #endif
  #ifdef FEATURE_TRAINING_COMMAND_LINE_INTERFACE
  debug_serial_port->println(F("FEATURE_TRAINING_COMMAND_LINE_INTERFACE"));
  #endif
  #ifdef FEATURE_POTENTIOMETER
  debug_serial_port->println(F("FEATURE_POTENTIOMETER"));
  #endif
  #if defined(FEATURE_SERIAL_HELP)
  debug_serial_port->println(F("FEATURE_SERIAL_HELP"));
  #endif
  #ifdef FEATURE_HELL
  debug_serial_port->println(F("FEATURE_HELL"));
  #endif
  #ifdef FEATURE_AMERICAN_MORSE
  debug_serial_port->println(F("FEATURE_AMERICAN_MORSE"));
  #endif  
  #ifdef FEATURE_PS2_KEYBOARD
  debug_serial_port->println(F("FEATURE_PS2_KEYBOARD"));
  #endif
  #ifdef FEATURE_DEAD_OP_WATCHDOG
  debug_serial_port->println(F("FEATURE_DEAD_OP_WATCHDOG"));
  #endif
  #ifdef FEATURE_AUTOSPACE
  debug_serial_port->println(F("FEATURE_AUTOSPACE"));
  #endif
  #ifdef FEATURE_FARNSWORTH
  debug_serial_port->println(F("FEATURE_FARNSWORTH"));
  #endif
  #ifdef FEATURE_DL2SBA_BANKSWITCH
  debug_serial_port->println(F("FEATURE_DL2SBA_BANKSWITCH"));
  #endif
  #ifdef FEATURE_BUTTONS
  debug_serial_port->println(F("FEATURE_BUTTONS"));
  #endif
  #ifdef FEATURE_COMMAND_MODE
  debug_serial_port->println(F("FEATURE_COMMAND_MODE"));
  #endif
  #ifdef FEATURE_LCD_4BIT
  debug_serial_port->println(F("FEATURE_LCD_4BIT"));
  #endif  
  #ifdef FEATURE_LCD_8BIT
  debug_serial_port->println(F("FEATURE_LCD_8BIT"));
  #endif    
  debug_serial_port->println(F("setup: exiting, going into loop"));
#endif //DEBUG_STARTUP  
}

 
