K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
//--------------------------------------------------------------------- 

void initialize_watchdog(){
  
  #if defined(OPTION_WATCHDOG_TIMER)
    //vTaskDelay(100);
    //esp_task_wdt_init(); // Enable panic on timeout
    //wdt_enable(WDTO_4S);
  #endif //OPTION_WATCHDOG_TIMER

}  

//--------------------------------------------------------------------- 

void check_eeprom_for_initialization(){
  
  #if defined(HARDWARE_GENERIC_STM32F103C)
//      EEPROM.PageBase0 = 0x801F000; //SP5IOU 20210802
//      EEPROM.PageBase1 = 0x801F800; //SP5IOU 20210802
//      EEPROM.PageSize  = 0x800;     //SP5IOU 20210802 Increasinng size of eeprom emulation x2
//      EEPROM.init(); //sp5iou 20180328 to reinitialize / initialize EEPROM
  #endif
  
  #if defined(HARDWARE_ESP32_DEV) || defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO) 
    EEPROM.begin(EEPROM_size);
  #endif
  
  // do an eeprom reset to defaults if paddles are squeezed
  if (paddle_pin_read(paddle_left) == LOW && paddle_pin_read(paddle_right) == LOW) {
    while (paddle_pin_read(paddle_left) == LOW && paddle_pin_read(paddle_right) == LOW) {myDelay(1);}
    initialize_eeprom();
  }
  
  // read settings from eeprom and initialize eeprom if it has never been written to
  if (read_settings_from_eeprom()) {
   initialize_eeprom();
  }
}

//--------------------------------------------------------------------- 

void initialize_eeprom(){
   #if defined(HARDWARE_GENERIC_STM32F103C)
      EEPROM.init(); //sp5iou 20180328 to reinitialize / initialize EEPROM
      EEPROM.format();//sp5iou 20180328 to reinitialize / format EEPROM
   #endif
   write_settings_to_eeprom(1);
  #if defined(FEATURE_SINEWAVE_SIDETONE)
     initialize_tonsin();
  #endif 
  beep_boop();
  beep_boop();
  beep_boop();    

}

//--------------------------------------------------------------------- 

void check_for_beacon_mode(){
  
  #ifndef OPTION_SAVE_MEMORY_NANOKEYER
  // check for beacon mode (paddle_left == low) or straight key mode (paddle_right == low)
  if (paddle_pin_read(paddle_left) == LOW) {
    #ifdef FEATURE_BEACON
    keyer_machine_mode = BEACON;
    #endif
  } else {
    if (paddle_pin_read(paddle_right) == LOW) {
      configuration.keyer_mode = STRAIGHT;
    }
  }
  #endif //OPTION_SAVE_MEMORY_NANOKEYER
 
}

//--------------------------------------------------------------------- 

void check_for_debug_modes(){

  #ifdef DEBUG_CAPTURE_COM_PORT
    primary_serial_port->begin(primary_serial_port_baud_rate);
    debug_capture();
  #endif

  #ifdef DEBUG_HELL_TEST
    hell_test();
  #endif
}

void initialize_gps_port(void) {
    #ifdef FEATURE_GPS
        pinMode(GPS_RX_PIN, INPUT);
        if (configuration.gps_baud == 0) configuration.gps_baud = GPS_BAUD_RATE;
        #if !defined(GPS_TEST)
            #if defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)
                //GPS_SERIAL_CLS SerialPIO(NOPIN, GPS_RX_PIN, 128);                
                //gps_serial_port = GPS_SERIAL_PORT;
              
                gps_serial_port_baud_rate = GPS_SERIAL_PORT_BAUD; 
                gps_serial_port.setFIFOSize(1024);  // default was too small.
                gps_serial_port.setRX(GPS_RX_PIN);
                gps_serial_port.setTX(GPS_TX_PIN);
                gps_serial_port.setInvertRX(GPS_SERIAL_INVERT);
                gps_serial_port.setInvertTX(GPS_SERIAL_INVERT);
                
                gps_serial_port.begin(gps_serial_port_baud_rate, SERIAL_8N1);                
                
                debug_serial_port->print("Intialized GPS Serial Port on Pin "); debug_serial_port->println(GPS_RX_PIN);
            #else
                gps_serial_port.begin(configuration.gps_baud, SERIAL_8N1, GPS_RX_PIN, -1, GPS_SERIAL_INVERT);              
            #endif
            gps_serial_port.flush();  // move the read string queue char ptr to the front so the next read works      
        #endif
        #ifdef FEATURE_DISPLAY
            lcd_center_print_timed("GPS Baud = " + String(configuration.gps_baud), 1, default_display_msg_delay);
        #endif
        stop_msg = false;
        #ifdef DEFAULT_GRID
            validate_grid(DEFAULT_GRID, default_grid);  // done, haved a validated grid from file, could be ""
            strcpy(grid_sq_str, default_grid);  // stgart out with this, process_gps will look at source and adjust it.
        #else
          strcpy(grid_sq_str, "");
        #endif
    #endif
}

//--------------------------------------------------------------------- 

void initialize_serial_ports(){

  // initialize serial port
  #if defined(FEATURE_SERIAL)

    #if defined(FEATURE_WINKEY_EMULATION) && defined(FEATURE_COMMAND_LINE_INTERFACE) //--------------------------------------------
    
      #ifdef FEATURE_BUTTONS
        if (analogbuttonread(0)) {
          #ifdef OPTION_PRIMARY_SERIAL_PORT_DEFAULT_WINKEY_EMULATION
            primary_serial_port_mode = SERIAL_CLI;
            primary_serial_port_baud_rate = PRIMARY_SERIAL_PORT_BAUD;
          #else
            primary_serial_port_mode = SERIAL_WINKEY_EMULATION;
            primary_serial_port_baud_rate = WINKEY_DEFAULT_BAUD;
          #endif  //ifndef OPTION_PRIMARY_SERIAL_PORT_DEFAULT_WINKEY_EMULATION
        } else {    
          #ifdef OPTION_PRIMARY_SERIAL_PORT_DEFAULT_WINKEY_EMULATION
            primary_serial_port_mode = SERIAL_WINKEY_EMULATION;
            primary_serial_port_baud_rate = WINKEY_DEFAULT_BAUD;
          #else
            primary_serial_port_mode = SERIAL_CLI;
            primary_serial_port_baud_rate = PRIMARY_SERIAL_PORT_BAUD;
          #endif  //ifndef OPTION_PRIMARY_SERIAL_PORT_DEFAULT_WINKEY_EMULATION
        }
        while (analogbuttonread(0)) {myDelay(1);}
      #else //FEATURE_BUTTONS  
        #ifdef OPTION_PRIMARY_SERIAL_PORT_DEFAULT_WINKEY_EMULATION
          primary_serial_port_mode = SERIAL_WINKEY_EMULATION;
          primary_serial_port_baud_rate = WINKEY_DEFAULT_BAUD;
        #else
          primary_serial_port_mode = SERIAL_CLI;
          primary_serial_port_baud_rate = PRIMARY_SERIAL_PORT_BAUD;
        #endif  //ifndef OPTION_PRIMARY_SERIAL_PORT_DEFAULT_WINKEY_EMULATION
      #endif //FEATURE_BUTTONS
    #endif //defined(FEATURE_WINKEY_EMULATION) && defined(FEATURE_COMMAND_LINE_INTERFACE)---------------------------------

    #if !defined(FEATURE_WINKEY_EMULATION) && defined(FEATURE_COMMAND_LINE_INTERFACE)
      primary_serial_port_mode = SERIAL_CLI;
      primary_serial_port_baud_rate = PRIMARY_SERIAL_PORT_BAUD;
    #endif  //!defined(FEATURE_WINKEY_EMULATION) && defined(FEATURE_COMMAND_LINE_INTERFACE)

