K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    #if defined(FEATURE_WINKEY_EMULATION) && !defined(FEATURE_COMMAND_LINE_INTERFACE)
      primary_serial_port_mode = SERIAL_WINKEY_EMULATION;
      primary_serial_port_baud_rate = WINKEY_DEFAULT_BAUD;
    #endif //defined(FEATURE_WINKEY_EMULATION) && !defined(FEATURE_COMMAND_LINE_INTERFACE)
    
    primary_serial_port = PRIMARY_SERIAL_PORT;
    primary_serial_port->begin(primary_serial_port_baud_rate);

    #ifdef DEBUG_STARTUP
      debug_serial_port->println(F("setup: serial port opened"));
    #endif //DEBUG_STARTUP

    #if !defined(OPTION_SUPPRESS_SERIAL_BOOT_MSG) && defined(FEATURE_COMMAND_LINE_INTERFACE)
      if (primary_serial_port_mode == SERIAL_CLI) {
        primary_serial_port->print(F("\n\rK3NG Keyer Version "));
        primary_serial_port->write(CODE_VERSION);
        primary_serial_port->println();
        #if defined(FEATURE_SERIAL_HELP)
          primary_serial_port->println(F("\n\rEnter \\? for help\n"));
        #endif
        while(primary_serial_port->available()){primary_serial_port->read();}  //clear out buffer at boot
      }
      #ifdef DEBUG_MEMORYCHECK
        memorycheck();
      #endif //DEBUG_MEMORYCHECK
    #endif //!defined(OPTION_SUPPRESS_SERIAL_BOOT_MSG) && defined(FEATURE_COMMAND_LINE_INTERFACE)

    #ifdef DEBUG_AUX_SERIAL_PORT
      debug_port = DEBUG_AUX_SERIAL_PORT;
      debug_serial_port->begin(DEBUG_AUX_SERIAL_PORT_BAUD);
      debug_serial_port->print(F("debug port open "));
      debug_serial_port->println(CODE_VERSION);
    #endif //DEBUG_AUX_SERIAL_PORT

    #ifdef FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT
      secondary_serial_port = SECONDARY_SERIAL_PORT;
      secondary_serial_port->begin(SECONDARY_SERIAL_PORT_BAUD);
      #if !defined(OPTION_SUPPRESS_SERIAL_BOOT_MSG)
        secondary_serial_port->print(F("\n\rK3NG Keyer Version "));
        secondary_serial_port->write(CODE_VERSION);
        secondary_serial_port->println();
        #if defined(FEATURE_SERIAL_HELP)
          secondary_serial_port->println(F("\n\rEnter \\? for help\n"));
        #endif
        while(secondary_serial_port->available()){secondary_serial_port->read();}  //clear out buffer at boot
      #endif
    #endif //FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT 

    #ifdef FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT
      debug_serial_port = secondary_serial_port;
    #else
      debug_serial_port = primary_serial_port;
    #endif

  #endif //FEATURE_SERIAL
  
  
}

//--------------------------------------------------------------------- 
void initialize_ps2_keyboard(){

  #ifdef FEATURE_PS2_KEYBOARD

  #ifdef OPTION_PS2_KEYBOARD_RESET             // code contributed by Bill, W9BEL
  attachInterrupt(1, ps2int_write, FALLING);
  digitalWrite(ps2_keyboard_data, LOW); // pullup off
  pinMode(ps2_keyboard_data, OUTPUT); // pull clock low
  myDelay(200);
  #endif //OPTION_PS2_KEYBOARD_RESET


  keyboard.begin(ps2_keyboard_data, ps2_keyboard_clock);
  #endif //FEATURE_PS2_KEYBOARD
  
}
//--------------------------------------------------------------------- 

#if defined(FEATURE_PS2_KEYBOARD) && defined(OPTION_PS2_KEYBOARD_RESET)
void ps2int_write() {

  // code contributed by Bill, W9BEL
  //----- Called from initialize_ps2_keyboard to reset Mini KBD ---------
  // The ISR for the external interrupt in read mode


  uint8_t buffer[45];
  uint8_t head, tail, writeByte = 255;
  uint8_t curbit = 0, parity = 0, ack =0;
 
  if(curbit < 8) {
    if(writeByte & 1) {
      parity ^= 1;
      digitalWrite(ps2_keyboard_data, HIGH);
    } else
      digitalWrite(ps2_keyboard_data, LOW);
    writeByte >>= 1;
  } else if(curbit == 8) { // parity
    if(parity)
      digitalWrite(ps2_keyboard_data, LOW);
    else
      digitalWrite(ps2_keyboard_data, HIGH);
  } else if(curbit == 9) { // time to let go
    pinMode(ps2_keyboard_data, INPUT); // release line
    digitalWrite(ps2_keyboard_data, HIGH); // pullup on
  } else { // time to check device ACK and hold clock again
    //holdClock();
    digitalWrite(ps2_keyboard_clock, LOW); // pullup off
    pinMode(ps2_keyboard_clock, OUTPUT); // pull clock low
    ack = !digitalRead(ps2_keyboard_data);
  }
  curbit++;
}
#endif 

//--------------------------------------------------------------------- 
#if defined(FEATURE_BT_KEYBOARD) && defined(HARDWARE_ESP32_DEV)

void pairing_handler(uint32_t pid) {
    debug_serial_port->print(F("Please enter the following pairing code followed with ENTER on your keyboard: "));
    debug_serial_port->println(pid);    
    myDelay(5);
    char pass[28];
    clear_display_row(1);
    sprintf(pass, "Pairing Code %lu", pid);
    lcd_center_print_timed(pass, 2, 15000);
}

#endif

#ifdef FEATURE_BT_KEYBOARD
void keyboard_lost_connection_handler() {
    debug_serial_port->println(F("====> Lost connection with keyboard <===="));
    BT_Keyboard_Lost = true;
    if (bt_keyboard_LED) digitalWrite(bt_keyboard_LED, bt_keyboard_LED_pin_inactive_state);
    Keyboard_Disconnected_signal = true;
}

void keyboard_connected_handler() {
    debug_serial_port->println(F("----> Connected to keyboard <----"));
    BT_Keyboard_Lost = false;
    if (bt_keyboard_LED) digitalWrite(bt_keyboard_LED, bt_keyboard_LED_pin_active_state);   
    Keyboard_Connected_signal = true;
}
#endif

#if defined(FEATURE_BT_KEYBOARD) && (defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO))
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
//#include "freertos/task.h"
QueueHandle_t event_queue;

inline bool    wait_for_low_event(KeyInfo &inf, TickType_t duration = portMAX_DELAY) {
    myDelay(10);
    return xQueueReceive(event_queue, &inf, duration); }

/**
 * @brief Pushes keyboard event data to the event queue
 *
 * This method takes raw keyboard event data and enqueues it for processing.
 * If the input size exceeds MAX_KEY_DATA_SIZE, it will be truncated and a
 * warning message will be logged.
 *
 * @param keys Pointer to array containing keyboard event data
 * @param size Size of the keyboard event data in bytes
 *
 * @note The data is copied into a KeyInfo struct before being enqueued
 * @note No blocking occurs if queue is full (timeout = 0)
 */
void push_key(uint8_t *keys, bool state, KeyModifier modifier) {
  KeyInfo inf;
  uint8_t size = 8;  // Emulate BT_keyboard lib with fixed size message = 8

  if (size > MAX_KEY_DATA_SIZE) {    
    debug_serial_port->printf("push_key: Keyboard event data size bigger than expected: %d  state %d  modifier 0x%02x\n.", size, state, modifier);
    size = MAX_KEY_DATA_SIZE;
  }

  // enqueue
  inf.size = size;
  memcpy(&inf.keys, keys, size);
  inf.modifier = (KeyModifier) *keys;
  inf.state = state;

  xQueueSendToBack(event_queue, &inf, 0);
}

// Consumer keys are the special media keys on most modern keyboards (mute/etc.)
void ckb(void *cbdata, int key) {
    bool state = (bool)cbdata;
    debug_serial_port->printf("Consumer: %02x %s \n", key, state ? "DOWN" : "UP");
    inf.size = 8;  // fake the size to pass through the 
    inf.state = state;
    if (state) inf.keys[2] = key;
    else inf.keys[2] = 0;
    //new_bt_key = true;
    myDelay(10);
    last_active_time = millis();  // reset backlight tomeout timer
}

// We get make/break for every key which lets us hold notes while a key is depressed
void kb(void *cbdata, int key) {
    static bool _holding = false;
    static uint8_t _heldKey = 0;
    bool state = (bool) cbdata;
    inf.size = 8;  // fake the size to match the ESP32 bt_keyboard class string info to pass through the key value translation code
    inf.state = state;
    last_active_time = millis();   // reset backlight tomeout timer
    // Any key up or Modifier key has let go. Set Modifier flag to false and exit
    if (!state || (_holding && !state && ((key == 0xe1) || (key == 0xe5) || (key == 0xe0) || (key == 0xe4) || (key == 0xe2) || (key == 0xe6) || (key == 0xe3)))) {
      _holding = false;
      inf.modifier =(KeyModifier) 0;
      inf.keys[2] = 0;
      inf.keys[0] = 0; // redundant but emulates the ESP32 class bt_keyboard behavior.
      #ifdef DEBUG_BT_KEYBOARD
        debug_serial_port->println("kb: Released Modifier Key or Regular Key");
      #endif
      push_key(inf.keys, state, inf.modifier);
      return;
    }
    
