K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    myDelay(10);

    // Modifier key has been pressed.  Set hold key flag and bit mask and exit, then only process regular keys until modifier key is let up
    if (!_holding && state && ((key == 0xe1) || (key == 0xe5) || (key == 0xe0) || (key == 0xe4) || (key == 0xe2) || (key == 0xe6) || (key == 0xe3))) {
        _heldKey = key;
        _holding = true;
        switch (_heldKey) {
            case 0xe0: inf.modifier = KeyModifier::L_CTRL;  break;
            case 0xe4: inf.modifier = KeyModifier::R_CTRL;  break;
            case 0xe2: inf.modifier = KeyModifier::L_ALT;   break;
            case 0xe6: inf.modifier = KeyModifier::R_ALT;   break;
            case 0xe3: inf.modifier = KeyModifier::L_META;  break;
            case 0xe1: inf.modifier = KeyModifier::L_SHIFT; break;
            case 0xe5: inf.modifier = KeyModifier::R_SHIFT; break;            
        }
        inf.keys[0] = (uint8_t) inf.modifier;  // redundant but emulates the ESP32 class bt_keyboard behavior.
        //debug_serial_port->printf("Kbd  out: mod:0x%02x keys[0]:0x%02x\n", inf.modifier, inf.keys[0]);
        #ifdef DEBUG_BT_KEYBOARD
          debug_serial_port->print("kb: Modifier Key Pressed : "); debug_serial_port->println(inf.keys[0]);
        #endif
        return;
    }

    // if we get here than it is a regular key either standalone or between modifier key events.
    //if (state && key < 128) inf.keys[2] = key;
    //else inf.keys[2] = 0;
    
    inf.keys[2] = key;
    
    //inf.keys[0] = 0;
    //if (!state) inf.keys[2] = 0;  // Key up, clerar the first byte.
    //else inf.keys[2] = key;
    
    push_key(inf.keys, state, inf.modifier);
    
    //new_bt_key = true;
    
    #ifdef DEBUG_BT_KEYBOARD
      if (state) debug_serial_port->printf("Kb (callback) out: mod:0x%02x key:%c state: %s = '%c'\n", inf.modifier, inf.keys[2]+0x5D, state ? "DOWN" : "UP", state ? inf.keys[2]+0x5D : '-');
    #endif
}
#endif

void initialize_bt_keyboard(){  // iint the BT 4.2 stack for ESP32-WROOM-32 for BLE and BT Classic  
  #if defined(FEATURE_BT_KEYBOARD)
  
    #if defined(HARDWARE_ESP32_DEV) 
      esp_err_t ret;
      esp_log_level_set("*", ESP_LOG_NONE);
      //esp_log_level_set("bt", ESP_LOG_VERBOSE);
      //esp_log_level_set("ESP_HIDH", ESP_LOG_VERBOSE);

      // To test the Pairing code entry, uncomment the following line as pairing info is
      // kept in the nvs. Pairing will then be required on every boot.
      //ESP_ERROR_CHECK(nvs_flash_erase());

      ret = nvs_flash_init();
      if ((ret == ESP_ERR_NVS_NO_FREE_PAGES) || (ret == ESP_ERR_NVS_NEW_VERSION_FOUND)) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
      }
      ESP_ERROR_CHECK(ret);
      
      btStarted();  // workarond to avoid bt_controller init failure #259
      //btStart();
      //btStartMode(BT_MODE_CLASSIC_BT);

      if (bt_keyboard.setup(pairing_handler, keyboard_connected_handler,
                            keyboard_lost_connection_handler)) { // Must be called once
          bt_keyboard.devices_scan(); // Required to discover new keyboards and for pairing
                                    // Default duration is 5 seconds
      }
    #endif

    #if defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)
      event_queue = xQueueCreate(30, sizeof(KeyInfo));
      // We can use the cbData as a flag to see if we're making or breaking a key
      bt_keyboard.onKeyDown(kb, (void *)true);
      bt_keyboard.onKeyUp(kb, (void *)false);
        // Consumer keys are the special function ones like "mute" or "home"
      bt_keyboard.onConsumerKeyDown(ckb, (void *)true);
      bt_keyboard.onConsumerKeyUp(ckb, (void *)false);
      loadEEPROM(); // See about reconnecting
      if (use_BLE) bt_keyboard.begin(true);   // BLE
      else bt_keyboard.begin();  // BT Classic
    #endif

    pinMode(bt_keyboard_LED, OUTPUT);
    digitalWrite(bt_keyboard_LED, bt_keyboard_LED_pin_inactive_state);
    debug_serial_port->print(F("BT Keyboard connected LED inactive state = ")); debug_serial_port->println(bt_keyboard_LED_pin_inactive_state);
   
    debug_serial_port->println(F("BT and BLE device Scan Setup"));

    if (!bt_keyboard.is_connected()) {
        debug_serial_port->println(F("No BT Keyboards found"));
        #ifdef FEATURE_DISPLAY
          lcd_center_print_timed("No BT Keyboards", 1, 2000);
        #endif
    }

    queueflush();
  #endif
}

//#if defined(FEATURE_BT_KEYBOARD) || defined(FEATURE_TOUCH_DISPLAY)
////////////////////////////////////////////////////////////////////////
//
// Here is a queue to store the characters that I've typed.
// To simplify the code, it can store a maximum of QUEUESIZE-1 characters
// before it fills up.  What is a byte wasted between friends?
//
//  This queue is shared between the BT keyboard and select Touch buttons
//
////////////////////////////////////////////////////////////////////////

void queueadd(const char ch)
{
    queue[qtail++] = ch ;
    qtail &= QUEUEMASK ;
    //debug_serial_port->printf("Queue string after char Add %s\n", queue);
}
 
void queueadd(const char *s)
{
  while (*s) {
      queueadd(*s++);
  }
}
 
char queuepop()
{
    char ch ;
    ch = queue[qhead++];
    qhead &= QUEUEMASK;
    //debug_serial_port->printf("QueuePop char %c\n", ch);
    return ch;
}
 
int queuefull()
{
    return (((qtail+1)%QUEUEMASK) == qhead);
}
 
int queueempty()
{
    return (qhead == qtail);
}
 
int queue_available()
{
    return (qhead - qtail);
}

void queueflush()
{
    qhead = qtail;
}
//#endif // BT_KEYBOARD

void myDelay(uint32_t _ms)
{
    //unsigned long t = millis() ;
    #if defined(USE_TOUCH_TASK) || defined(USE_BT_TASK) || defined(USE_TASK)
      vTaskDelay(portTICK_PERIOD_MS * _ms);
    #else
      delay(1);
    #endif
    //while (millis()-t < ms)
    //#ifdef PS2
    //    ps2poll() ;
    //#else
    //  ;
    //#endif
}

//--------------------------------------------------------------------- 

#ifdef FEATURE_TOUCH_DISPLAY
  #ifdef TOUCH_GT911_BUTTONS
    #include "TAMC_GT911.h"
    TAMC_GT911 tp = TAMC_GT911(TOUCH_SDA, TOUCH_SCL, TOUCH_INT, TOUCH_RST, TOUCH_WIDTH, TOUCH_HEIGHT);
  #endif
#endif

// Text associated with touch buttons
// Text content sized to fit in the window.  Later desire to make scrollable with button and/or touch gesture
const char btn2_text[] = {"This is even longer test text Msg #2"};
const char btn3_text[] = {"This is for Button Msg #3"};
const char btn4_text[] = {"This is test text Msg #4"};

void initialize_display() {

