K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      // 2nd row of 8    
      btn[8].p_btn.initButtonUL(&lcd,  ba+(0*bs), br2, bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
      btn[9].p_btn.initButtonUL(&lcd,  ba+(1*bs), br2, bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
      btn[10].p_btn.initButtonUL(&lcd, ba+(2*bs), br2, bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
      btn[11].p_btn.initButtonUL(&lcd, ba+(3*bs), br2, bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
      btn[12].p_btn.initButtonUL(&lcd, ba+(4*bs), br2, bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
      btn[13].p_btn.initButtonUL(&lcd, ba+(5*bs), br2, bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
      btn[14].p_btn.initButtonUL(&lcd, ba+(6*bs), br2, bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
      btn[15].p_btn.initButtonUL(&lcd, ba+(7*bs), br2, bh, bw, TFT_WHITE, TFT_RED, TFT_WHITE, "", 2);  // library modified to ignore text size
      btn[16].p_btn.initButtonUL(&lcd, SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, TFT_BLACK, TFT_BLACK, TFT_BLACK, "", 2);  // library modified to ignore text size
    #endif

    refresh_button_row(0);
    lcd.setFreeFont(TFT_FONT_MEDIUM);
  #endif
}

// map out the user assigned button order and rearrange the key[] table button row and row position indexes t match user desires
// For the Touch 16 panel, this is simple as the row is always 0.
// For rows, need to calculate the row nummber (mod 4) then assign the group of 4 values 0-3 for all 4 groups of 4
void initialize_buttons() {
  int i, b;
  int r = 0;

  for (b = 0; b < button_array_size; b++) {    
    for (int i=0; i < NUM_KEYS; i++) {         
      if (key[i].key_event == button_array[b]) {
        //debug_serial_port->printf("function=%s", key[i].text_off);
        #ifdef TOUCH_BUTTON_16
          key[i].btn_idx = b;  // row is always 0 which is default          
        #else
          key[i].btn_idx = b%(BUTTONS_PER_ROW-1) + 1;  // assign button position 1-4 in the row 0-3.  pos 0 is always Fx row select key
          key[i].row = r;  // assign button to a row          
          if (key[i].btn_idx == BUTTONS_PER_ROW-1) {
            r++;  // assign button to a row
          }
        #endif
        debug_serial_port->printf("Assigning button %s to row=%d pos=%d\n", key[i].text_off, key[i].row, key[i].btn_idx);
      }
    }
  }

  create_buttons();

}

void clear_holds_key() {
  #ifdef FEATURE_TOUCH_DISPLAY
  for (int t = 0; t < NUM_KEYS; t++) {   // clear any button in hold state
    //if (key[t].hold) {
      //debug_serial_port->print(F("ESC: Btn was in HOLD: "));debug_serial_port->println(key[t].text_off);
    //}
    //lcd.setFreeFont(TFT_FONT_SMALL);
    if (!key[t].skip) // Do not clear buttons marked with skip == true
      key[t].hold = false;
    //lcd.setFreeFont(TFT_FONT_MEDIUM);
  }
  #endif
}

void generic_popup_key(uint16_t key_ID, const char* msg_text) {
  #ifdef FEATURE_TOUCH_DISPLAY
  if (BtnX_active == 0) { //}  || BtnX_active == key_ID) {       // another keyboard queue key is active until canceled  
  
    //debug_serial_port->print(F("Generic PopUp Key ID= ")); debug_serial_port->print(key_ID);
    //debug_serial_port->print(F("  Text: ")); debug_serial_port->print(msg_text);        
    //debug_serial_port->print(F("  Len: ")); debug_serial_port->println(btn[key[key_ID].btn_idx].len);    

    if (btn[key[key_ID].btn_idx].len == 1) {  // short press   
      BtnX_active = key_ID;  // Do not hold state on
      key[key_ID].hold = false;
      refresh_button_row(button_row);  // refresh before popup - popup will block writes outside window       
      strcpy(popup_text, msg_text);    
      //debug_serial_port->print(F("Short press for key ")); debug_serial_port->println(key[key_ID].text_on);  
      popup_toggle();
    } else {  // long press      
      BtnX_active = key_ID;  // Hold button state ON
      key[key_ID].hold = true;
      refresh_button_row(button_row);  // refresh before popup - popup will block writes outside window       
      strcpy(popup_text, msg_text);
      //debug_serial_port->print(F("Long press for key ")); debug_serial_port->println(key[key_ID].text_off);
      //  Do something different
    }
  }
  #endif
}

// Send memory #X on press, repeats memeory #X on long press
void memX_key(uint16_t key_ID, uint8_t memory_number) {  
  #ifdef FEATURE_TOUCH_DISPLAY
  if (BtnX_active != 0) return;       // another keyboard queue key is active until canceled                   
  
  //debug_serial_port->print(F("Memory Key ID= ")); debug_serial_port->print(key_ID);
  //debug_serial_port->print(F("  Memory = ")); debug_serial_port->println(memory_number);

  if (btn[key[key_ID].btn_idx].len == 1) {  // short press
    BtnX_active = 0;  // Do not hold state on
    key[key_ID].hold = false;
    queueadd(PS2_F1 + memory_number - 1);   // add char to the queue
  } else {  // long press
    BtnX_active = key_ID;  // Hold button state ON
    key[key_ID].hold = true;
    queueadd(PS2_F1_ALT + memory_number - 1);   // add char to the queue              
  }
  refresh_button_row(button_row);  // refresh before popup - popup will block writes outside window
  #endif
}

void pause_btn_toggle_key(uint16_t key_ID) {
  #ifdef FEATURE_TOUCH_DISPLAY
  queueadd(PS2_TAB);   // Pause/Resume
  if (!pause_sending_buffer) {
    debug_serial_port->println(F("PAUSE"));
    key[key_ID].hold = true;      
  } else {
    debug_serial_port->println(F("RESUME"));
    key[key_ID].hold = false;           
  }
  refresh_button_row(button_row);  // refresh before popup - popup will block writes outside window
  #endif
}

void list_memory_key(uint16_t key_ID, uint8_t memory_number) {
  #ifdef FEATURE_TOUCH_DISPLAY
  char mem_string[LCD_COLUMNS*LCD_ROWS] = {};

  if (BtnX_active == 0 || BtnX_active == key_ID) {      // another keyboard queue key is active until canceled , allow if Button 2     
    if (memory_number < number_of_memories) {// cycle through the 10 memories
      int length = print_memory(memory_number, mem_string);  // Get memory string
      sprintf(popup_text, "Memory %d - %s\n Length = %d", (int)memory_number+1, mem_string, length);
      //memory_number++;           // next memory if buton pressed again  
      key[key_ID].hold = true;
      BtnX_active = key_ID;
      refresh_button_row(button_row);  // refresh before popup - popup will block writes outside window
      popup(true);            // post up the popup_text string in window
    }
    else {  // stop repeat.  Use CW_BOX to remove window like all other keys.     
      key[key_ID].hold = false;
      memory_number = 0;
    }
  }
  #endif
}

void TX_enable_key(uint16_t key_ID) {
  #ifdef FEATURE_TOUCH_DISPLAY
    queueflush(); 
    queueadd(PS2_I_CTRL);
    #if defined(FEATURE_BT_KEYBOARD) ||defined(FEATURE_TOUCH_DISPLAY)
      check_ps2_keyboard();
    #endif
    if (key_tx) {
      key[key_ID].hold = false;
    } else {
      key[key_ID].hold = true;  // highlight button and use 'On' state text
    }
    key[key_ID].skip = true;  // do not clear the hold when ESC pressed.
    refresh_button_row(button_row);
    update_icons();
  #endif
}

void TX_select_key(uint16_t key_ID) {
  #ifdef FEATURE_TOUCH_DISPLAY
    uint8_t tx_number;
    char tx_msg[10];

