K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #ifndef USE_TOUCH_TASK
    void check_touch_buttons(void) {
  #else
    void check_touch_buttons(void * pvParameters) {

      /* The parameter value is expected to be 1 as 1 is passed in the
      pvParameters value in the call to xTaskCreate() below. */

      configASSERT( ( ( uint32_t ) pvParameters ) == 1 );

      while (1)
      {
  #endif
        // Check for touch action, determine if they are for a configured button, or something else      
        static uint32_t scanTime = millis();
        static uint32_t tpTime = millis();
        uint32_t duration = 0;
        bool pressed = false; 
        uint16_t threshold = 320;  // 20-1000 pressure level for resistive screen.  TFT_eSPI has a Z param also                                    

          // Scan buttons every 50ms at most when not sending out cw
          if (millis() - scanTime >= 50) {  // check every 50ms for any activity
            scanTime = millis();

            #ifdef TOUCH_GT911_BUTTONS          
              tp.read();              
              pressed = tp.isTouched;
              if (pressed) {           
                t_x = tp.points[0].x;
                t_y = tp.points[0].y;  
              }
              //if (pressed) debug_serial_port->printf("GT911 Touch Event: x:%d y:%d pressed:%d\n", t_x, t_y, pressed);     
            #endif
            
            #ifdef USE_RES_TOUCH
              //if (xSemaphoreTake (xMutex, portMAX_DELAY)) {  // take the mutex  
              uint16_t threshold = 20;  // 20-1000 pressure level for resistive screen.  TFT_eSPI has a Z param also      
              #ifdef DEBUG_TOUCH        
                debug_serial_port->print(F("GetTouch1: Check for pressed - ")); 
              #endif
                          
              pressed = lcd.getTouch(&t_x, &t_y, threshold);
              int z = lcd.getTouchRawZ();
              #ifdef DEBUG_TOUCH        
                debug_serial_port->printf("GetTouch2: x:%d y:%d z:%d pressed:%d\n", t_x, t_y, z, pressed);     
              #endif
              //  xSemaphoreGive (xMutex);  // release the mutex 
              //}
            #endif              
                        
            if (pressed) {                                          
              //button_active = false;     // set active flag if any valid button triggered on                     
              for (uint8_t b = 0; b < buttonCount; b++) {
                btn[b].p_btn.press(false);       
                duration = 0;
                btn[b].len = 0;  // 0, 1=short, 2=long, 3=very_long press time duration
                btn[b].duration = 0;    

                if (btn[b].p_btn.contains(t_x, t_y)) {
                  // look for just pressed                   
                  tpTime = millis();
                  while (pressed) {  // measure duration of button press
                    myDelay(20);
                    
                    #ifdef TOUCH_GT911_BUTTONS 
                      tp.read();
                      pressed = tp.isTouched;
                    #endif

                    #ifdef USE_RES_TOUCH
                      //if (xSemaphoreTake (xMutex, portMAX_DELAY)) {  // take the mutex
                      pressed = lcd.getTouch(&t_x, &t_y, threshold);     
                      #ifdef DEBUG_TOUCH        
                        debug_serial_port->printf("GetTouch3: x:%d y:%d z:%d pressed:%d\n", t_x, t_y, threshold, pressed); 
                      #endif
                      //  xSemaphoreGive (xMutex);  // release the mutex  
                      //}               
                    #endif              

                    duration += (millis() - tpTime);      // add each touch to total duration            

                    //debug_serial_port->printf("Touch Event: x:%d y:%d pressed:%d  duration:%lu\n", t_x, t_y, pressed, duration);  

                    if (duration >= 100 && duration < 1000) {               
                      //debug_serial_port->print(F("*Short duration = ")); debug_serial_port->println(duration);
                      btn[b].len = 1;
                      btn[b].duration = duration;
                    }
                    if (duration >= 1000 && duration < 1800) {  // using medium length zone as a buffer band, not used for keys
                      //debug_serial_port->print(F("**Long duration = ")); debug_serial_port->println(duration);      
                      btn[b].len = 2; 
                      btn[b].duration = duration;                   
                    } 
                    if (duration >= 1800) {
                      //debug_serial_port->print(F("***Very Long duration = ")); debug_serial_port->println(duration);      
                      btn[b].len = 3;
                      btn[b].duration = duration;
                    }
                    if (btn[b].len == 0) 
                      btn[b].duration = duration;
                  }

                  if (btn[b].len == 0) {  // skip - press duration too short or in middle guard band                        
                    btn[b].p_btn.press(false); 
                    break;
                  }
                  #ifdef DEBUG_TOUCH
                    debug_serial_port->print(F("Button Active Flag Set"));
                  #endif
                  btn[b].p_btn.press(true); // record state info for valid button. - process_buttons() will pick up event and add it to the ch queue)
                  button_active = true;     // set active flag if any valid button triggered on                                 
                } else {
                  btn[b].p_btn.press(false); // touch landed outside current button hot spot, set to false
                }                   
              }   // loop through button list and update state for each 
            }   // touched
          }   // end of scan period          
      #ifdef USE_TOUCH_TASK
      myDelay(10);
      } // end of while loop for task mode 
      debug_serial_port->println("Error: Exited Check Buttons Task Loop");
      #endif   
    }
#endif

//-------------------------------------------------------------------------------------------------------
#if defined(OPTION_BLINK_HI_ON_PTT) || (defined(OPTION_WINKEY_BLINK_PTT_ON_HOST_OPEN) && defined(FEATURE_WINKEY_EMULATION))
void blink_ptt_dits_and_dahs(char const * cw_to_send){

  sending_mode = AUTOMATIC_SENDING;

  for (int x = 0;x < strlen(cw_to_send);x++){
    switch(cw_to_send[x]){
      case '.':
        ptt_key();
        myDelay(100);
        ptt_unkey();
        myDelay(100);
        break;
      case '-':
        ptt_key();
        myDelay(300);
        ptt_unkey();
        myDelay(100);
        break;
      case ' ':
        myDelay(400);
        break;        
    }

    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER
  }
}
#endif //defined(OPTION_BLINK_HI_ON_PTT) || (defined(OPTION_WINKEY_BLINK_PTT_ON_HOST_OPEN) && defined(FEATURE_WINKEY_EMULATION))

