K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  // grab the keypad / and * for dit and dah paddling
  if (key == 0x54) {usb_dit = 1; return;}
  if (key == 0x55) {usb_dah = 1; return;}
  if (key == 0x58) {sending_mode = MANUAL_SENDING;tx_and_sidetone_key(1);return;}
  
  if ((modifier.bmLeftShift) || (modifier.bmRightShift)) {
    switch(key){     
      case 0x2a:    // BACKSPACE - decrement serial number
        serial_number--;
        #ifdef FEATURE_DISPLAY
          if (LCD_COLUMNS < 9){
            lcd_center_print_timed("SN " + String(serial_number), 0, default_display_msg_delay);
          } else {
            lcd_center_print_timed("Serial: " + String(serial_number), 0, default_display_msg_delay);
          }
        #endif  
        return;      
        break;  
                     
    } // switch(key)
    #ifdef FEATURE_MEMORIES
    if ((key >= 0x3a) && (key <= 0x45)){ // SHIFT F1-F12 : program memories
      usb_keyboard_program_memory = key - 0x3a; // convert key scan code to memory number; F1 = 0
      if (usb_keyboard_program_memory > (number_of_memories - 1)) {
        boop();
        return;
      }     
      usb_keyboard_special_mode_start_time = millis();
      usb_keyboard_mode = USB_KEYBOARD_PROGRAM_MEM;     
      #ifdef FEATURE_DISPLAY
          if (LCD_COLUMNS < 9){
            lcd_string = "PgmMem";
          } else {
            lcd_string = "Program Memory";
          }
        if (usb_keyboard_program_memory < 9) {
          lcd_string.concat(' ');
        }
        keyboard_string = "";
        lcd_string.concat(usb_keyboard_program_memory+1);
        lcd_center_print_timed(lcd_string, 0, default_display_msg_delay);
      #else
        boop_beep();
      #endif
      
      repeat_memory = 255;
      return;
    }        
    #endif //FEATURE_MEMORIES    
    
  } // if ((modifier.bmLeftShift) || (modifier.bmRightShift))
  
  if ((modifier.bmLeftAlt) || (modifier.bmRightAlt)) {
    switch(key){
      #ifdef FEATURE_MEMORIES
      case 0x3a: if (number_of_memories > 0) {repeat_memory_msg(0);} return; break; // F1
      case 0x3b: if (number_of_memories > 1) {repeat_memory_msg(1);} return; break;
      case 0x3c: if (number_of_memories > 2) {repeat_memory_msg(2);} return; break;
      case 0x3d: if (number_of_memories > 3) {repeat_memory_msg(3);} return; break;
      case 0x3e: if (number_of_memories > 4) {repeat_memory_msg(4);} return; break;
      case 0x3f: if (number_of_memories > 5) {repeat_memory_msg(5);} return; break;
      case 0x40: if (number_of_memories > 6) {repeat_memory_msg(6);} return; break;
      case 0x41: if (number_of_memories > 7) {repeat_memory_msg(7);} return; break;
      case 0x42: if (number_of_memories > 8) {repeat_memory_msg(8);} return; break;
      case 0x43: if (number_of_memories > 9) {repeat_memory_msg(9);} return; break;
      case 0x44: if (number_of_memories > 10) {repeat_memory_msg(10);} return; break;
      case 0x45: if (number_of_memories > 11) {repeat_memory_msg(11);} return; break;
      #endif        
    } //switch(key)
  } // if ((modifier.bmLeftAlt) || (modifier.bmRightAlt))

  if ((modifier.bmLeftCtrl) || (modifier.bmRightCtrl)) {
    #ifdef DEBUG_USB_KEYBOARD
      debug_serial_port->print(F("KbdRptParser::OnKeyDown: CTRL-"));
      debug_serial_port->println(keystroke);
    #endif //DEBUG_USB_KEYBOARD
    switch(key){
      case 0x04 : // CTRL-A
        configuration.keyer_mode = IAMBIC_A;
        #ifdef FEATURE_DISPLAY
          lcd_center_print_timed("Iambic A", 0, default_display_msg_delay);
        #endif
        config_dirty = 1;
        break;

      case 0x05 : // CTRL-B
        configuration.keyer_mode = IAMBIC_B;
        #ifdef FEATURE_DISPLAY
          lcd_center_print_timed("Iambic B", 0, default_display_msg_delay);
        #endif          
        config_dirty = 1;
        break;

      case 0x06 : // CTRL-C
        configuration.keyer_mode = SINGLE_PADDLE;
        #ifdef FEATURE_DISPLAY
          if (LCD_COLUMNS < 9){
            lcd_center_print_timed("SnglePdl", 0, default_display_msg_delay);
          } else {
            lcd_center_print_timed("Single Paddle", 0, default_display_msg_delay);
          }
        #endif          
        config_dirty = 1;
        break;

      #ifndef OPTION_NO_ULTIMATIC
      case 0x07 : // CTRL-D
        configuration.keyer_mode = ULTIMATIC;
        #ifdef FEATURE_DISPLAY
          if (LCD_COLUMNS < 9){
            lcd_center_print_timed("Ultimatc", 0, default_display_msg_delay);
          } else {
            lcd_center_print_timed("Ultimatic", 0, default_display_msg_delay);            
          }        
        #endif        
        config_dirty = 1;
        break;
      #endif

      case 0x08 : // CTRL-E
        #ifdef FEATURE_DISPLAY
          if (LCD_COLUMNS < 9){
            lcd_center_print_timed("Entr SN", 0, default_display_msg_delay);
          } else {
            lcd_center_print_timed("Enter Serial #", 0, default_display_msg_delay);            
          }      
        #else        
        boop_beep();
        #endif
        usb_keyboard_mode = USB_KEYBOARD_SN_ENTRY;
        user_num_input_places = 4;
        user_num_input_lower_limit = 0;
        user_num_input_upper_limit = 10000;      
        usb_keyboard_special_mode_start_time = millis();      
        break;

      case 0x0a : // CTRL-G
        configuration.keyer_mode = BUG;
        #ifdef FEATURE_DISPLAY
          lcd_center_print_timed("Bug", 0, default_display_msg_delay);
        #endif
        config_dirty = 1;
        break;

      case 0x0b : // CTRL-H
        #ifdef FEATURE_HELL
          if (char_send_mode == CW) {
            char_send_mode = HELL;
            beep();
          } else {
            char_send_mode = CW;
            beep();
          }
        #endif //FEATURE_HELL
        break;

      case 0x0c : // CTRL-I
        if (key_tx && keyer_machine_mode != KEYER_COMMAND_MODE) { //Added check that keyer is NOT in command mode or keyer might be enabled for paddle commands (WD9DMP-1)
          key_tx = 0;
          #ifdef FEATURE_DISPLAY
            lcd_center_print_timed("TX Off", 0, default_display_msg_delay);
          #endif
          
        } else if (!key_tx && keyer_machine_mode != KEYER_COMMAND_MODE) { //Added check that keyer is NOT in command mode or keyer might be enabled for paddle commands (WD9DMP)
          key_tx = 1;
          #ifdef FEATURE_DISPLAY
            lcd_center_print_timed("TX On", 0, default_display_msg_delay);
          #endif      
        }
        break;

      case 0x10: // CTRL-M
        #ifdef FEATURE_FARNSWORTH
          #ifdef FEATURE_DISPLAY
            if (LCD_COLUMNS < 9){
              lcd_center_print_timed("Frns WPM", 0, default_display_msg_delay);
            } else {
              lcd_center_print_timed("Farnsworth WPM", 0, default_display_msg_delay);
            }
          #else          
            boop_beep();
          #endif
          usb_keyboard_mode = USB_KEYBOARD_FARNS_WPM_ADJUST;
          user_num_input_places = 3;
          user_num_input_lower_limit = -1;
          user_num_input_upper_limit = 1000;    
          usb_keyboard_special_mode_start_time = millis();      
        #endif

        break;

