K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      case 0x11 : // CTRL-N
        if (configuration.paddle_mode == PADDLE_NORMAL) {
          configuration.paddle_mode = PADDLE_REVERSE;
          #ifdef FEATURE_DISPLAY
            if (LCD_COLUMNS < 9){
              lcd_center_print_timed("Pdl Rev", 0, default_display_msg_delay);
            } else {
              lcd_center_print_timed("Paddle Reverse", 0, default_display_msg_delay);
            }          
          #endif
        } else {
          configuration.paddle_mode = PADDLE_NORMAL;
          #ifdef FEATURE_DISPLAY
            if (LCD_COLUMNS < 9){
              lcd_center_print_timed("Pdl Norm", 0, default_display_msg_delay);
            } else {
              lcd_center_print_timed("Paddle Normal", 0, default_display_msg_delay);
            }          
          #endif      
        }
        config_dirty = 1;
        break;

      case 0x12 : // CTRL-O - cycle through sidetone modes on, paddle only and off - enhanced by Marc-Andre, VE2EVN  
        if (configuration.sidetone_mode == SIDETONE_PADDLE_ONLY) {
          configuration.sidetone_mode = SIDETONE_OFF;
          #ifdef FEATURE_DISPLAY
            if (LCD_COLUMNS < 9){
              lcd_center_print_timed("ST Off", 0, default_display_msg_delay);
            } else {
              lcd_center_print_timed("Sidetone Off", 0, default_display_msg_delay);
            }
          #endif
          boop();
        } else if (configuration.sidetone_mode == SIDETONE_ON) {
          configuration.sidetone_mode = SIDETONE_PADDLE_ONLY;
          beep();
             myDelay(200);
          beep();
          #ifdef FEATURE_DISPLAY
            if (LCD_COLUMNS < 9){
              lcd_center_print_timed("ST Pdl O", 0, default_display_msg_delay);
            }          
            if (LCD_COLUMNS > 19){
              lcd_center_print_timed("Sidetone Paddle Only", 0, default_display_msg_delay);
            } else {
              lcd_center_print_timed("Sidetone", 0, default_display_msg_delay);
              lcd_center_print_timed("Paddle Only", 1, default_display_msg_delay);
            }
          #endif      
        } else {
          #ifdef FEATURE_DISPLAY
            if (LCD_COLUMNS < 9){
              lcd_center_print_timed("ST On", 0, default_display_msg_delay);
            } else {            
              lcd_center_print_timed("Sidetone On", 0, default_display_msg_delay);
            }
          #endif      
          configuration.sidetone_mode = SIDETONE_ON;
          beep();
        }
        config_dirty = 1;
       break;

        #if defined(FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING)
          case 0x16 :  // CTRL-S
            if (configuration.cmos_super_keyer_iambic_b_timing_on){
              configuration.cmos_super_keyer_iambic_b_timing_on = 0;
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS < 9){
                  lcd_center_print_timed("CMOS Off", 0, default_display_msg_delay);
                }
                if (LCD_COLUMNS > 18){
                  lcd_center_print_timed("CMOS Superkeyer Off", 0, default_display_msg_delay);                  
                } else {            
                  lcd_center_print_timed("CMOS SK Off", 0, default_display_msg_delay);
                }              
              #endif      
            } else {
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS < 9){
                  lcd_center_print_timed("CMOS On", 0, default_display_msg_delay);
                } 
                if (LCD_COLUMNS > 17){
                  lcd_center_print_timed("CMOS Superkeyer On", 0, default_display_msg_delay);                  
                } else {            
                  lcd_center_print_timed("CMOS SK On", 0, default_display_msg_delay);
                }                
              #endif      
              configuration.cmos_super_keyer_iambic_b_timing_on = 1;
            }
            config_dirty = 1;
            break;
        #endif //FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING


      case 0x17 : // CTRL-T
        #ifdef FEATURE_MEMORIES
        repeat_memory = 255;
        #endif
        if (keyboard_tune_on) {
          sending_mode = MANUAL_SENDING;
          tx_and_sidetone_key(0);
          keyboard_tune_on = 0;
          #ifdef FEATURE_DISPLAY
            lcd_status = LCD_REVERT;
          #endif // FEATURE_DISPLAY
        } else {
          #ifdef FEATURE_DISPLAY
            lcd_center_print_timed("Tune", 0, default_display_msg_delay);
          #endif 
          sending_mode = MANUAL_SENDING;     
          tx_and_sidetone_key(1);
          keyboard_tune_on = 1;
        }
        break;

      case 0x18 : // CTRL-U
        if (ptt_line_activated) {
          manual_ptt_invoke = 0;
          ptt_unkey();
          #ifdef FEATURE_DISPLAY
          lcd_status = LCD_REVERT;
          #endif // FEATURE_DISPLAY            
        } else {
          #ifdef FEATURE_DISPLAY
            if (LCD_COLUMNS < 9){
              lcd_center_print_timed("PTTInvke", 0, default_display_msg_delay);
            } else {
              lcd_center_print_timed("PTT Invoke", 0, default_display_msg_delay);
            }
          #endif      
          manual_ptt_invoke = 1;
          ptt_key();
        }
        break;

      case 0x1a : // CTRL-W        
        #ifdef FEATURE_DISPLAY
          if (LCD_COLUMNS < 9){
            lcd_center_print_timed("WPM Adj", 0, default_display_msg_delay);
          } else {
            lcd_center_print_timed("WPM Adjust", 0, default_display_msg_delay);
          }
        #else
          boop_beep();
        #endif
        usb_keyboard_mode = USB_KEYBOARD_WPM_ADJUST;
        user_num_input_places = 3;
        user_num_input_lower_limit = 0;
        user_num_input_upper_limit = 1000;     
        usb_keyboard_special_mode_start_time = millis();   
        break;

      case 0x3a : // CTRL-F1
        switch_to_tx_silent(1);
        #ifdef FEATURE_DISPLAY
          lcd_center_print_timed("TX 1", 0, default_display_msg_delay);
        #endif          
        break;

      case 0x3b : // CTRL-F2
        if ((ptt_tx_2) || (tx_key_line_2)) {
          switch_to_tx_silent(2);           
          #ifdef FEATURE_DISPLAY
            lcd_center_print_timed("TX 2", 0, default_display_msg_delay);
          #endif                      
        }
        break;

      case 0x3c : // CTRL-F3
        if ((ptt_tx_3)  || (tx_key_line_3)) {
          switch_to_tx_silent(3);                      
          #ifdef FEATURE_DISPLAY
            lcd_center_print_timed("TX 3", 0, default_display_msg_delay);
          #endif                                  
        }
        break;

