K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
}
//-------------------------------------------------------------------------------------------------------
#ifdef OPTION_NON_ENGLISH_EXTENSIONS
byte convert_unicode_to_send_char_code(byte first_byte,byte second_byte){


  if (first_byte == 195){
    switch(second_byte){
      case 133: return 197; // Å AA_capital (OZ, LA, SM)
      case 134: return 198; // Æ (OZ, LA)
      case 152: return 216; // Ø (OZ, LA)
      case 128: return 192; // À - A accent   
      case 132: return 196; // Ä - A_umlaut (D, SM, OH, ...)
      case 145: return 209; // Ñ - (EA)               
      case 150: return 214; // Ö – O_umlaut  (D, SM, OH, ...)
      case 146: return 211; // Ò - O accent  
      case 156: return 220; // Ü - U_umlaut     (D, ...)  
      case 135: return 199; // Ç
      case 144: return 208; // Ð
      case 136: return 200; // È
      case 137: return 201; // É
    }

    if (first_byte == 197){
      switch(second_byte){
        case 189: return 142; // Ž
      }
    }

  }

  return(0);

}
#endif

//-------------------------------------------------------------------------------------------------------

void initialize_sd_card(){

  #if defined(FEATURE_SD_CARD_SUPPORT)
    if (!SD.begin(sd_card_spi_ss_line)) {
      #if defined(DEBUG_SD_CARD)
        debug_serial_port->println(F("initialize_sd_card: initialization failed"));
      #endif
      return;
    }

    sd_card_state = SD_CARD_AVAILABLE;

    // This causes a problem with directory listing...
    // if (!SD.exists("/keyer")){
    //  SD.mkdir("/keyer");
    //   #if defined(DEBUG_SD_CARD)
    //     debug_serial_port->println(F("initialize_sd_card: created /keyer"));
    //   #endif      
    // }

    if (SD.exists("/keyer/beacon.txt")){
      sd_card_state = SD_CARD_AVAILABLE_BEACON_FILE_FOUND;
    }

    #if defined(DEBUG_SD_CARD)
      debug_serial_port->println(F("initialize_sd_card: initialization done"));
    #endif  

  #endif //FEATURE_SD_CARD_SUPPORT

}

//-------------------------------------------------------------------------------------------------------
#if defined(FEATURE_SD_CARD_SUPPORT)
void service_sd_card(){

  static unsigned long last_sd_log_file_save = 0;

  if (sd_card_state == SD_CARD_AVAILABLE_BEACON_FILE_RUNNING){
    if (dit_buffer || dah_buffer){
      sd_card_state = SD_CARD_AVAILABLE;
      sdfile.close();
    } else {
      if (send_buffer_bytes == 0){
        if (sdfile.available()){
          add_to_send_buffer(uppercase(sdfile.read()));
        } else {
          sdfile.seek(0);
        }
      }
    }
  }


  if (sd_card_state == SD_CARD_AVAILABLE_BEACON_FILE_FOUND){
    sdfile = SD.open("/keyer/beacon.txt");
    if (sdfile){
      sd_card_state = SD_CARD_AVAILABLE_BEACON_FILE_RUNNING;
    } else {
      sd_card_state = SD_CARD_ERROR;
    }
  }


  if ((sd_card_log_state == SD_CARD_LOG_OPEN) && ((millis() - last_sd_log_file_save) > 60000)){
    sdlogfile.flush();
    last_sd_log_file_save = millis();
  }

}
#endif //FEATURE_SD_CARD_SUPPORT
//-------------------------------------------------------------------------------------------------------
byte is_visible_character(byte char_in){

  if((char_in > 31) || (char_in == 9) || (char_in == 10) || (char_in == 13)){
    return 1;
  } else {
    return 0;
  }

}


//-------------------------------------------------------------------------------------------------------
#if defined(FEATURE_SD_CARD_SUPPORT)
void sd_card_log(String string_to_log,byte byte_to_log){

  char logchar[10];

  if (sd_card_log_state == SD_CARD_LOG_OPEN){
    if (string_to_log.length() > 0){
      string_to_log.toCharArray(logchar,9);
      sdlogfile.print(logchar);
    } else {
      if (is_visible_character(byte_to_log)){
        sdlogfile.write(byte_to_log);
      }
    }
  }



  if ((sd_card_log_state == SD_CARD_LOG_NOT_OPEN) && (sd_card_state == SD_CARD_AVAILABLE)){
    sdlogfile = SD.open("/keyer/keyer.log",FILE_WRITE);
    if (!sdlogfile){
      sd_card_log_state = SD_CARD_LOG_ERROR;
    } else {
      sd_card_log_state = SD_CARD_LOG_OPEN; 
      sdlogfile.println(F("\r\nstart of log "));
      if (configuration.cli_mode == CLI_MILL_MODE_PADDLE_SEND){
        sdlogfile.print(F("TX:"));
        sdlogfile.flush();
      } else {
        sdlogfile.print(F("RX:"));
        sdlogfile.flush();
      }
    }
  }

}
#endif //FEATURE_SD_CARD_SUPPORT

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_SO2R_BASE
void so2r_set_tx() {
  if (so2r_tx == SO2R_TX_1) {
    if (so2r_tx_1) {
      digitalWrite(so2r_tx_1, HIGH);
    }

   if (so2r_tx_2) {
      digitalWrite(so2r_tx_2, LOW);
    }

    current_tx_ptt_line = ptt_tx_1;
    current_tx_key_line = tx_key_line_1;
  }
  else {
    if (so2r_tx_1) {
      digitalWrite(so2r_tx_1, LOW);
    }

   if (so2r_tx_2) {
      digitalWrite(so2r_tx_2, HIGH);
    }

    if (ptt_tx_2) {
        current_tx_ptt_line = ptt_tx_2;
    } else {
        current_tx_ptt_line = ptt_tx_1;
    }
    current_tx_key_line = tx_key_line_2;
  }
}

//-------------------------------------------------------------------------------------------------------

void so2r_set_rx() {
  uint8_t rx;
  if (so2r_latch && (so2r_ptt || (ptt_line_activated && (sending_mode == AUTOMATIC_SENDING)))) {
    if (so2r_tx == 1) {
      rx = 2;
    } else {
      rx = 1;
    }
  }
  else {
    rx = so2r_rx;
  }

  switch (rx) {
    case SO2R_RX_1:
    // Receive on radio 1 only
      if (so2r_rx_1) {
        digitalWrite(so2r_rx_1, HIGH);
      }

      if (so2r_rx_1s) {
        digitalWrite(so2r_rx_1s, HIGH);
      }

      if (so2r_rx_2) {
        digitalWrite(so2r_rx_2, LOW);
      }

      if (so2r_rx_2s) {
        digitalWrite(so2r_rx_2s, LOW);
      }

      if (so2r_rx_s) {
        digitalWrite(so2r_rx_s, LOW);
      }
      break;

    case SO2R_RX_2:
    // Receive on radio 2 only
      if (so2r_rx_1) {
        digitalWrite(so2r_rx_1, LOW);
      }

      if (so2r_rx_1s) {
        digitalWrite(so2r_rx_1s, LOW);
      }

