K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  if (!configuration.backlight_timeout_disable && (state != state_last)) { // do nothing effectively disabling timeout
    if (state) digitalWrite(TFT_BL, 1);  // turn on backlight pin  called by autodim
    else digitalWrite(TFT_BL, 0);  // turn off backlight - called by autodim
    state_last = state;
    #ifdef DEBUG_BACKLIGHT 
      debug_serial_port->printf("tft_backlight: Timeout disabled=%d  state=%d\n", configuration.backlight_timeout_disable, state);
    #endif
  }  // else do nothing, timeout is disabled

  
  static bool last_timeout_disable = 254;
  
  if (last_timeout_disable != configuration.backlight_timeout_disable) {
    last_timeout_disable = configuration.backlight_timeout_disable;
    #ifdef DEBUG_BACKLIGHT
      debug_serial_port->printf("tft_backlight: Timeout disabled change state, now=%d\n", configuration.backlight_timeout_disable);
    #endif
    if (configuration.backlight_timeout_disable) lcd_center_print_timed("Bklight Timer OFF", 1, 2000);
    else lcd_center_print_timed("Bklight Timer ON", 1, 2000);
  }
}

// --------------------------------------------------------------   
#if defined(FEATURE_BT_KEYBOARD)
    #ifndef USE_BT_TASK
     void check_bt_keyboard(void) {
    #elif defined(HARDWARE_ESP32_DEV) || defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)
     void check_bt_keyboard(void * pvParameters) {

        /* The parameter value is expected to be 1 as 1 is passed in the
        pvParameters value in the call to xTaskCreate() below. */

        configASSERT( ( ( uint32_t ) pvParameters ) == 1 );

        while (1)
        {
    #endif    

          #if defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)    
            if (!bt_keyboard.connected()) {              
              connectOrPair();
            }
          #endif

          myDelay(1);
          #if 0 // 0 = scan codes retrieval, 1 = augmented ASCII retrieval  - Not working right Oct 2025
                uint8_t ch = bt_keyboard.wait_for_ascii_char();
                //uint8_t ch = bt_keyboard.get_ascii_char(); // Without waiting

                debug_serial_port->print(F("0x"));
                debug_serial_port->print(ch,HEX); // << std::flush;
                debug_serial_port->print(',');

                if (((ch >= ' ') && (ch < 255)) || ch == '\n' || ch == '\r') 
                {
                    ch = uppercase(ch);
                    //debug_serial_port->print(ch);  // << std::flush;    
                    add_to_send_buffer(ch);
                }
                //else
                //{
                    //if (ch > 0) {
                    //  debug_serial_port->print('['); // << std::flush;
                    //  debug_serial_port->print(ch); // << std::flush;
                    //  debug_serial_port->print(']'); // << std::flush;
                    //}
                //}
                //if (ps2_prosign_flag) {
                //    add_to_send_buffer(SERIAL_SEND_BUFFER_PROSIGN);
                //    ps2_prosign_flag = 0;
                //}
                #ifdef FEATURE_MEMORIES
                    repeat_memory = 255;
                #endif
          #else  // this one has 2 methods, both work the same.
            char ch;
            bool ret = 0;
            bool keyDN = false;
            bool keyUP = false;
            static bool CMD_KEY = false;
            static bool last_key = true;
            uint8_t modifier = 0;
            #ifdef HARDWARE_ESP32_DEV
              TickType_t repeat_period_;
            #else
              uint32_t repeat_period_;
            #endif
            #ifdef HARDWARE_ESP32_DEV
              BTKeyboard::KeyInfo inf;            
            #endif

            #ifdef USE_BT_TASK            
                    TickType_t duration = portMAX_DELAY; // blocking - can wait forever when running inside a task
            #else
                    TickType_t duration = 1;  // bail so we are non-blocking when not runnign in a task
            #endif

              do {                  
                  #if defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_RASPBERRY_PI_PICO)
                    ret = wait_for_low_event(inf, duration);  // 2nd argument is time to wait for chars.  When in own tasks can wait forever, else use 1.
                  #else
                    ret = bt_keyboard.wait_for_low_event(inf, duration);  // 2nd argument is time to wait for chars.  When in own tasks can wait forever, else use 1.
                  #endif
                  //bt_keyboard.get_ascii_char();                                   
                  if (!ret) return;  // there seems to be a lot of junk in the buffer so this is not all used that much                
                  myDelay(1);

                  // if there is delay getting here than can be multiple char arrays.  They are in a buffer, and once read here, the next read is brand new.  
                  //  We have to loop through all chars strings or store all the strings and then loop through them later.
                  // Since here is a timeout, the content of the buffer should be ignored. There is a immediate return when wait is false.

                  // Going to loop through each string until all are done.  The output already goes to a queue for further processing so converting each 
                  // string to a char here won't take long.
                  
                  // For Pico BT, there is only 1 keys array per read.  ESP32 can have multiple keys queued per read.
                  #ifdef DEBUG_BT_KEYBOARD_A     
                    if (inf.size > 2 && inf.size < 9 && inf.keys[2] !=0)  {
                      debug_serial_port->print(" Keys = ");                       
                      for (int n = 0; n < inf.size; n++) {   // print out each char in each keys string                        
                          debug_serial_port->printf("%02X:",inf.keys[n]);                        
                      }
                      debug_serial_port->printf(" Char = %c", inf.keys[2]+0x5D); 
                      debug_serial_port->printf(" Size = %d\n", inf.size);                      
                    }
                  #endif

                  ch = 0;
                  if (inf.size > 2 && inf.size < 9)   //(inf.size == 8 || inf.size == 7 || inf.size == 4 || inf.size == 3) 
                  {                      
                    int k = 0;
                    for (int n = 0; n < inf.size; n++) { 
                      if (inf.keys[n] == 0)
                        k++;
                    }
                    if (k == inf.size) {  // all 0's is Key UP event, skip further work
                      keyUP = true;
                      keyDN = false;
                      //debug_serial_port->println(F(" Key UP"));
                    } else {
                      keyUP = false;  // not Key Up, see if it is a new key 
                    }

                    if (!keyUP && !keyDN) {                      
                      modifier = inf.keys[0];  // capture shift, alt, ctrl state
                      if (inf.size == 8) {
                        // keyboard chars are len = 8, mouse and others are len=4
                        ch = inf.keys[2];  // capture normal keys
                      } else if (inf.size == 7 || inf.size == 4 || inf.size == 3) {  // K380s has only 7 bytes.  1st is missing.
                        // keyboard chars are len = 7
                        ch = inf.keys[1];  // capture normal keys
                      }

                      if (ch == 0) return;

                      if (ch != 0 && !keyDN) {
                        keyDN = true;  // this is a valid alphanumeric key
                        last_active_time = millis();   // reset backlight timer
                        //debug_serial_port->print(F(" Key DN == 0x")); debug_serial_port->println(ch, HEX);
                      }

