K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
                      if (1) // (inf.state != 0) // will only get a new key so much of the above is not required.
                      {
                        #ifdef DEBUG_BT_KEYBOARD_B  // change #ifdef to #ifndef to use
                          debug_serial_port->print(F("[size="));
                          debug_serial_port->print((uint8_t) inf.size);
                          debug_serial_port->print(F("-"));
                          for (int n = 0; n < inf.size; n++) {          
                              debug_serial_port->print(F("0x"));              
                              debug_serial_port->print(inf.keys[n],HEX);
                              debug_serial_port->print(':');
                          }  
                          debug_serial_port->print(F("-M(0x"));
                          debug_serial_port->print((uint8_t) modifier, HEX);
                          debug_serial_port->print(F(")-Char(0x"));
                          debug_serial_port->print((uint8_t) ch,HEX);
                          debug_serial_port->println(F(")] "));
                        #endif
                        
                        #ifdef DEBUG_BT_KEYBOARD_A
                            debug_serial_port->print(F("-0x"));
                            debug_serial_port->print(ch,HEX);  // print our valid char
                            debug_serial_port->print('-');
                        #endif

                        #ifdef Key_LOOKUP_METHOD
                            static char last_ch_;
                            bool caps_lock_ = false;
                            const char shift_trans_dict_[] =
                                "aAbBcCdDeEfFgGhHiIjJkKlLmMnNoOpPqQrRsStTuUvVwWxXyYzZ1!2@3#4$5%6^7&8*9(0)"
                                "\r\r\033\033\b\b\t\t  -_=+[{]}\\|??;:'\"`~,<.>/?"
                                "\200\200"                                          // CAPS LOC
                                "\201\201\202\202\203\203\204\204\205\205\206\206"  // F1..F6
                                "\207\207\210\210\211\211\212\212\213\213\214\214"  // F7..F12
                                "\215\215\216\216\217\217"                          // PrintScreen ScrollLock Pause
                                "\220\220\221\221\222\222\177\177"                  // Insert Home PageUp Delete
                                "\223\223\224\224\225\225\226\226\227\227\230\230"; // End PageDown Right Left Dow Up

                            if (ch >= 4) 
                            {
                                if (modifier & bt_keyboard.CTRL_MASK) {
                                    if (ch < (3 + 26)) {
                                        repeat_period_  = pdMS_TO_TICKS(500);
                                        last_ch_ = (ch - 3);
                                    }
                                } else if (ch <= 0x52) {
                                    // ESP_LOGD(TAG, "Scan code: %d", ch);
                                    if (ch == bt_keyboard.KEY_CAPS_LOCK) caps_lock_ = !caps_lock_;
                                    if (modifier & bt_keyboard.SHIFT_MASK) {
                                        if (caps_lock_) {
                                            repeat_period_  = pdMS_TO_TICKS(500);
                                            last_ch_ = shift_trans_dict_[(ch - 4) << 1];
                                        } else {
                                            repeat_period_  = pdMS_TO_TICKS(500);
                                            last_ch_ = shift_trans_dict_[((ch - 4) << 1) + 1];
                                        }
                                    } else {   // normal keys
                                        if (caps_lock_) {
                                            repeat_period_  = pdMS_TO_TICKS(500);
                                            last_ch_ = shift_trans_dict_[((ch - 4) << 1) + 1];
                                        } else {
                                            repeat_period_  = pdMS_TO_TICKS(500);
                                            last_ch_ = shift_trans_dict_[(ch - 4) << 1];
                                        }
                                    }
                                }
                                debug_serial_port->print(F("<"));
                                debug_serial_port->print(ch);
                                debug_serial_port->print(F(">"));
                                queueadd(ch); 
                                //check_ps2_keyboard();
                                ch = last_ch_;
                                last_ch_ = 0;
                            }
                        #else  // direct key mapping method

                            // inf.keys[0] where
                            // x=0x00 is Normal key
                            // x=0x02 is Left Shift+key
                            // x=0x20 is Right Shift+key
                            // x=0x01 is Left Ctl+key
                            // x=0x10 is Right Ctl+key
                            // x=0x04 is Left Alt+key
                            // x=0x40 is Right Alt+key

                            #ifdef HARDWARE_ESP32_DEV
                              SHIFT_MASK = bt_keyboard.SHIFT_MASK;
                              CTRL_MASK = bt_keyboard.CTRL_MASK;
                              ALT_MASK = bt_keyboard.ALT_MASK;
                            #endif                              
                            
                            if (modifier & CTRL_MASK) // bt_keyboard.SHIFT_MASK) // left or right side key pressed
                            {                                     
                                switch (ch) 
                                {
                                    case 0x04 ... 0x1d: ch = PS2_A_CTRL + (ch-4); break; // convert to lower case letters
                                    case 0x3A ... 0x45: ch = PS2_F1_CTRL + (ch-0x3A); break; // F1-F12 keys
                                    case 0xC6: ch = PS2_F11_CTRL; break; // F1-F12 keys
                                    case 0xC7: ch = PS2_F12_CTRL; break; // F1-F12 keys
                                }
                                //debug_serial_port->print(F("CTRL key = 0x"));
                                //debug_serial_port->println(ch, HEX);
                            }
                            else if (modifier & ALT_MASK) // bt_keyboard.SHIFT_MASK) // left or right side shift key pressed
                            {                                
                                switch (ch) 
                                {
                                    //case 0x04 : ch = 0; s_tone(sidetone_line,configuration.hz_sidetone,0); break; // Alt-b
                                    //case 0x05 : ch = 0; noTone(sidetone_line); break;  // Alt-b                           
                                    case 0x0F : ch = PS2_L_CTRL; break; // backlight timeout
                                    case 0x3A ... 0x45: ch = PS2_F1_ALT + (ch-0x3A); break; // F1-F12 keys
                                    case 0xC6: ch = PS2_F11_ALT; break; // F1-F12 keys
                                    case 0xC7: ch = PS2_F12_ALT; break; // F1-F12 keys
                                    case 0x29 : ch = PS2_ESC; queueflush(); break;  // ALT-C, clear the LCD scrollable area
                                }
                                //debug_serial_port->print(F("ALT key = 0x"));
                                //debug_serial_port->println(ch, HEX);
                            }
                            else if (modifier & SHIFT_MASK) // bt_keyboard.SHIFT_MASK) // left or right side shift key pressed
                            {
                                //debug_serial_port->print(F("SHIFT key  modifier = 0x"));
                                //debug_serial_port->println(modifier, HEX);

