K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
                                switch (ch) {     
                                    case 0x04 ... 0x1d : ch += 0x5D;  // convert to lower case letters
                                                ch = uppercase(ch); 
                                                break;                     
                                    case 0x1e : ch = '!'; break;      // '!'  key
                                    case 0x1f : ch = '@'; break;      // '@'  key
                                    case 0x20 : ch = '#'; break;      // '#'  key
                                    case 0x21 : ch = '$'; break;      // '$'  key
                                    case 0x22 : ch = '%'; break;      // '%'  key
                                    case 0x23 : ch = '^'; break;      // '^'  key
                                    case 0x24 : ch = '&'; break;      // '&'  key
                                    case 0x25 : ch = '*'; break;      // '*'  key                            
                                    case 0x26 : ch = '('; break;      // '('  key
                                    case 0x27 : ch = ')'; break;      // ')'  key
                                    case 0x28 : ch = PS2_ENTER_SHIFT; break; // PgDn key
                                    case 0x2A : ch = PS2_BACKSPACE_SHIFT; break; // PgDn key   
                                    case 0x2B : ch = PS2_TAB_SHIFT; break; // PgDn key                         
                                    case 0x2D : ch = '_'; break;      // '_'  key
                                    case 0x2E : ch = '+'; break;      // '+'  key
                                    case 0x2F : ch = '{'; break;      // '{'  key
                                    case 0x30 : ch = '}'; break;      // '}'  key    
                                    case 0x31 : ch = '|'; break;      // '|' key                        
                                    case 0x33 : ch = ':'; break;      // ':'  key
                                    case 0x34 : ch = '"'; break;      // '"'  key
                                    case 0x36 : ch = '<'; break;      // '<'  key
                                    case 0x37 : ch = '>'; break;      // '>'  key
                                    case 0x38 : ch = '?'; break;      // '?' cursor key
                                    case 0x3A ... 0x45: ch += 85; break; // F1-F12 keys
                                    case 0xC6: ch = PS2_F11_SHIFT; break; // F1-F12 keys
                                    case 0xC7: ch = PS2_F12_SHIFT; break; // F1-F12 keys
                                }
                                //debug_serial_port->print(F("SHIFT key = 0x"));
                                //debug_serial_port->println(ch, HEX);
                            } 
                            else if (modifier == 0) // normal key
                            {
                                //debug_serial_port->print('<');
                                //debug_serial_port->print(ch,HEX);
                                //debug_serial_port->print('>');
                                
                                switch (ch) {
                                    case 0x04 ... 0x1d : ch += 0x5D;  // convert to lower case letters (add 93)
                                                ch = uppercase(ch);
                                                break;
                                    case 0x1e ... 0x26 : ch += 0x13;  // numbers 1-9 (add 19)
                                                if (!isdigit(ch)) ch = 0;
                                                break;
                                    case 0x27 : ch += 0x09;  // number 0
                                                if (!isdigit(ch)) ch = 0;
                                                break;
                                    case 0x28 : ch = PS2_ENTER; break;   // enter key
                                    case 0x29 : ch = PS2_ESC; queueflush(); break;   // ESC key - figure out how to erase a queue or stop senbding with this
                                    case 0x2A : ch = PS2_BACKSPACE; break;   // BACK key
                                    case 0x2B : ch = PS2_TAB; break; // TAB key
                                    case 0x2c : ch = ' '; break;    // space
                                    case 0x2D : ch = '-'; break;    // '-'  key
                                    case 0x2E : ch = '='; break;    // '='  key
                                    case 0x2F : ch = '['; break;    // '['  key                                                  
                                    case 0x30 : ch = '['; break;    // '['  key
                                    case 0x31 : ch = '\\'; break;   // '\' key
                                    case 0x33 : ch = ';'; break;    // ';'  key
                                    case 0x34 : ch = '\''; break;   // '''  key
                                    case 0x36 : ch = ','; break;    // ','  key
                                    case 0x37 : ch = '.'; break;    // '.'  key
                                    case 0x38 : ch = '/'; break;    // '/' cursor key
                                    case 0x39 : ch = 0; break;   // CAP LOCK toggle
                                    case 0x3A ... 0x45: ch += 72; break; // F1-F12 keys (add 0x48)
                                    case 0x49 : ch = PS2_INSERT; break; // End key
                                    case 0x4A : ch = PS2_HOME; break; // Home key
                                    case 0x4C : ch = PS2_DELETE; break; // End key
                                    case 0x4D : ch = PS2_END; break; // End key
                                    case 0x4B : ch = PS2_PAGEUP; break; // PgUp key
                                    case 0x4E : ch = PS2_PAGEDOWN; break; // PgDn key
                                    case 0x4F : ch = PS2_LEFTARROW; break;   // right cursor key
                                    case 0x50 : ch = PS2_RIGHTARROW; break;   // left cursor key
                                    case 0x51 : ch = PS2_DOWNARROW; break;   // down cursor key
                                    case 0x52 : ch = PS2_UPARROW; break;   // up cursor key
                                    //case 0x53 : ch = BT_SCROLL; break;   // No Scroll on BT keyboards so far
                                    default   : break; //debug_serial_port->print(ch);   // filter out key up events
                                }  // end switch ch
                            } 
                            else  ch = 0;

                        #endif // WORKING CODE

                        #ifdef DEBUG_BT_KEYBOARD_B
                            debug_serial_port->print(' ');
                            debug_serial_port->print(ch);  // print our valid char
                            debug_serial_port->print('\n');
                        #endif
                        /*
                        switch (ch) 
                        {
                            case PS2_RIGHTARROW : adjust_dah_to_dit_ratio(int(configuration.dah_to_dit_ratio/10)); break;
                            case PS2_LEFTARROW : adjust_dah_to_dit_ratio(-1*int(configuration.dah_to_dit_ratio/10)); break;
                            case PS2_UPARROW : speed_set(configuration.wpm+1); break;
                            case PS2_DOWNARROW : speed_set(configuration.wpm-1); break;
                            case PS2_ESC: CMD_KEY = false; debug_serial_port->println(F("< Exiting CLI mode >")); break;
                            case PS2_TAB:
                                if (pause_sending_buffer) {
                                pause_sending_buffer = 0;
                                #ifdef FEATURE_DISPLAY
                                    #ifdef OPTION_MORE_DISPLAY_MSGS
                                    lcd_center_print_timed("Resume", 0, default_display_msg_delay);
                                    #endif
                                #endif                 
                                } else {
                                pause_sending_buffer = 1;
                                #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("Pause", 0, default_display_msg_delay);
                                #endif            
                                }
                            break;  // pause
                            default:  break;
                            {
                                //  process the rest of the keys
                                if (!CMD_KEY && (((ch != '\\') && (ch >= ' ') && (ch < 127)) || (ch == '\n') || (ch == '\r'))) {
                                    //if (ps2_prosign_flag) {
                                    //    add_to_send_buffer(SERIAL_SEND_BUFFER_PROSIGN);
                                    //    ps2_prosign_flag = 0;
                                    //}
                                    ch = uppercase(ch);
                                    add_to_send_buffer(ch);
                                
                                    #ifdef FEATURE_MEMORIES
                                        repeat_memory = 255;
                                    #endif
                                }
                                else if (CMD_KEY || ch > 126 || ch == '\\') {  // function key and ALT, CTRL, and special keys
                                    debug_serial_port->print(F("< Special key = "));
                                    
                                    if (ch == '\\'){
                                        debug_serial_port->println(F("Command Line Key Pressed.  To exit press ESC key"));
                                        CMD_KEY = true;  // command line interface will need to set this to false to allow CW to resume
                                    }
                                    else {
                                        debug_serial_port->print(ch, DEC);   
                                        debug_serial_port->println(F(" >"));
                                    }
                                }
                            }  // end of default
                        }  // ens of switch
                        */

                        if (ch != 0) queueadd(ch);   // add char to the queue                          
                        #ifdef DEBUG_BT_KEYBOARD_A
                            debug_serial_port->print(F("["));
                            if (queueempty())
                                debug_serial_port->print(F("Q Empty\n")); 
                            else
                                debug_serial_port->print(F("Q NOT Empty\n"));
                            //debug_serial_port->print(queuepop());
                            debug_serial_port->print(F("],"));
                        #endif
                        ch = 0;                    
                      }  // end of valid keystroke
                    }
                  }  // inf size 7 or 8
                  last_key = keyDN;
                  keyDN = false;
                ch = 0;
              myDelay(5); 
            } while (ret);
          #endif
          #ifdef USE_BT_TASK
          } // for ever
          #endif
    } // check_bt_keyboard
#endif // FEATURE_BT_KEYBOARD

