K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    while(1) {   // Do screen work here

      //TextBoxTest(&dev, fx32G, CONFIG_WIDTH, CONFIG_HEIGHT);
			//WAIT;

        // Multi Font Test
      uint16_t color;
      uint8_t ascii[40];
      uint16_t margin = 10;
      lcdFillScreen(&dev, BLACK);
      color = WHITE;
      lcdSetFontDirection(&dev, 0);
      uint16_t xpos = 0;
      uint16_t ypos = 15;
      int xd = 0;
      int yd = 1;
      if(CONFIG_WIDTH < CONFIG_HEIGHT) {
        lcdSetFontDirection(&dev, 1);
        xpos = (CONFIG_WIDTH-1)-16;
        ypos = 0;
        xd = 1;
        yd = 0;
      }
      strcpy((char *)ascii, "16Dot Gothic Font");
      lcdDrawString(&dev, fx16G, xpos, ypos, ascii, color);

      xpos = xpos - (24 * xd) - (margin * xd);
      ypos = ypos + (16 * yd) + (margin * yd);
      strcpy((char *)ascii, "24Dot Gothic Font");
      lcdDrawString(&dev, fx24G, xpos, ypos, ascii, color);

      xpos = xpos - (32 * xd) - (margin * xd);
      ypos = ypos + (24 * yd) + (margin * yd);
      if (CONFIG_WIDTH >= 240) {
        strcpy((char *)ascii, "32Dot Gothic Font");
        lcdDrawString(&dev, fx32G, xpos, ypos, ascii, color);
        xpos = xpos - (32 * xd) - (margin * xd);;
        ypos = ypos + (32 * yd) + (margin * yd);
      }

      xpos = xpos - (10 * xd) - (margin * xd);
      ypos = ypos + (10 * yd) + (margin * yd);
      strcpy((char *)ascii, "16Dot Mincyo Font");
      lcdDrawString(&dev, fx16M, xpos, ypos, ascii, color);

      xpos = xpos - (24 * xd) - (margin * xd);;
      ypos = ypos + (16 * yd) + (margin * yd);
      strcpy((char *)ascii, "24Dot Mincyo Font");
      lcdDrawString(&dev, fx24M, xpos, ypos, ascii, color);

      if (CONFIG_WIDTH >= 240) {
        xpos = xpos - (32 * xd) - (margin * xd);;
        ypos = ypos + (24 * yd) + (margin * yd);
        strcpy((char *)ascii, "32Dot Mincyo Font");
        lcdDrawString(&dev, fx32M, xpos, ypos, ascii, color);
      }
      lcdDrawFinish(&dev);
      lcdSetFontDirection(&dev, 0);
      WAIT;
    }

    // never reach here
	  while (1) {
		  myDelay(5000);
	  }
}

static void listSPIFFS(char * path) {
	DIR* dir = opendir(path);
	assert(dir != NULL);
	while (true) {
    myDelay(1);
		struct dirent*pe = readdir(dir);
		if (!pe) break;
		ESP_LOGI(__FUNCTION__,"d_name=%s d_ino=%d d_type=%x", pe->d_name,pe->d_ino, pe->d_type);
	}
	closedir(dir);
}

esp_err_t mountSPIFFS(char * path, char * label, int max_files) {
	esp_vfs_spiffs_conf_t conf = {
		.base_path = path,
		.partition_label = label,
		.max_files = (size_t) max_files,
		.format_if_mount_failed = true
	};

	// Use settings defined above to initialize and mount SPIFFS filesystem.
	// Note: esp_vfs_spiffs_register is an all-in-one convenience function.
	esp_err_t ret = esp_vfs_spiffs_register(&conf);

	if (ret != ESP_OK) {
		if (ret ==ESP_FAIL) {
			ESP_LOGE(TAG, "Failed to mount or format filesystem");
		} else if (ret== ESP_ERR_NOT_FOUND) {
			ESP_LOGE(TAG, "Failed to find SPIFFS partition");
		} else {
			ESP_LOGE(TAG, "Failed to initialize SPIFFS (%s)",esp_err_to_name(ret));
		}
		return ret;
	}

#if 0
	ESP_LOGI(TAG, "Performing SPIFFS_check().");
	ret = esp_spiffs_check(conf.partition_label);
	if (ret != ESP_OK) {
		ESP_LOGE(TAG, "SPIFFS_check() failed (%s)", esp_err_to_name(ret));
		return ret;
	} else {
			ESP_LOGI(TAG, "SPIFFS_check() successful");
	}
#endif

	size_t total = 0, used = 0;
	ret = esp_spiffs_info(conf.partition_label, &total, &used);
	if (ret != ESP_OK) {
		ESP_LOGE(TAG,"Failed to get SPIFFS partition information (%s)",esp_err_to_name(ret));
	} else {
		ESP_LOGI(TAG,"Mount %s to %s success", path, label);
		ESP_LOGI(TAG,"Partition size: total: %d, used: %d", total, used);
	}

	return ret;
}

void initialize_st7789_lcd()
{
    ESP_LOGI(TAG, "Initializing SPIFFS");
    // Maximum files that could be open at the same time is 7.
    ESP_ERROR_CHECK(mountSPIFFS((char *) "/fonts", (char *) "storage1", 7));
    listSPIFFS((char *) "/fonts/");

    // Maximum files that could be open at the same time is 1.
    ESP_ERROR_CHECK(mountSPIFFS((char *) "/icons", (char *) "storage2", 1));
    listSPIFFS((char *) "/icons/");

    xTaskCreate(ST7789, "ST7789", 1024*6, NULL, 2, NULL);
}
#endif

#ifdef FEATURE_TFT_DISPLAY
  #if defined(CAL_TOUCH2)
    #define CALIBRATION_FILE "/calibrationData"
    #include "FS.h"
  #endif

  void initialize_TFT_display(void) 
  {
    //xMutex = xSemaphoreCreateMutex();  // crete a mutex object

    #ifdef FEATURE_M5STACK_CORE2
        //lcd.setRotation(1);
        //lcd.invertDisplay(true);
        //initialize_m5stack_core2();
        // h and w are defined as 320 and 240 globally.  Crashes when calling height() or width() functions.            
    #else
        lcd.init();  // init the st7789 based ideaspark tft lcd on ESP32-WROOM module
        //lcd.invertDisplay(1);
        lcd.setRotation(3);  //3 for most displays
        
        #ifdef FEATURE_TOUCH_DISPLAY    
          #if defined(CAL_TOUCH1)
            uint16_t calibrationData[5] = {304, 3548, 145, 3600, 1};  // plug in results of cal below
            
            // *******************   Used to calibrate a touch screen - required for Hosyond 3.5" TFT
            // Calibrate the touch screen and retrieve the scaling factors
            lcd.calibrateTouch(calibrationData, TFT_WHITE, TFT_RED, 15);
            /*
            // Replace above line with the code sent to Serial Monitor
            // once calibration is complete, e.g.:
            uint16_t calData[5] = { 286, 3534, 283, 3600, 6 };
            tft.setTouch(calData);
            */
            while(1) {
              myDelay(1000);
              // Clear the screen
              lcd.fillScreen(TFT_BLACK);
              lcd.setTextColor(TFT_WHITE, TFT_BLACK);  
              lcd.setTextSize(2);
              lcd.drawCentreString("Touch screen to test!",lcd.width()/2, lcd.height()/2, 2);
              for (int i=0; i< 5; i++) {
                debug_serial_port->print(calibrationData[i]);
                debug_serial_port->print(" ");
              }  
              debug_serial_port->println("");
            }

            // *******************   Used to calibrate a touch screen - required for Hosyond 3.5" TFT
          
          #elif defined(CAL_TOUCH2)
            uint16_t calibrationData[5] = {};
            uint8_t calDataOK = 0;
            lcd.setRotation(3);
            lcd.fillScreen((0xFFFF));
            lcd.setCursor(20, 0, 2);
            lcd.setTextColor(TFT_BLACK, TFT_WHITE);  
            lcd.setTextSize(2);
            //lcd.println("  calibration run");
            debug_serial_port->println("Touch calibration Mode");
                          
            // check file system
            if (!SPIFFS.begin()) {
              debug_serial_port->println("formatting file system");

              SPIFFS.format();
              SPIFFS.begin();
            }
            
