K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
            // check if calibration file exists
            if (SPIFFS.exists(CALIBRATION_FILE)) {
              fs::File f = SPIFFS.open(CALIBRATION_FILE, "r");
              if (f) {
                debug_serial_port->println("Cal file exists");
                if (f.readBytes((char *)calibrationData, 14) == 14) {
                  calDataOK = 1;
                  debug_serial_port->println("Cal file data OK");
                }
                f.close();
              }
            }
            if (!calDataOK) {
              // calibration data valid
              debug_serial_port->println("Cal file data OK, start calibration");
              lcd.setTouch(calibrationData);
            } else {
              // data not valid. recalibrate
              debug_serial_port->println("Cal file data NOT OK, recalibrate");
              lcd.calibrateTouch(calibrationData, TFT_WHITE, TFT_RED, 15);
              // store data
              debug_serial_port->println("Store Cal data");
              fs::File f = SPIFFS.open(CALIBRATION_FILE, "w");
              if (f) {
                f.write((const unsigned char *)calibrationData, 14);
                f.close();
                debug_serial_port->printf("Cal file data Stored - x:%d x1:%d y:%d y1:%d bits=0x%X\n", calibrationData[0], calibrationData[1], calibrationData[2], calibrationData[3], calibrationData[4]);
              }
            }
            lcd.fillScreen((0xFFFF));
            
            while(1) {
              uint16_t x, y;
              static uint16_t color;

              if (lcd.getTouch(&x, &y)) {

                lcd.setCursor(25, 20, 2);
                lcd.printf("x: %i     ", x);
                lcd.setCursor(25, 70, 2);
                lcd.printf("y: %i    ", y);

                lcd.drawPixel(x, y, color);
                color += 155;
              }
            }           
          
          // *****************
          #elif defined(CAL_TOUCH) || defined(SET_CAL)
                /*  params are x, x1, y, y1, and rotate=bit0, invertx=bit1, inverty=bit2
                touchCalibration_rotate = parameters[4] & 0x01;
                touchCalibration_invert_x = parameters[4] & 0x02;
                touchCalibration_invert_y = parameters[4] & 0x04;
                */
            uint16_t calibrationData[5] = {TOUCH_X, TOUCH_X1, TOUCH_Y, TOUCH_Y1, TOUCH_BITS};  // My own results are pretty good.
            // can run this to cal at startup.
            #ifdef CAL_TOUCH
              lcd.calibrateTouch(calibrationData, TFT_WHITE, TFT_RED, 15);
            #endif
            debug_serial_port->printf("Cal data - x:%d x1:%d y:%d y1:%d bits=0x%X\n", calibrationData[0], calibrationData[1], calibrationData[2], calibrationData[3], calibrationData[4]);
            lcd.setTouch(calibrationData);              
          #endif
        #endif
    #endif
    lcd.fillScreen(TFT_BLACK);  
    lcd.setTextDatum(MY_DATUM); // Centre text on x,y position
    // Set up new screen and draw status bar and icons in it
    lcd.setTextColor(TFT_GREY, TFT_BLACK);
    //lcd.setFreeFont(FM9);
    lcd.setTextFont(STATUS_BAR_FONT);  // &fonts::FreeMonoBold12pt7b)
    lcd.drawString("00:00:00", SCROLL_TEXT_LEFT_SIDE-6, STATUS_BAR_Y_CURSOR);  
    lcd.setTextColor(TFT_RED);
    lcd.drawRoundRect(0, 0, SCREEN_WIDTH, SCREEN_BOX_HEIGHT, 6, TFT_RED);
    lcd.drawFastHLine(0, SCROLL_BOX_TOP-2, SCREEN_WIDTH, TFT_RED);
    lcd.drawFastHLine(0,SCROLL_BOX_TOP-1, SCREEN_WIDTH, TFT_RED);
    //lcd.setTextWrap(false, false);                         // turn off text wrap, else will overwrite the borders
    lcd.setTextWrap(true, true);                         // turn off text wrap, else will overwrite the borders
    lcd.setTextColor(TFT_WHITE,TFT_BLACK);
    // now updae scroll box area with satus messages and eventually CW text to send
   
    //  Some possibly useful draw functions
    //lcd.setAddrWindow(10, 31, 316, 166);
    // Test some print formatting functions
    //float fnumber = 123.45;
    // Set the font colour to be blue with no background, set to font 4
    ////lcd.setTextColor(TFT_BLUE, true);    lcd.setTextFont(4);
    //lcd.print(F("Float = ")); lcd.println(fnumber);           // Print floating point number
    //lcd.print(F("Binary = ")); lcd.println((int)fnumber, BIN); // Print as integer value in binary
    //lcd.print(F("Hexadecimal = ")); lcd.println((int)fnumber, HEX); // Print as integer number in Hexadecimal

    //lcd.setCursor(SCROLL_TEXT_LEFT_SIDE, SCROLL_TEXT_TOP_LINE);
    //lcd.setTextColor(TFT_WHITE,TFT_BLACK);  
    //lcd.setTextFont(4); //&fonts::FreeMonoBold12pt7b)
    //lcd.setTextDatum(MY_DATUM); // Centre text on x,y position
    //lcd.setFreeFont(TFT_FONT_MEDIUM);
  }
#endif

#ifdef FEATURE_BT_KEYBOARD
  void BT_Keyboard_Status(void)
  {
      //ToDo: Set up as a periodic scan for reconnect or new keyboard
      if (BT_Keyboard_Lost == true) {
          if (Keyboard_Disconnected_signal) {                
              debug_serial_port->println(F("Lost BT Keyboard Connection"));                
              #ifdef FEATURE_DISPLAY
                //clear_display_row(1);
                lcd_center_print_timed("Lost Connection", 2, 3000);
              #endif
              Keyboard_Disconnected_signal = false;
          }
      }
      else{
          if (Keyboard_Connected_signal) {
              #ifdef FEATURE_DISPLAY
                lcd_center_print_timed("Keyboard Connected", 1, 3000);
                //clear_display_row(1);
              #endif                
              debug_serial_port->println(F("BT Keyboard Connected"));
              Keyboard_Connected_signal = false;
          }
      }
  }
#endif

#ifdef FEATURE_GPS
// Process NMEA data to extract position an time, calculates grid sqaure
// Using TinyGPSPlus_ESP32 library to get lat, lon and time
// Additional functions to calculate maidenhead grid square

// reverses a string 'str' of length 'len' 
void reverse(char *str, int len) 
{ 
    int i=0, j=len-1, temp; 
    while (i<j) 
    { 
        temp = str[i]; 
        str[i] = str[j]; 
        str[j] = temp; 
        i++; j--; 
    } 
} 

