K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
// Converts a given integer x to string str[].  d is the number 
// of digits required in output. If d is more than the number 
// of digits in x, then 0s are added at the beginning. 
int intToStr(int x, char str[], int d) 
{ 
    int i = 0; 
    while (x) 
    { 
        str[i++] = (x%10) + '0'; 
        x = x/10; 
    } 
  
    // If number of digits required is more, then 
    // add 0s at the beginning 
    while (i < d) 
        str[i++] = '0'; 
  
    reverse(str, i); 
    str[i] = '\0'; 
    return i; 
} 

// Converts a floating point number to string. 
void ftoa(float n, char *res, int afterpoint) 
{ 
    // Extract integer part 
    int ipart = (int)n; 
  
    // Extract floating part 
    float fpart = n - (float)ipart; 
  
    // convert integer part to string 
    int i = intToStr(ipart, res, 0); 
  
    // check for display option after point 
    if (afterpoint != 0) 
    { 
        res[i] = '.';  // add dot 
  
        // Get the value of fraction part upto given no. 
        // of points after dot. The third parameter is needed 
        // to handle cases like 233.007 
        fpart = fpart * pow(10, afterpoint); 
  
        intToStr((int)fpart, res + i + 1, afterpoint); 
    } 
}

/*
* The algorithm is fairly straightforward. The scaling array provides divisors to divide up the space into the required number of sections,
* which is 18 for for the field, 10 for the square, 24 for the subsquare, 10 for the extended square, then 24, then 10. 
* The limit is 6 pairs which is 2 more than is used even in the most detailed versions (8 characters in all). 
* The divisor is also used in the fmod function to narrow down the range to the next highest order square that we’re dividing up.
* The scaling array could be precalculated, but I figure the optimizing compiler would take care of that. 
* I also thought the values could be scaled up at the beginning of the function, then use integer arithmetic to do the conversion. 
* It might be a bit faster.
*
*/

/*
To run it “./geo lat long”, e.g. “./geo 43.999 -79.495” which yields FN03gx09
*/

/*  Parse the GPS NMEA ASCII GPGGA string for the time, latitude and longitude  */

//---------------------------------------------------------------------------------------------------------

int positionToMaidenhead(char m[])
{

    const int pairs=4;
    const double scaling[]={360.,360./18.,(360./18.)/10., \
    ((360./18.)/10.)/24.,(((360./18.)/10.)/24.)/10., \
    ((((360./18.)/10.)/24.)/10.)/24., \
    (((((360./18.)/10.)/24.)/10.)/24.)/10.};
    int i;
    int index;

    for (i=0;i<pairs;i++)
    {
        index = (int)floor(fmod((180.0+p->longitude), scaling[i])/scaling[i+1]); 
        m[i*2] = (i&1) ? 0x30+index : (i&2) ? 0x61+index : 0x41+index;
        index = (int)floor(fmod((90.0+p->latitude), (scaling[i]/2))/(scaling[i+1]/2));
        m[i*2+1] = (i&1) ? 0x30+index : (i&2) ? 0x61+index : 0x41+index;
    }
    m[pairs*2]=0;
    return 1;  // success
}

//  Convert Lat and Lon to MH Grid Sqaure
int Convert_to_MH(char gps_grid[])
{
    char m[9];

   // if(GPS_Status == GPS_STATUS_LOCK_INVALID || msg_Complete == 0)   
   //     return 1;  /* if we are here with invalid data then exit.  LAt and LOnwill have text which cannot be computered of cour     */
    /*  Get from GPS Serial input later */
    p->latitude = gps.location.lat();
    p->longitude = gps.location.lng();

    if (positionToMaidenhead(m))
    {   
        strncpy(gps_grid,m,8);
        gps_grid[8] = '\0';
        return 1;  // Success               
    }
    else
    {
        strcpy(gps_grid,"");
        return 0; // fail      /*  Can use later to skip displaying anything when have invalid or no GPS input   */
    }
}

#ifdef GPS_TEST
#include "nmea.h"  // has simulated NMEA strings for testing
void displayInfo()
{
  debug_serial_port->print(F("Location: ")); 

  //if (gps.location.isUpdated())
  if (gps.location.isValid())
  {
    Convert_to_MH(grid_sq_str);
    debug_serial_port->print(F("Grid Square = "));
    debug_serial_port->println(grid_sq_str);
    debug_serial_port->print(gps.location.lat(), 6);
    debug_serial_port->print(F(","));
    debug_serial_port->println(gps.location.lng(), 6);
    debug_serial_port->print(F("LOCATION   Fix Age="));
    debug_serial_port->print(gps.location.age());
    debug_serial_port->print(F("ms Raw Lat="));
    debug_serial_port->print(gps.location.rawLat().negative ? "-" : "+");
    debug_serial_port->print(gps.location.rawLat().deg);
    debug_serial_port->print("[+");
    debug_serial_port->print(gps.location.rawLat().billionths);
    debug_serial_port->print(F(" billionths],  Raw Long="));
    debug_serial_port->print(gps.location.rawLng().negative ? "-" : "+");
    debug_serial_port->print(gps.location.rawLng().deg);
    debug_serial_port->print("[+");
    debug_serial_port->print(gps.location.rawLng().billionths);
    debug_serial_port->print(F(" billionths],  Lat="));
    debug_serial_port->print(gps.location.lat(), 6);
    debug_serial_port->print(F(" Long="));
    debug_serial_port->println(gps.location.lng(), 6);
  }
  else
  {
    debug_serial_port->print(F("INVALID"));
  }

  debug_serial_port->print(F("  Date/Time: "));
  //if (gps.date.isUpdated())
  if (gps.date.isValid())
  {
    debug_serial_port->print(gps.date.month());
    debug_serial_port->print(F("/"));
    debug_serial_port->print(gps.date.day());
    debug_serial_port->print(F("/"));
    debug_serial_port->print(gps.date.year());
  }
  else
  {
    debug_serial_port->print(F("INVALID"));
  }

  debug_serial_port->print(F(" "));
  //if (gps.time.isUpdated())
  if (gps.time.isValid())
  {
    if (gps.time.hour() < 10) debug_serial_port->print(F("0"));
    debug_serial_port->print(gps.time.hour());
    debug_serial_port->print(F(":"));
    if (gps.time.minute() < 10) debug_serial_port->print(F("0"));
    debug_serial_port->print(gps.time.minute());
    debug_serial_port->print(F(":"));
    if (gps.time.second() < 10) debug_serial_port->print(F("0"));
    debug_serial_port->print(gps.time.second());
    debug_serial_port->print(F("."));
    if (gps.time.centisecond() < 10) debug_serial_port->print(F("0"));
    debug_serial_port->print(gps.time.centisecond());
  }
  else
  {
    debug_serial_port->print(F("INVALID"));
  }
  debug_serial_port->println();
}
#endif

#endif  // FEATURE_GPS

//void check_gps(void * pvParameters)
void check_gps(bool force_update, bool ignore_gps) {
  #ifdef FEATURE_GPS
    static uint32_t lost_gps_timer = 0;
    bool _do_process = false;
    char gps_grid[9];
    struct tm timeinfo;

