K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    #ifdef DEBUG_GPS_X
      debug_serial_port->print("Check GPS.  Ignore (0=Use, 1=ignore) : ");debug_serial_port->println(configuration.ignore_gps);
    #endif

    if (ptt_line_activated) return;  // do not interrupt CW send timing

    if (ignore_gps) {
      if (!configuration.ignore_gps) {
        configuration.ignore_gps = true;   // toggle gps usage off
        #ifdef FEATURE_DISPLAY
          lcd_center_print_timed("Toggle GPS OFF", 0, default_display_msg_delay);
        #endif
      } else {
        configuration.ignore_gps = false;  // toggle gps usage back on        
        #ifdef FEATURE_DISPLAY
          lcd_center_print_timed("Toggle GPS ON", 0, default_display_msg_delay);        
        #endif
      }
      config_dirty = 1;  // changed ignore_gps in struct memory
      #ifdef DEBUG_GPS
        debug_serial_port->print("Ignore GPS=");debug_serial_port->println(configuration.ignore_gps);
      #endif
    }   
    uint8_t gps_hour = 0;
    uint8_t gps_minute = 0;
    uint8_t gps_second = 0;  
    
    #ifdef GPS_TEST
      // choose one of the 2 below to simulate NMEA data from either grid square
      //auto gpsStream = gpsStream_EM10;
      auto gpsStream = gpsStream_CN87;

      while (*gpsStream) {
        if (gps.encode(*gpsStream++)) {
          //displayInfo();          
          if (gps.location.isValid()) {
            //debug_serial_port->print(F("Grid Square = ")); debug_serial_port->println(grid_sq_str);
            stop_msg = false;
          }
        }
      }
    #else
      while (gps_serial_port.available() > 0) {
        char c;
        int d;
        
        #ifdef DEBUG_GPS
          c = d = gps_serial_port.peek();   // if gibbersh then baud rate likely wrong, skip read and force a timeout  
          debug_serial_port->print(c);
        #endif

        //if (isAlphaNumeric(c) || ispunct(c) || c == '\r' || c == '\n') {  // valid data at correct baud rate
          gps.encode(gps_serial_port.read());
          #ifdef DEBUG_GPS_X
            debug_serial_port->print(".");
          #endif
          stop_msg = false;
          lost_gps_timer = millis();
        //} else {
        //  gps_serial_port.read();
        //}
      }
    #endif

      if (gps.time.isValid() && gps.time.isUpdated())
      {
          if (gps.date.isUpdated()){              // set system time for log output
            timeinfo.tm_year = gps.date.year() - 1900;
            timeinfo.tm_mon  = gps.date.month() - 1;
            timeinfo.tm_mday = gps.date.day();
            timeinfo.tm_hour = gps.time.hour();
            timeinfo.tm_min  = gps.time.minute();
            timeinfo.tm_sec  = gps.time.second();
            time_t t = mktime(&timeinfo);
            struct timeval now = { .tv_sec = t };
            settimeofday(&now, NULL); // Set ESP32 system time
            #ifdef DEBUG_GPS
              debug_serial_port->printf("Setting time (UTC): %s", asctime(&timeinfo));
            #endif
          }

          gps_hour = gps.time.hour();
          gps_minute = gps.time.minute();
          gps_second = gps.time.second();
          sprintf(time_str, "%02d:%02d:%02d", gps_hour, gps_minute, gps_second);
          stop_msg = false;
          #ifdef DEBUG_GPS
            debug_serial_port->print(F("check_gps: time = ")); debug_serial_port->println(time_str);
          #endif
      } else {
        if (!gps.time.isValid()) stop_msg = true;
      }

      if (gps.location.isValid() && gps.location.isUpdated()) {
        Convert_to_MH(gps_grid);
        if (strcmp(gps_grid, configuration.GPS_GridSq) != 0) { 
          strcpy(configuration.GPS_GridSq, gps_grid);         // if grid changed, store it in EEPROM
          config_dirty = 1;
        }
        stop_msg = false;
        #ifdef DEBUG_GPS
          debug_serial_port->print(F("check_gps: Grid Square = ")); debug_serial_port->println(configuration.GPS_GridSq); 
        #endif
        _do_process = true;
      } else {
        if (!gps.location.isValid()) stop_msg = true;
      }

    #ifndef GPS_TEST
      if (!stop_msg && (millis() > (lost_gps_timer + 5000))) //&& gps.charsProcessed() < 10)
      {        
        debug_serial_port->println(F("No GPS detected: Check wiring."));
        if (!stop_msg) _do_process = true;  // comment out to leave the last known grid up rather than fall back to default file config grid  
        strcpy(gps_grid, "");
        stop_msg = true;
        lost_gps_timer = millis();      
      } 
    #endif

    if (_do_process) {
      #ifdef DEBUG_GPS
        debug_serial_port->print(F("check_gps: Continue on to Process Grid Square = ")); debug_serial_port->println(configuration.GPS_GridSq); 
      #endif
      do_process = true;
      process_gps(gps_grid, force_update, 1);   // 1 = GPS source
    }
    
  #endif
}

// validate 0, or 4-8 character grid square from multiple sources.
// input *grid
// returns value in grid[], possibly fizxed up or null if invalid
int validate_grid(const char * input_grid, char grid[]) {
  int i;
  int len = strlen(input_grid);
  if (len > 0) {    // minimum grid is 4 places, max is 8 places.
    for (i=0; i < len; i++) {
      if (isAlphaNumeric(input_grid[i])) {
        grid[i] = input_grid[i];
      } else {
        grid[i] = '\0';  // replace bad data with null
      }
      if (i >= 8) {       
        break;
      }         
    } 
    
    grid[i] = '\0'; // terminate the string at max 8 places and exit.

    len = strlen(grid);
    if (len < 4 || len > 8) { // detect bad digits in middle (will have '\0').  Should have digits == len 
      strcpy(grid, "");
      len = 0;
      //debug_serial_port->println(F("Empty or Invalid entry. Grid is set to empty"));
    } 
    
    //debug_serial_port->print(F("Validate_grid: Grid = ")); debug_serial_port->println(grid);
  }   // done, have a validated grid, could be ""
  return len;
}

void process_gps(char * memory_str, bool force_update, uint8_t source) {
  static char last_grid_sq_str[GRIDSQUARE_LEN] = "";
  static uint8_t last_source = 0;
  bool update_flag;
  //char * grid_ptr;
  
  if (!do_process) return;
  do_process = false;

  #ifdef DEBUG_GPS
    debug_serial_port->print(F("\nProcess_gps: Function Input    = ")); debug_serial_port->print(memory_str); 
    debug_serial_port->print(F("  Source = ")); debug_serial_port->println(source); 
    debug_serial_port->print(F("Process_gps: Grid (current)    = ")); debug_serial_port->println(grid_sq_str);
    debug_serial_port->print(F("Process_gps: Grid FILE value   = ")); debug_serial_port->println(default_grid);
    debug_serial_port->print(F("Process_gps: Grid GPS value    = ")); debug_serial_port->println(configuration.GPS_GridSq);
    debug_serial_port->print(F("Process_gps: Grid Memory value = ")); debug_serial_port->println(configuration.Mem_GridSq);
    debug_serial_port->print(F("Process_gps: Current Source (0 file, 1 EEPROM, 3 memory) = ")); debug_serial_port->println(configuration.GridSq_source);
  #endif

  // Source Priority Ladder.  Favor memory over GPS over config file
  update_flag = 0;
  if (configuration.GridSq_source < 2 && source == 2 && strlen(memory_str) >=4) {configuration.GridSq_source = 2; update_flag = 1;}
  else if (configuration.GridSq_source < 1 && source == 1 && strlen(memory_str) >=4) {configuration.GridSq_source = 1; update_flag = 1;}
  
  if (update_flag) {
    config_dirty = 1;
    debug_serial_port->print(F("*Process_gps: New Source (0 file, 1 EEPROM, 2 memory) = ")); debug_serial_port->println(configuration.GridSq_source);
  }

  // use the current source to update the global grid value
  // if the new grid is empty, use the next lowest source
  last_source = configuration.GridSq_source;
  switch (configuration.GridSq_source) {
    case 2 :  if (strlen(memory_str) >= 4) {
                  strcpy(grid_sq_str, configuration.Mem_GridSq);
                  break;
              } 
              __attribute__((fallthrough)); // No warning // fall through if grid is empty
    case 1 :  if (strlen(memory_str) >= 4) {
                  strcpy(grid_sq_str, configuration.GPS_GridSq);
                  configuration.GridSq_source = 1;  // update new source
                  break;
              }
              __attribute__((fallthrough)); // No warning // fall through if grid is empty
    case 0 : strcpy(grid_sq_str, default_grid); 
             configuration.GridSq_source = 0;  // update new source
             break;
  }
  if (last_source != configuration.GridSq_source) config_dirty = 1;  // update EEPROM with change

