K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
        #if defined(FEATURE_TOUCH_DISPLAY)
          #ifndef USE_TOUCH_TASK
            check_touch_buttons();
          #endif
            if (button_active) process_buttons();  //button_ID);  // process any touch item  
        #endif

        #ifdef FEATURE_BT_KEYBOARD
            BT_Keyboard_Status();
            #ifndef USE_BT_TASK
              check_bt_keyboard();// check for BT events before PS2 events
            #endif
        #endif

        #if defined (FEATURE_PS2_KEYBOARD) || defined (FEATURE_BT_KEYBOARD) || defined(FEATURE_TOUCH_DISPLAY)
            check_ps2_keyboard();
        #endif
        
        #ifdef FEATURE_GPS
            check_gps(false, false);            
        #endif

        #ifdef FEATURE_COMPASS
          check_compass();
        #endif
        
        #if defined(FEATURE_USB_KEYBOARD) || defined(FEATURE_USB_MOUSE)
            service_usb();
        #endif  

        check_for_dirty_configuration();

        #ifdef FEATURE_DEAD_OP_WATCHDOG
            check_for_dead_op();
        #endif

        #ifdef FEATURE_MEMORIES
            check_memory_repeat();
        #endif

        #ifdef FEATURE_DISPLAY
            check_paddles();
            service_send_buffer(PRINTCHAR);
            service_display();
        #endif
        
        #ifdef FEATURE_CW_DECODER
            service_cw_decoder();
        #endif
        
        #ifdef FEATURE_LED_RING
            update_led_ring();
        #endif 
            
        #ifdef FEATURE_SLEEP
            check_sleep();
        #endif

        #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
            check_backlight();
        #endif

        #ifdef FEATURE_PTT_INTERLOCK
            service_ptt_interlock();
        #endif
        
        #ifdef FEATURE_PADDLE_ECHO
            service_paddle_echo();
        #endif    

        #ifdef FEATURE_STRAIGHT_KEY
            service_straight_key();
        #endif

        #if defined(FEATURE_COMPETITION_COMPRESSION_DETECTION)
            service_competition_compression_detection();
        #endif

        #if defined(OPTION_WINKEY_SEND_BREAKIN_STATUS_BYTE) && defined(FEATURE_WINKEY_EMULATION)
            service_winkey_breakin();
        #endif  

        #if defined(FEATURE_ETHERNET)
            check_for_network_restart();
            #if defined(FEATURE_WEB_SERVER)
            service_web_server();
            #endif
            #if defined(FEATURE_INTERNET_LINK)
            service_udp_send_buffer();
            service_udp_receive();
            service_internet_link_udp_receive_buffer();
            #endif
        #endif  

        #ifdef FEATURE_SIDETONE_SWITCH
            check_sidetone_switch();
        #endif

        #if defined(FEATURE_4x4_KEYPAD) || defined(FEATURE_3x4_KEYPAD)
            service_keypad();
        #endif

        #ifdef FEATURE_SD_CARD_SUPPORT
            service_sd_card();    
        #endif

        #ifdef FEATURE_SEQUENCER
            check_sequencer_tail_time();
        #endif  

        #ifdef FEATURE_SO2R_SWITCHES
            so2r_switches();
        #endif

        service_async_eeprom_write();
        
      }  // end if keyer == normal

      service_sending_pins();
      service_millis_rollover(); 
    //} // end if mutex
    //xSemaphoreGive (xMutex);  // release the mutex
  }
}

//void timer_1s_callback(TimerHandle_t xTimer) {
//  ESP_LOGI("TIMER", "1 Second Timer Triggered");
//}
  
// --------------------------------------------------------------------------------------------
//void loop()

#if defined(PROJECT_ESP32_COMPILER)
extern "C" { void app_main (void) 
#else
void app_main(void)
#endif
{
  
  #if defined(USE_TOUCH_TASK) || defined(USE_BT_TASK) || defined(USE_TASK)
    BaseType_t xReturned;
  #endif

  #if defined(PROJECT_ESP32_COMPILER)
    initArduino();  // Initialize the Arduino environment
    setup_esp(); // call actual setup
  #endif

  //TimerHandle_t my_timer = xTimerCreate(
  //                "timer_1s",
  //                pdMS_TO_TICKS(1000),
  //                pdTRUE, NULL,
  //                timer_1s_callback);


  #if defined(FEATURE_GPS) && defined(USE_GPS_TASK)
    TaskHandle_t xHandle_GPS = NULL;
    xReturned = xTaskCreate(
                check_gps,      /* Function that implements the task. */
                "Chk_GPS",          /* Text name for the task. */
                2048,      /* Stack size in words, not bytes. */
                ( void * ) 1,    /* Parameter passed into the task. */
                5, /* Priority at which the task is created. */
                &xHandle_GPS);
  #endif

  #if defined(FEATURE_TOUCH_DISPLAY) && defined(USE_TOUCH_TASK)
    TaskHandle_t xHandle_TOUCH = NULL;
    xReturned = xTaskCreate(
                check_touch_buttons,      /* Function that implements the task. */
                "Chk_Touch",          /* Text name for the task. */
                2048,      /* Stack size in words, not bytes. */
                ( void * ) 1,    /* Parameter passed into the task. */
                5, /* Priority at which the task is created. */
                &xHandle_TOUCH);
  #endif


  #if defined(FEATURE_BT_KEYBOARD) && defined(USE_BT_TASK)
    TaskHandle_t xHandle_BT = NULL;
    xReturned = xTaskCreate(
                check_bt_keyboard,       /* Function that implements the task. */
                "Chk_BT_Keys",          /* Text name for the task. */
                12000,      /* Stack size in words, not bytes. */
                ( void * ) 1,    /* Parameter passed into the task. */
                7,/* Priority at which the task is created. */
                NULL); //&xHandle_BT );
  #endif
  
  #if defined(USE_TASK)
    TaskHandle_t xHandle_MAIN = NULL;
    xReturned = xTaskCreatePinnedToCore(
                main_loop,       /* Function that implements the task. */
                "Main_Loop",          /* Text name for the task. */
                12000,      /* Stack size in words, not bytes. */
                ( void * ) 1,    /* Parameter passed into the task. */
                4,/* Priority at which the task is created. */
                &xHandle_MAIN,
                1);  // core 0
  #endif

  while (1)
  {
    #ifdef USE_TASK
      myDelay(5000);
    #else
      main_loop();
    #endif        
    
    #if defined(FEATURE_BT_KEYBOARD) 
      #ifdef USE_BT_TASK
        //check_bt_keyboard((void*)1);
      #endif
    #endif
  }

  //if( xReturned == pdPASS )
  //{
      // The task was created. Use the task's handle to delete the task.
      //vTaskDelete( xHandle );
  //}
}

// This is to make compatible with main.ino for Arduino ID compile
#if defined(PROJECT_ESP32_COMPILER)
}
#else
void call_app_main()
{
  app_main();
}
#endif